<!DOCTYPE html>
<html>
  <head>
    <meta charset="utf-8" />
    <title>New test/os/linux/micro/org/openjdk/bench/jdk/incubator/foreign/nio/support/LibC.java</title>
    <link rel="stylesheet" href="../../../../../../../../../../../../style.css" />
  </head>
  <body>
    <pre>
  1 // Generated by jbind
  2 
  3 package org.openjdk.bench.jdk.incubator.foreign.nio.support;
  4 
  5 import jdk.incubator.jbind.core.*;
  6 import java.lang.invoke.MethodHandle;
  7 import java.lang.invoke.VarHandle;
  8 import jdk.incubator.foreign.*;
  9 import jdk.incubator.foreign.MemoryLayout.PathElement;
 10 import static jdk.incubator.foreign.CSupport.*;
 11 
 12 import java.util.function.LongFunction;
 13 
 14 public final class LibC {
 15     private static final LibraryLookup[] LIBRARIES = RuntimeHelper.libraries(new String[] {});
 16     public static final class stat extends Struct&lt;stat&gt; {
 17         protected stat(MemorySegment ms) { super(ms); }
 18         public static final stat at(MemorySegment ms) { return new stat(ms); }
 19         public static final stat allocate(LongFunction&lt;MemorySegment&gt; allocator, int count) {
 20             return new stat(allocator.apply(sizeof() * count));
 21         }
 22         public static final stat allocate(LongFunction&lt;MemorySegment&gt; allocator) { return allocate(allocator, 1); }
 23         public final stat offset(int count) { return at(segment().asSlice(sizeof() * count)); }
 24 
 25         public static final GroupLayout $LAYOUT = MemoryLayout.ofStruct(
 26             C_LONG.withName(&quot;st_dev&quot;),
 27             C_LONG.withName(&quot;st_ino&quot;),
 28             C_LONG.withName(&quot;st_nlink&quot;),
 29             C_INT.withName(&quot;st_mode&quot;),
 30             C_INT.withName(&quot;st_uid&quot;),
 31             C_INT.withName(&quot;st_gid&quot;),
 32             C_INT.withName(&quot;__pad0&quot;),
 33             C_LONG.withName(&quot;st_rdev&quot;),
 34             C_LONG.withName(&quot;st_size&quot;),
 35             C_LONG.withName(&quot;st_blksize&quot;),
 36             C_LONG.withName(&quot;st_blocks&quot;),
 37             MemoryLayout.ofStruct(
 38                 C_LONG.withName(&quot;tv_sec&quot;),
 39                 C_LONG.withName(&quot;tv_nsec&quot;)
 40             ).withName(&quot;st_atim&quot;),
 41             MemoryLayout.ofStruct(
 42                 C_LONG.withName(&quot;tv_sec&quot;),
 43                 C_LONG.withName(&quot;tv_nsec&quot;)
 44             ).withName(&quot;st_mtim&quot;),
 45             MemoryLayout.ofStruct(
 46                 C_LONG.withName(&quot;tv_sec&quot;),
 47                 C_LONG.withName(&quot;tv_nsec&quot;)
 48             ).withName(&quot;st_ctim&quot;),
 49             MemoryLayout.ofSequence(3, C_LONG).withName(&quot;__glibc_reserved&quot;)
 50         ).withName(&quot;stat&quot;);
 51         public static final long sizeof() { return $LAYOUT.byteSize(); }
 52         public static final long offsetof(String fieldName) { return $LAYOUT.byteOffset(MemoryLayout.PathElement.groupElement(fieldName)); }
 53         @Override
 54         public final GroupLayout getLayout() { return $LAYOUT; }
 55 
 56         public static final VarHandle st_dev$VH = RuntimeHelper.varHandle(long.class, $LAYOUT.select(MemoryLayout.PathElement.groupElement(&quot;st_dev&quot;)));
 57         public static final long st_dev$OFFSET = 0L;
 58         public final MemorySegment st_dev$ptr() {
 59             return segment().asSlice(0L);
 60         }
 61         public final long st_dev$get() {
 62             return (long) st_dev$VH.get(st_dev$ptr());
 63         }
 64         public final void st_dev$set(long value) {
 65             st_dev$VH.set(st_dev$ptr(), value);
 66         }
 67 
 68         public static final VarHandle st_ino$VH = RuntimeHelper.varHandle(long.class, $LAYOUT.select(MemoryLayout.PathElement.groupElement(&quot;st_ino&quot;)));
 69         public static final long st_ino$OFFSET = 8L;
 70         public final MemorySegment st_ino$ptr() {
 71             return segment().asSlice(8L);
 72         }
 73         public final long st_ino$get() {
 74             return (long) st_ino$VH.get(st_ino$ptr());
 75         }
 76         public final void st_ino$set(long value) {
 77             st_ino$VH.set(st_ino$ptr(), value);
 78         }
 79 
 80         public static final VarHandle st_nlink$VH = RuntimeHelper.varHandle(long.class, $LAYOUT.select(MemoryLayout.PathElement.groupElement(&quot;st_nlink&quot;)));
 81         public static final long st_nlink$OFFSET = 16L;
 82         public final MemorySegment st_nlink$ptr() {
 83             return segment().asSlice(16L);
 84         }
 85         public final long st_nlink$get() {
 86             return (long) st_nlink$VH.get(st_nlink$ptr());
 87         }
 88         public final void st_nlink$set(long value) {
 89             st_nlink$VH.set(st_nlink$ptr(), value);
 90         }
 91 
 92         public static final VarHandle st_mode$VH = RuntimeHelper.varHandle(int.class, $LAYOUT.select(MemoryLayout.PathElement.groupElement(&quot;st_mode&quot;)));
 93         public static final long st_mode$OFFSET = 24L;
 94         public final MemorySegment st_mode$ptr() {
 95             return segment().asSlice(24L);
 96         }
 97         public final int st_mode$get() {
 98             return (int) st_mode$VH.get(st_mode$ptr());
 99         }
100         public final void st_mode$set(int value) {
101             st_mode$VH.set(st_mode$ptr(), value);
102         }
103 
104         public static final VarHandle st_uid$VH = RuntimeHelper.varHandle(int.class, $LAYOUT.select(MemoryLayout.PathElement.groupElement(&quot;st_uid&quot;)));
105         public static final long st_uid$OFFSET = 28L;
106         public final MemorySegment st_uid$ptr() {
107             return segment().asSlice(28L);
108         }
109         public final int st_uid$get() {
110             return (int) st_uid$VH.get(st_uid$ptr());
111         }
112         public final void st_uid$set(int value) {
113             st_uid$VH.set(st_uid$ptr(), value);
114         }
115 
116         public static final VarHandle st_gid$VH = RuntimeHelper.varHandle(int.class, $LAYOUT.select(MemoryLayout.PathElement.groupElement(&quot;st_gid&quot;)));
117         public static final long st_gid$OFFSET = 32L;
118         public final MemorySegment st_gid$ptr() {
119             return segment().asSlice(32L);
120         }
121         public final int st_gid$get() {
122             return (int) st_gid$VH.get(st_gid$ptr());
123         }
124         public final void st_gid$set(int value) {
125             st_gid$VH.set(st_gid$ptr(), value);
126         }
127 
128         public static final VarHandle __pad0$VH = RuntimeHelper.varHandle(int.class, $LAYOUT.select(MemoryLayout.PathElement.groupElement(&quot;__pad0&quot;)));
129         public static final long __pad0$OFFSET = 36L;
130         public final MemorySegment __pad0$ptr() {
131             return segment().asSlice(36L);
132         }
133         public final int __pad0$get() {
134             return (int) __pad0$VH.get(__pad0$ptr());
135         }
136         public final void __pad0$set(int value) {
137             __pad0$VH.set(__pad0$ptr(), value);
138         }
139 
140         public static final VarHandle st_rdev$VH = RuntimeHelper.varHandle(long.class, $LAYOUT.select(MemoryLayout.PathElement.groupElement(&quot;st_rdev&quot;)));
141         public static final long st_rdev$OFFSET = 40L;
142         public final MemorySegment st_rdev$ptr() {
143             return segment().asSlice(40L);
144         }
145         public final long st_rdev$get() {
146             return (long) st_rdev$VH.get(st_rdev$ptr());
147         }
148         public final void st_rdev$set(long value) {
149             st_rdev$VH.set(st_rdev$ptr(), value);
150         }
151 
152         public static final VarHandle st_size$VH = RuntimeHelper.varHandle(long.class, $LAYOUT.select(MemoryLayout.PathElement.groupElement(&quot;st_size&quot;)));
153         public static final long st_size$OFFSET = 48L;
154         public final MemorySegment st_size$ptr() {
155             return segment().asSlice(48L);
156         }
157         public final long st_size$get() {
158             return (long) st_size$VH.get(st_size$ptr());
159         }
160         public final void st_size$set(long value) {
161             st_size$VH.set(st_size$ptr(), value);
162         }
163 
164         public static final VarHandle st_blksize$VH = RuntimeHelper.varHandle(long.class, $LAYOUT.select(MemoryLayout.PathElement.groupElement(&quot;st_blksize&quot;)));
165         public static final long st_blksize$OFFSET = 56L;
166         public final MemorySegment st_blksize$ptr() {
167             return segment().asSlice(56L);
168         }
169         public final long st_blksize$get() {
170             return (long) st_blksize$VH.get(st_blksize$ptr());
171         }
172         public final void st_blksize$set(long value) {
173             st_blksize$VH.set(st_blksize$ptr(), value);
174         }
175 
176         public static final VarHandle st_blocks$VH = RuntimeHelper.varHandle(long.class, $LAYOUT.select(MemoryLayout.PathElement.groupElement(&quot;st_blocks&quot;)));
177         public static final long st_blocks$OFFSET = 64L;
178         public final MemorySegment st_blocks$ptr() {
179             return segment().asSlice(64L);
180         }
181         public final long st_blocks$get() {
182             return (long) st_blocks$VH.get(st_blocks$ptr());
183         }
184         public final void st_blocks$set(long value) {
185             st_blocks$VH.set(st_blocks$ptr(), value);
186         }
187 
188         public static final long st_atim$OFFSET = 72L;
189         public final MemorySegment st_atim$ptr() {
190             return segment().asSlice(72L);
191         }
192         public final timespec st_atim$get() {
193             return timespec.at(st_atim$ptr());
194         }
195         public final void st_atim$set(timespec value) {
196             timespec.at(st_atim$ptr()).asSegment().copyFrom(value.asSegment());
197         }
198 
199         public static final long st_mtim$OFFSET = 88L;
200         public final MemorySegment st_mtim$ptr() {
201             return segment().asSlice(88L);
202         }
203         public final timespec st_mtim$get() {
204             return timespec.at(st_mtim$ptr());
205         }
206         public final void st_mtim$set(timespec value) {
207             timespec.at(st_mtim$ptr()).asSegment().copyFrom(value.asSegment());
208         }
209 
210         public static final long st_ctim$OFFSET = 104L;
211         public final MemorySegment st_ctim$ptr() {
212             return segment().asSlice(104L);
213         }
214         public final timespec st_ctim$get() {
215             return timespec.at(st_ctim$ptr());
216         }
217         public final void st_ctim$set(timespec value) {
218             timespec.at(st_ctim$ptr()).asSegment().copyFrom(value.asSegment());
219         }
220 
221         public static final VarHandle __glibc_reserved$VH = RuntimeHelper.varHandle(long.class, $LAYOUT.select(MemoryLayout.PathElement.groupElement(&quot;__glibc_reserved&quot;)));
222         public static final long __glibc_reserved$OFFSET = 120L;
223         public final MemorySegment __glibc_reserved$ptr() {
224             return segment().asSlice(120L);
225         }
226         public final long __glibc_reserved$get(long idx0) {
227             return (long) __glibc_reserved$VH.get(__glibc_reserved$ptr(), idx0);
228         }
229         public final void __glibc_reserved$set(long idx0, long value) {
230             __glibc_reserved$VH.set(__glibc_reserved$ptr(), idx0, value);
231         }
232     }
233     public static final class timespec extends Struct&lt;timespec&gt; {
234         protected timespec(MemorySegment ms) { super(ms); }
235         public static final timespec at(MemorySegment ms) { return new timespec(ms); }
236         public static final timespec allocate(LongFunction&lt;MemorySegment&gt; allocator, int count) {
237             return new timespec(allocator.apply(sizeof() * count));
238         }
239         public static final timespec allocate(LongFunction&lt;MemorySegment&gt; allocator) { return allocate(allocator, 1); }
240         public final timespec offset(int count) { return at(segment().asSlice(sizeof() * count)); }
241 
242         public static final GroupLayout $LAYOUT = MemoryLayout.ofStruct(
243             C_LONG.withName(&quot;tv_sec&quot;),
244             C_LONG.withName(&quot;tv_nsec&quot;)
245         ).withName(&quot;timespec&quot;);
246         public static final long sizeof() { return $LAYOUT.byteSize(); }
247         public static final long offsetof(String fieldName) { return $LAYOUT.byteOffset(MemoryLayout.PathElement.groupElement(fieldName)); }
248         @Override
249         public final GroupLayout getLayout() { return $LAYOUT; }
250 
251         public static final VarHandle tv_sec$VH = RuntimeHelper.varHandle(long.class, $LAYOUT.select(MemoryLayout.PathElement.groupElement(&quot;tv_sec&quot;)));
252         public static final long tv_sec$OFFSET = 0L;
253         public final MemorySegment tv_sec$ptr() {
254             return segment().asSlice(0L);
255         }
256         public final long tv_sec$get() {
257             return (long) tv_sec$VH.get(tv_sec$ptr());
258         }
259         public final void tv_sec$set(long value) {
260             tv_sec$VH.set(tv_sec$ptr(), value);
261         }
262 
263         public static final VarHandle tv_nsec$VH = RuntimeHelper.varHandle(long.class, $LAYOUT.select(MemoryLayout.PathElement.groupElement(&quot;tv_nsec&quot;)));
264         public static final long tv_nsec$OFFSET = 8L;
265         public final MemorySegment tv_nsec$ptr() {
266             return segment().asSlice(8L);
267         }
268         public final long tv_nsec$get() {
269             return (long) tv_nsec$VH.get(tv_nsec$ptr());
270         }
271         public final void tv_nsec$set(long value) {
272             tv_nsec$VH.set(tv_nsec$ptr(), value);
273         }
274     }
275     public static final class dirent extends Struct&lt;dirent&gt; {
276         protected dirent(MemorySegment ms) { super(ms); }
277         public static final dirent at(MemorySegment ms) { return new dirent(ms); }
278         public static final dirent allocate(LongFunction&lt;MemorySegment&gt; allocator, int count) {
279             return new dirent(allocator.apply(sizeof() * count));
280         }
281         public static final dirent allocate(LongFunction&lt;MemorySegment&gt; allocator) { return allocate(allocator, 1); }
282         public final dirent offset(int count) { return at(segment().asSlice(sizeof() * count)); }
283 
284         public static final GroupLayout $LAYOUT = MemoryLayout.ofStruct(
285             C_LONG.withName(&quot;d_ino&quot;),
286             C_LONG.withName(&quot;d_off&quot;),
287             C_SHORT.withName(&quot;d_reclen&quot;),
288             C_BOOL.withName(&quot;d_type&quot;),
289             MemoryLayout.ofSequence(256, C_BOOL).withName(&quot;d_name&quot;),
290             MemoryLayout.ofPaddingBits(40)
291         ).withName(&quot;dirent&quot;);
292         public static final long sizeof() { return $LAYOUT.byteSize(); }
293         public static final long offsetof(String fieldName) { return $LAYOUT.byteOffset(MemoryLayout.PathElement.groupElement(fieldName)); }
294         @Override
295         public final GroupLayout getLayout() { return $LAYOUT; }
296 
297         public static final VarHandle d_ino$VH = RuntimeHelper.varHandle(long.class, $LAYOUT.select(MemoryLayout.PathElement.groupElement(&quot;d_ino&quot;)));
298         public static final long d_ino$OFFSET = 0L;
299         public final MemorySegment d_ino$ptr() {
300             return segment().asSlice(0L);
301         }
302         public final long d_ino$get() {
303             return (long) d_ino$VH.get(d_ino$ptr());
304         }
305         public final void d_ino$set(long value) {
306             d_ino$VH.set(d_ino$ptr(), value);
307         }
308 
309         public static final VarHandle d_off$VH = RuntimeHelper.varHandle(long.class, $LAYOUT.select(MemoryLayout.PathElement.groupElement(&quot;d_off&quot;)));
310         public static final long d_off$OFFSET = 8L;
311         public final MemorySegment d_off$ptr() {
312             return segment().asSlice(8L);
313         }
314         public final long d_off$get() {
315             return (long) d_off$VH.get(d_off$ptr());
316         }
317         public final void d_off$set(long value) {
318             d_off$VH.set(d_off$ptr(), value);
319         }
320 
321         public static final VarHandle d_reclen$VH = RuntimeHelper.varHandle(short.class, $LAYOUT.select(MemoryLayout.PathElement.groupElement(&quot;d_reclen&quot;)));
322         public static final long d_reclen$OFFSET = 16L;
323         public final MemorySegment d_reclen$ptr() {
324             return segment().asSlice(16L);
325         }
326         public final short d_reclen$get() {
327             return (short) d_reclen$VH.get(d_reclen$ptr());
328         }
329         public final void d_reclen$set(short value) {
330             d_reclen$VH.set(d_reclen$ptr(), value);
331         }
332 
333         public static final VarHandle d_type$VH = RuntimeHelper.varHandle(byte.class, $LAYOUT.select(MemoryLayout.PathElement.groupElement(&quot;d_type&quot;)));
334         public static final long d_type$OFFSET = 18L;
335         public final MemorySegment d_type$ptr() {
336             return segment().asSlice(18L);
337         }
338         public final byte d_type$get() {
339             return (byte) d_type$VH.get(d_type$ptr());
340         }
341         public final void d_type$set(byte value) {
342             d_type$VH.set(d_type$ptr(), value);
343         }
344 
345         public static final VarHandle d_name$VH = RuntimeHelper.varHandle(byte.class, $LAYOUT.select(MemoryLayout.PathElement.groupElement(&quot;d_name&quot;)));
346         public static final long d_name$OFFSET = 19L;
347         public final MemorySegment d_name$ptr() {
348             return segment().asSlice(19L);
349         }
350         public final byte d_name$get(long idx0) {
351             return (byte) d_name$VH.get(d_name$ptr(), idx0);
352         }
353         public final void d_name$set(long idx0, byte value) {
354             d_name$VH.set(d_name$ptr(), idx0, value);
355         }
356     }
357     public static final MethodHandle mh___xstat = RuntimeHelper.downcallHandle(
358         LIBRARIES, &quot;__xstat&quot;,
359         &quot;(ILjdk/incubator/foreign/MemoryAddress;Ljdk/incubator/foreign/MemoryAddress;)I&quot;,
360         FunctionDescriptor.of(C_INT,
361             C_INT,
362             C_POINTER,
363             C_POINTER
364         ), false
365     );
366     public static final int __xstat(int __ver, jdk.incubator.foreign.Addressable __filename, jdk.incubator.foreign.Addressable __stat_buf) {
367         try {
368             return (int) mh___xstat.invokeExact(__ver, __filename.address(), __stat_buf.address());
369         } catch (Throwable ex) {
370             throw new AssertionError(ex);
371         }
372     }
373     public static final MethodHandle mh_opendir = RuntimeHelper.downcallHandle(
374         LIBRARIES, &quot;opendir&quot;,
375         &quot;(Ljdk/incubator/foreign/MemoryAddress;)Ljdk/incubator/foreign/MemoryAddress;&quot;,
376         FunctionDescriptor.of(C_POINTER,
377             C_POINTER
378         ), false
379     );
380     public static final jdk.incubator.foreign.MemoryAddress opendir(jdk.incubator.foreign.Addressable __name) {
381         try {
382             return (jdk.incubator.foreign.MemoryAddress) mh_opendir.invokeExact(__name.address());
383         } catch (Throwable ex) {
384             throw new AssertionError(ex);
385         }
386     }
387     public static final MethodHandle mh_closedir = RuntimeHelper.downcallHandle(
388         LIBRARIES, &quot;closedir&quot;,
389         &quot;(Ljdk/incubator/foreign/MemoryAddress;)I&quot;,
390         FunctionDescriptor.of(C_INT,
391             C_POINTER
392         ), false
393     );
394     public static final int closedir(jdk.incubator.foreign.Addressable __dirp) {
395         try {
396             return (int) mh_closedir.invokeExact(__dirp.address());
397         } catch (Throwable ex) {
398             throw new AssertionError(ex);
399         }
400     }
401     public static final MethodHandle mh_readdir = RuntimeHelper.downcallHandle(
402         LIBRARIES, &quot;readdir&quot;,
403         &quot;(Ljdk/incubator/foreign/MemoryAddress;)Ljdk/incubator/foreign/MemoryAddress;&quot;,
404         FunctionDescriptor.of(C_POINTER,
405             C_POINTER
406         ), false
407     );
408     public static final jdk.incubator.foreign.MemoryAddress readdir(jdk.incubator.foreign.Addressable __dirp) {
409         try {
410             return (jdk.incubator.foreign.MemoryAddress) mh_readdir.invokeExact(__dirp.address());
411         } catch (Throwable ex) {
412             throw new AssertionError(ex);
413         }
414     }
415 }
416 
    </pre>
  </body>
</html>