<!DOCTYPE html>
<html>
  <head>
    <meta charset="utf-8" />
    <title>New test/os/macosx/micro/org/openjdk/bench/jdk/incubator/foreign/nio/support/LibC.java</title>
    <link rel="stylesheet" href="../../../../../../../../../../../../style.css" />
  </head>
  <body>
    <pre>
  1 // Generated by jbind
  2 
  3 package org.openjdk.bench.jdk.incubator.foreign.nio.support;
  4 
  5 import jdk.incubator.jbind.core.*;
  6 import java.lang.invoke.MethodHandle;
  7 import java.lang.invoke.VarHandle;
  8 import jdk.incubator.foreign.*;
  9 import jdk.incubator.foreign.MemoryLayout.PathElement;
 10 import static jdk.incubator.foreign.CSupport.*;
 11 
 12 import java.util.function.LongFunction;
 13 
 14 public final class LibC {
 15     private static final LibraryLookup[] LIBRARIES = RuntimeHelper.libraries(new String[] {});
 16     public static final class stat64 extends Struct&lt;stat64&gt; {
 17         protected stat64(MemorySegment ms) { super(ms); }
 18         public static final stat64 at(MemorySegment ms) { return new stat64(ms); }
 19         public static final stat64 allocate(LongFunction&lt;MemorySegment&gt; allocator, int count) {
 20             return new stat64(allocator.apply(sizeof() * count));
 21         }
 22         public static final stat64 allocate(LongFunction&lt;MemorySegment&gt; allocator) { return allocate(allocator, 1); }
 23         public final stat64 offset(int count) { return at(segment().asSlice(sizeof() * count)); }
 24 
 25         public static final GroupLayout $LAYOUT = MemoryLayout.ofStruct(
 26             C_INT.withName(&quot;st_dev&quot;),
 27             C_SHORT.withName(&quot;st_mode&quot;),
 28             C_SHORT.withName(&quot;st_nlink&quot;),
 29             C_LONG.withName(&quot;st_ino&quot;),
 30             C_INT.withName(&quot;st_uid&quot;),
 31             C_INT.withName(&quot;st_gid&quot;),
 32             C_INT.withName(&quot;st_rdev&quot;),
 33             MemoryLayout.ofPaddingBits(32),
 34             MemoryLayout.ofStruct(
 35                 C_LONG.withName(&quot;tv_sec&quot;),
 36                 C_LONG.withName(&quot;tv_nsec&quot;)
 37             ).withName(&quot;st_atimespec&quot;),
 38             MemoryLayout.ofStruct(
 39                 C_LONG.withName(&quot;tv_sec&quot;),
 40                 C_LONG.withName(&quot;tv_nsec&quot;)
 41             ).withName(&quot;st_mtimespec&quot;),
 42             MemoryLayout.ofStruct(
 43                 C_LONG.withName(&quot;tv_sec&quot;),
 44                 C_LONG.withName(&quot;tv_nsec&quot;)
 45             ).withName(&quot;st_ctimespec&quot;),
 46             MemoryLayout.ofStruct(
 47                 C_LONG.withName(&quot;tv_sec&quot;),
 48                 C_LONG.withName(&quot;tv_nsec&quot;)
 49             ).withName(&quot;st_birthtimespec&quot;),
 50             C_LONG.withName(&quot;st_size&quot;),
 51             C_LONG.withName(&quot;st_blocks&quot;),
 52             C_INT.withName(&quot;st_blksize&quot;),
 53             C_INT.withName(&quot;st_flags&quot;),
 54             C_INT.withName(&quot;st_gen&quot;),
 55             C_INT.withName(&quot;st_lspare&quot;),
 56             MemoryLayout.ofSequence(2, C_LONG).withName(&quot;st_qspare&quot;)
 57         ).withName(&quot;stat64&quot;);
 58         public static final long sizeof() { return $LAYOUT.byteSize(); }
 59         public static final long offsetof(String fieldName) { return $LAYOUT.byteOffset(MemoryLayout.PathElement.groupElement(fieldName)); }
 60         @Override
 61         public final GroupLayout getLayout() { return $LAYOUT; }
 62 
 63         public static final VarHandle st_dev$VH = RuntimeHelper.varHandle(int.class, $LAYOUT.select(MemoryLayout.PathElement.groupElement(&quot;st_dev&quot;)));
 64         public static final long st_dev$OFFSET = 0L;
 65         public final MemorySegment st_dev$ptr() {
 66             return segment().asSlice(0L);
 67         }
 68         public final int st_dev$get() {
 69             return (int) st_dev$VH.get(st_dev$ptr());
 70         }
 71         public final void st_dev$set(int value) {
 72             st_dev$VH.set(st_dev$ptr(), value);
 73         }
 74 
 75         public static final VarHandle st_mode$VH = RuntimeHelper.varHandle(short.class, $LAYOUT.select(MemoryLayout.PathElement.groupElement(&quot;st_mode&quot;)));
 76         public static final long st_mode$OFFSET = 4L;
 77         public final MemorySegment st_mode$ptr() {
 78             return segment().asSlice(4L);
 79         }
 80         public final short st_mode$get() {
 81             return (short) st_mode$VH.get(st_mode$ptr());
 82         }
 83         public final void st_mode$set(short value) {
 84             st_mode$VH.set(st_mode$ptr(), value);
 85         }
 86 
 87         public static final VarHandle st_nlink$VH = RuntimeHelper.varHandle(short.class, $LAYOUT.select(MemoryLayout.PathElement.groupElement(&quot;st_nlink&quot;)));
 88         public static final long st_nlink$OFFSET = 6L;
 89         public final MemorySegment st_nlink$ptr() {
 90             return segment().asSlice(6L);
 91         }
 92         public final short st_nlink$get() {
 93             return (short) st_nlink$VH.get(st_nlink$ptr());
 94         }
 95         public final void st_nlink$set(short value) {
 96             st_nlink$VH.set(st_nlink$ptr(), value);
 97         }
 98 
 99         public static final VarHandle st_ino$VH = RuntimeHelper.varHandle(long.class, $LAYOUT.select(MemoryLayout.PathElement.groupElement(&quot;st_ino&quot;)));
100         public static final long st_ino$OFFSET = 8L;
101         public final MemorySegment st_ino$ptr() {
102             return segment().asSlice(8L);
103         }
104         public final long st_ino$get() {
105             return (long) st_ino$VH.get(st_ino$ptr());
106         }
107         public final void st_ino$set(long value) {
108             st_ino$VH.set(st_ino$ptr(), value);
109         }
110 
111         public static final VarHandle st_uid$VH = RuntimeHelper.varHandle(int.class, $LAYOUT.select(MemoryLayout.PathElement.groupElement(&quot;st_uid&quot;)));
112         public static final long st_uid$OFFSET = 16L;
113         public final MemorySegment st_uid$ptr() {
114             return segment().asSlice(16L);
115         }
116         public final int st_uid$get() {
117             return (int) st_uid$VH.get(st_uid$ptr());
118         }
119         public final void st_uid$set(int value) {
120             st_uid$VH.set(st_uid$ptr(), value);
121         }
122 
123         public static final VarHandle st_gid$VH = RuntimeHelper.varHandle(int.class, $LAYOUT.select(MemoryLayout.PathElement.groupElement(&quot;st_gid&quot;)));
124         public static final long st_gid$OFFSET = 20L;
125         public final MemorySegment st_gid$ptr() {
126             return segment().asSlice(20L);
127         }
128         public final int st_gid$get() {
129             return (int) st_gid$VH.get(st_gid$ptr());
130         }
131         public final void st_gid$set(int value) {
132             st_gid$VH.set(st_gid$ptr(), value);
133         }
134 
135         public static final VarHandle st_rdev$VH = RuntimeHelper.varHandle(int.class, $LAYOUT.select(MemoryLayout.PathElement.groupElement(&quot;st_rdev&quot;)));
136         public static final long st_rdev$OFFSET = 24L;
137         public final MemorySegment st_rdev$ptr() {
138             return segment().asSlice(24L);
139         }
140         public final int st_rdev$get() {
141             return (int) st_rdev$VH.get(st_rdev$ptr());
142         }
143         public final void st_rdev$set(int value) {
144             st_rdev$VH.set(st_rdev$ptr(), value);
145         }
146 
147         public static final long st_atimespec$OFFSET = 32L;
148         public final MemorySegment st_atimespec$ptr() {
149             return segment().asSlice(32L);
150         }
151         public final timespec st_atimespec$get() {
152             return timespec.at(st_atimespec$ptr());
153         }
154         public final void st_atimespec$set(timespec value) {
155             timespec.at(st_atimespec$ptr()).asSegment().copyFrom(value.asSegment());
156         }
157 
158         public static final long st_mtimespec$OFFSET = 48L;
159         public final MemorySegment st_mtimespec$ptr() {
160             return segment().asSlice(48L);
161         }
162         public final timespec st_mtimespec$get() {
163             return timespec.at(st_mtimespec$ptr());
164         }
165         public final void st_mtimespec$set(timespec value) {
166             timespec.at(st_mtimespec$ptr()).asSegment().copyFrom(value.asSegment());
167         }
168 
169         public static final long st_ctimespec$OFFSET = 64L;
170         public final MemorySegment st_ctimespec$ptr() {
171             return segment().asSlice(64L);
172         }
173         public final timespec st_ctimespec$get() {
174             return timespec.at(st_ctimespec$ptr());
175         }
176         public final void st_ctimespec$set(timespec value) {
177             timespec.at(st_ctimespec$ptr()).asSegment().copyFrom(value.asSegment());
178         }
179 
180         public static final long st_birthtimespec$OFFSET = 80L;
181         public final MemorySegment st_birthtimespec$ptr() {
182             return segment().asSlice(80L);
183         }
184         public final timespec st_birthtimespec$get() {
185             return timespec.at(st_birthtimespec$ptr());
186         }
187         public final void st_birthtimespec$set(timespec value) {
188             timespec.at(st_birthtimespec$ptr()).asSegment().copyFrom(value.asSegment());
189         }
190 
191         public static final VarHandle st_size$VH = RuntimeHelper.varHandle(long.class, $LAYOUT.select(MemoryLayout.PathElement.groupElement(&quot;st_size&quot;)));
192         public static final long st_size$OFFSET = 96L;
193         public final MemorySegment st_size$ptr() {
194             return segment().asSlice(96L);
195         }
196         public final long st_size$get() {
197             return (long) st_size$VH.get(st_size$ptr());
198         }
199         public final void st_size$set(long value) {
200             st_size$VH.set(st_size$ptr(), value);
201         }
202 
203         public static final VarHandle st_blocks$VH = RuntimeHelper.varHandle(long.class, $LAYOUT.select(MemoryLayout.PathElement.groupElement(&quot;st_blocks&quot;)));
204         public static final long st_blocks$OFFSET = 104L;
205         public final MemorySegment st_blocks$ptr() {
206             return segment().asSlice(104L);
207         }
208         public final long st_blocks$get() {
209             return (long) st_blocks$VH.get(st_blocks$ptr());
210         }
211         public final void st_blocks$set(long value) {
212             st_blocks$VH.set(st_blocks$ptr(), value);
213         }
214 
215         public static final VarHandle st_blksize$VH = RuntimeHelper.varHandle(int.class, $LAYOUT.select(MemoryLayout.PathElement.groupElement(&quot;st_blksize&quot;)));
216         public static final long st_blksize$OFFSET = 112L;
217         public final MemorySegment st_blksize$ptr() {
218             return segment().asSlice(112L);
219         }
220         public final int st_blksize$get() {
221             return (int) st_blksize$VH.get(st_blksize$ptr());
222         }
223         public final void st_blksize$set(int value) {
224             st_blksize$VH.set(st_blksize$ptr(), value);
225         }
226 
227         public static final VarHandle st_flags$VH = RuntimeHelper.varHandle(int.class, $LAYOUT.select(MemoryLayout.PathElement.groupElement(&quot;st_flags&quot;)));
228         public static final long st_flags$OFFSET = 116L;
229         public final MemorySegment st_flags$ptr() {
230             return segment().asSlice(116L);
231         }
232         public final int st_flags$get() {
233             return (int) st_flags$VH.get(st_flags$ptr());
234         }
235         public final void st_flags$set(int value) {
236             st_flags$VH.set(st_flags$ptr(), value);
237         }
238 
239         public static final VarHandle st_gen$VH = RuntimeHelper.varHandle(int.class, $LAYOUT.select(MemoryLayout.PathElement.groupElement(&quot;st_gen&quot;)));
240         public static final long st_gen$OFFSET = 120L;
241         public final MemorySegment st_gen$ptr() {
242             return segment().asSlice(120L);
243         }
244         public final int st_gen$get() {
245             return (int) st_gen$VH.get(st_gen$ptr());
246         }
247         public final void st_gen$set(int value) {
248             st_gen$VH.set(st_gen$ptr(), value);
249         }
250 
251         public static final VarHandle st_lspare$VH = RuntimeHelper.varHandle(int.class, $LAYOUT.select(MemoryLayout.PathElement.groupElement(&quot;st_lspare&quot;)));
252         public static final long st_lspare$OFFSET = 124L;
253         public final MemorySegment st_lspare$ptr() {
254             return segment().asSlice(124L);
255         }
256         public final int st_lspare$get() {
257             return (int) st_lspare$VH.get(st_lspare$ptr());
258         }
259         public final void st_lspare$set(int value) {
260             st_lspare$VH.set(st_lspare$ptr(), value);
261         }
262 
263         public static final VarHandle st_qspare$VH = RuntimeHelper.varHandle(long.class, $LAYOUT.select(MemoryLayout.PathElement.groupElement(&quot;st_qspare&quot;)));
264         public static final long st_qspare$OFFSET = 128L;
265         public final MemorySegment st_qspare$ptr() {
266             return segment().asSlice(128L);
267         }
268         public final long st_qspare$get(long idx0) {
269             return (long) st_qspare$VH.get(st_qspare$ptr(), idx0);
270         }
271         public final void st_qspare$set(long idx0, long value) {
272             st_qspare$VH.set(st_qspare$ptr(), idx0, value);
273         }
274     }
275     public static final class timespec extends Struct&lt;timespec&gt; {
276         protected timespec(MemorySegment ms) { super(ms); }
277         public static final timespec at(MemorySegment ms) { return new timespec(ms); }
278         public static final timespec allocate(LongFunction&lt;MemorySegment&gt; allocator, int count) {
279             return new timespec(allocator.apply(sizeof() * count));
280         }
281         public static final timespec allocate(LongFunction&lt;MemorySegment&gt; allocator) { return allocate(allocator, 1); }
282         public final timespec offset(int count) { return at(segment().asSlice(sizeof() * count)); }
283 
284         public static final GroupLayout $LAYOUT = MemoryLayout.ofStruct(
285             C_LONG.withName(&quot;tv_sec&quot;),
286             C_LONG.withName(&quot;tv_nsec&quot;)
287         ).withName(&quot;timespec&quot;);
288         public static final long sizeof() { return $LAYOUT.byteSize(); }
289         public static final long offsetof(String fieldName) { return $LAYOUT.byteOffset(MemoryLayout.PathElement.groupElement(fieldName)); }
290         @Override
291         public final GroupLayout getLayout() { return $LAYOUT; }
292 
293         public static final VarHandle tv_sec$VH = RuntimeHelper.varHandle(long.class, $LAYOUT.select(MemoryLayout.PathElement.groupElement(&quot;tv_sec&quot;)));
294         public static final long tv_sec$OFFSET = 0L;
295         public final MemorySegment tv_sec$ptr() {
296             return segment().asSlice(0L);
297         }
298         public final long tv_sec$get() {
299             return (long) tv_sec$VH.get(tv_sec$ptr());
300         }
301         public final void tv_sec$set(long value) {
302             tv_sec$VH.set(tv_sec$ptr(), value);
303         }
304 
305         public static final VarHandle tv_nsec$VH = RuntimeHelper.varHandle(long.class, $LAYOUT.select(MemoryLayout.PathElement.groupElement(&quot;tv_nsec&quot;)));
306         public static final long tv_nsec$OFFSET = 8L;
307         public final MemorySegment tv_nsec$ptr() {
308             return segment().asSlice(8L);
309         }
310         public final long tv_nsec$get() {
311             return (long) tv_nsec$VH.get(tv_nsec$ptr());
312         }
313         public final void tv_nsec$set(long value) {
314             tv_nsec$VH.set(tv_nsec$ptr(), value);
315         }
316     }
317     public static final class _opaque_pthread_mutex_t extends Struct&lt;_opaque_pthread_mutex_t&gt; {
318         protected _opaque_pthread_mutex_t(MemorySegment ms) { super(ms); }
319         public static final _opaque_pthread_mutex_t at(MemorySegment ms) { return new _opaque_pthread_mutex_t(ms); }
320         public static final _opaque_pthread_mutex_t allocate(LongFunction&lt;MemorySegment&gt; allocator, int count) {
321             return new _opaque_pthread_mutex_t(allocator.apply(sizeof() * count));
322         }
323         public static final _opaque_pthread_mutex_t allocate(LongFunction&lt;MemorySegment&gt; allocator) { return allocate(allocator, 1); }
324         public final _opaque_pthread_mutex_t offset(int count) { return at(segment().asSlice(sizeof() * count)); }
325 
326         public static final GroupLayout $LAYOUT = MemoryLayout.ofStruct(
327             C_LONG.withName(&quot;__sig&quot;),
328             MemoryLayout.ofSequence(56, C_BOOL).withName(&quot;__opaque&quot;)
329         ).withName(&quot;_opaque_pthread_mutex_t&quot;);
330         public static final long sizeof() { return $LAYOUT.byteSize(); }
331         public static final long offsetof(String fieldName) { return $LAYOUT.byteOffset(MemoryLayout.PathElement.groupElement(fieldName)); }
332         @Override
333         public final GroupLayout getLayout() { return $LAYOUT; }
334 
335         public static final VarHandle __sig$VH = RuntimeHelper.varHandle(long.class, $LAYOUT.select(MemoryLayout.PathElement.groupElement(&quot;__sig&quot;)));
336         public static final long __sig$OFFSET = 0L;
337         public final MemorySegment __sig$ptr() {
338             return segment().asSlice(0L);
339         }
340         public final long __sig$get() {
341             return (long) __sig$VH.get(__sig$ptr());
342         }
343         public final void __sig$set(long value) {
344             __sig$VH.set(__sig$ptr(), value);
345         }
346 
347         public static final VarHandle __opaque$VH = RuntimeHelper.varHandle(byte.class, $LAYOUT.select(MemoryLayout.PathElement.groupElement(&quot;__opaque&quot;)));
348         public static final long __opaque$OFFSET = 8L;
349         public final MemorySegment __opaque$ptr() {
350             return segment().asSlice(8L);
351         }
352         public final byte __opaque$get(long idx0) {
353             return (byte) __opaque$VH.get(__opaque$ptr(), idx0);
354         }
355         public final void __opaque$set(long idx0, byte value) {
356             __opaque$VH.set(__opaque$ptr(), idx0, value);
357         }
358     }
359     public static final class dirent extends Struct&lt;dirent&gt; {
360         protected dirent(MemorySegment ms) { super(ms); }
361         public static final dirent at(MemorySegment ms) { return new dirent(ms); }
362         public static final dirent allocate(LongFunction&lt;MemorySegment&gt; allocator, int count) {
363             return new dirent(allocator.apply(sizeof() * count));
364         }
365         public static final dirent allocate(LongFunction&lt;MemorySegment&gt; allocator) { return allocate(allocator, 1); }
366         public final dirent offset(int count) { return at(segment().asSlice(sizeof() * count)); }
367 
368         public static final GroupLayout $LAYOUT = MemoryLayout.ofStruct(
369             C_LONG.withName(&quot;d_ino&quot;),
370             C_LONG.withName(&quot;d_seekoff&quot;),
371             C_SHORT.withName(&quot;d_reclen&quot;),
372             C_SHORT.withName(&quot;d_namlen&quot;),
373             C_BOOL.withName(&quot;d_type&quot;),
374             MemoryLayout.ofSequence(1024, C_BOOL).withName(&quot;d_name&quot;),
375             MemoryLayout.ofPaddingBits(24)
376         ).withName(&quot;dirent&quot;);
377         public static final long sizeof() { return $LAYOUT.byteSize(); }
378         public static final long offsetof(String fieldName) { return $LAYOUT.byteOffset(MemoryLayout.PathElement.groupElement(fieldName)); }
379         @Override
380         public final GroupLayout getLayout() { return $LAYOUT; }
381 
382         public static final VarHandle d_ino$VH = RuntimeHelper.varHandle(long.class, $LAYOUT.select(MemoryLayout.PathElement.groupElement(&quot;d_ino&quot;)));
383         public static final long d_ino$OFFSET = 0L;
384         public final MemorySegment d_ino$ptr() {
385             return segment().asSlice(0L);
386         }
387         public final long d_ino$get() {
388             return (long) d_ino$VH.get(d_ino$ptr());
389         }
390         public final void d_ino$set(long value) {
391             d_ino$VH.set(d_ino$ptr(), value);
392         }
393 
394         public static final VarHandle d_seekoff$VH = RuntimeHelper.varHandle(long.class, $LAYOUT.select(MemoryLayout.PathElement.groupElement(&quot;d_seekoff&quot;)));
395         public static final long d_seekoff$OFFSET = 8L;
396         public final MemorySegment d_seekoff$ptr() {
397             return segment().asSlice(8L);
398         }
399         public final long d_seekoff$get() {
400             return (long) d_seekoff$VH.get(d_seekoff$ptr());
401         }
402         public final void d_seekoff$set(long value) {
403             d_seekoff$VH.set(d_seekoff$ptr(), value);
404         }
405 
406         public static final VarHandle d_reclen$VH = RuntimeHelper.varHandle(short.class, $LAYOUT.select(MemoryLayout.PathElement.groupElement(&quot;d_reclen&quot;)));
407         public static final long d_reclen$OFFSET = 16L;
408         public final MemorySegment d_reclen$ptr() {
409             return segment().asSlice(16L);
410         }
411         public final short d_reclen$get() {
412             return (short) d_reclen$VH.get(d_reclen$ptr());
413         }
414         public final void d_reclen$set(short value) {
415             d_reclen$VH.set(d_reclen$ptr(), value);
416         }
417 
418         public static final VarHandle d_namlen$VH = RuntimeHelper.varHandle(short.class, $LAYOUT.select(MemoryLayout.PathElement.groupElement(&quot;d_namlen&quot;)));
419         public static final long d_namlen$OFFSET = 18L;
420         public final MemorySegment d_namlen$ptr() {
421             return segment().asSlice(18L);
422         }
423         public final short d_namlen$get() {
424             return (short) d_namlen$VH.get(d_namlen$ptr());
425         }
426         public final void d_namlen$set(short value) {
427             d_namlen$VH.set(d_namlen$ptr(), value);
428         }
429 
430         public static final VarHandle d_type$VH = RuntimeHelper.varHandle(byte.class, $LAYOUT.select(MemoryLayout.PathElement.groupElement(&quot;d_type&quot;)));
431         public static final long d_type$OFFSET = 20L;
432         public final MemorySegment d_type$ptr() {
433             return segment().asSlice(20L);
434         }
435         public final byte d_type$get() {
436             return (byte) d_type$VH.get(d_type$ptr());
437         }
438         public final void d_type$set(byte value) {
439             d_type$VH.set(d_type$ptr(), value);
440         }
441 
442         public static final VarHandle d_name$VH = RuntimeHelper.varHandle(byte.class, $LAYOUT.select(MemoryLayout.PathElement.groupElement(&quot;d_name&quot;)));
443         public static final long d_name$OFFSET = 21L;
444         public final MemorySegment d_name$ptr() {
445             return segment().asSlice(21L);
446         }
447         public final byte d_name$get(long idx0) {
448             return (byte) d_name$VH.get(d_name$ptr(), idx0);
449         }
450         public final void d_name$set(long idx0, byte value) {
451             d_name$VH.set(d_name$ptr(), idx0, value);
452         }
453     }
454     public static final MethodHandle mh_stat64 = RuntimeHelper.downcallHandle(
455         LIBRARIES, &quot;stat64&quot;,
456         &quot;(Ljdk/incubator/foreign/MemoryAddress;Ljdk/incubator/foreign/MemoryAddress;)I&quot;,
457         FunctionDescriptor.of(C_INT,
458             C_POINTER,
459             C_POINTER
460         ), false
461     );
462     public static final int stat64(jdk.incubator.foreign.Addressable x0, jdk.incubator.foreign.Addressable x1) {
463         try {
464             return (int) mh_stat64.invokeExact(x0.address(), x1.address());
465         } catch (Throwable ex) {
466             throw new AssertionError(ex);
467         }
468     }
469     public static final MethodHandle mh_closedir = RuntimeHelper.downcallHandle(
470         LIBRARIES, &quot;closedir&quot;,
471         &quot;(Ljdk/incubator/foreign/MemoryAddress;)I&quot;,
472         FunctionDescriptor.of(C_INT,
473             C_POINTER
474         ), false
475     );
476     public static final int closedir(jdk.incubator.foreign.Addressable x0) {
477         try {
478             return (int) mh_closedir.invokeExact(x0.address());
479         } catch (Throwable ex) {
480             throw new AssertionError(ex);
481         }
482     }
483     public static final MethodHandle mh_opendir = RuntimeHelper.downcallHandle(
484         LIBRARIES, &quot;opendir$INODE64&quot;,
485         &quot;(Ljdk/incubator/foreign/MemoryAddress;)Ljdk/incubator/foreign/MemoryAddress;&quot;,
486         FunctionDescriptor.of(C_POINTER,
487             C_POINTER
488         ), false
489     );
490     public static final jdk.incubator.foreign.MemoryAddress opendir(jdk.incubator.foreign.Addressable x0) {
491         try {
492             return (jdk.incubator.foreign.MemoryAddress) mh_opendir.invokeExact(x0.address());
493         } catch (Throwable ex) {
494             throw new AssertionError(ex);
495         }
496     }
497     public static final MethodHandle mh_readdir = RuntimeHelper.downcallHandle(
498         LIBRARIES, &quot;readdir$INODE64&quot;,
499         &quot;(Ljdk/incubator/foreign/MemoryAddress;)Ljdk/incubator/foreign/MemoryAddress;&quot;,
500         FunctionDescriptor.of(C_POINTER,
501             C_POINTER
502         ), false
503     );
504     public static final jdk.incubator.foreign.MemoryAddress readdir(jdk.incubator.foreign.Addressable x0) {
505         try {
506             return (jdk.incubator.foreign.MemoryAddress) mh_readdir.invokeExact(x0.address());
507         } catch (Throwable ex) {
508             throw new AssertionError(ex);
509         }
510     }
511 }
512 
    </pre>
  </body>
</html>