<!DOCTYPE html>
<html>
  <head>
    <meta charset="utf-8" />
    <title>Sdiff test/jdk/tools/jextract/BadBitfieldTest.java</title>
    <link rel="stylesheet" href="../../../../style.css" />
  </head>
<body>
<center><a href="../../java/jextract/TestTypedef.java.sdiff.html" target="_top">&lt; prev</a> <a href="../../../../index.html" target="_top">index</a> next &gt;</center>    <h2>test/jdk/tools/jextract/BadBitfieldTest.java</h2>
     <a class="print" href="javascript:print()">Print this page</a>
<table>
<tr valign="top">
<td>
<hr />
<pre>
10  * ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
11  * FITNESS FOR A PARTICULAR PURPOSE.  See the GNU General Public License
12  * version 2 for more details (a copy is included in the LICENSE file that
13  * accompanied this code).
14  *
15  * You should have received a copy of the GNU General Public License version
16  * 2 along with this work; if not, write to the Free Software Foundation,
17  * Inc., 51 Franklin St, Fifth Floor, Boston, MA 02110-1301 USA.
18  *
19  * Please contact Oracle, 500 Oracle Parkway, Redwood Shores, CA 94065 USA
20  * or visit www.oracle.com if you need additional information or have any
21  * questions.
22  */
23 
24 /*
25  * @test
26  * @requires os.family != &quot;windows&quot;
27  * @modules jdk.incubator.jextract
28  * @library /test/lib
29  * @build BadBitfieldTest
<span class="line-modified">30  * @run testng BadBitfieldTest</span>
31  */
32 
33 /*
34  * Not running on Windows since MSVC will not cross storage unit boundaries.
35  * Resulting struct on SysV is 16 bytes, but 24 on MSx64
36  *
37  * MSVC: (/d1reportSingleClassLayoutFoo)
38  * class Foo    size(24):
39  *      +---
40  *  0.    | a (bitstart=0,nbits=45)
41  *  8.    | b (bitstart=0,nbits=24)
42  *  8.    | c (bitstart=24,nbits=1)
43  * 16.    | d (bitstart=0,nbits=58)
44  *      +---
45  *
46  * SysV: (PAHole)
47  * struct Foo {
48  *     long long int a:45;                0:19   8
49  *     long long int b:24;                0:251  8
50  *     XXX 251 bits hole, try to pack
</pre>
</td>
<td>
<hr />
<pre>
10  * ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
11  * FITNESS FOR A PARTICULAR PURPOSE.  See the GNU General Public License
12  * version 2 for more details (a copy is included in the LICENSE file that
13  * accompanied this code).
14  *
15  * You should have received a copy of the GNU General Public License version
16  * 2 along with this work; if not, write to the Free Software Foundation,
17  * Inc., 51 Franklin St, Fifth Floor, Boston, MA 02110-1301 USA.
18  *
19  * Please contact Oracle, 500 Oracle Parkway, Redwood Shores, CA 94065 USA
20  * or visit www.oracle.com if you need additional information or have any
21  * questions.
22  */
23 
24 /*
25  * @test
26  * @requires os.family != &quot;windows&quot;
27  * @modules jdk.incubator.jextract
28  * @library /test/lib
29  * @build BadBitfieldTest
<span class="line-modified">30  * @run testng/othervm -Dforeign.restricted=permit BadBitfieldTest</span>
31  */
32 
33 /*
34  * Not running on Windows since MSVC will not cross storage unit boundaries.
35  * Resulting struct on SysV is 16 bytes, but 24 on MSx64
36  *
37  * MSVC: (/d1reportSingleClassLayoutFoo)
38  * class Foo    size(24):
39  *      +---
40  *  0.    | a (bitstart=0,nbits=45)
41  *  8.    | b (bitstart=0,nbits=24)
42  *  8.    | c (bitstart=24,nbits=1)
43  * 16.    | d (bitstart=0,nbits=58)
44  *      +---
45  *
46  * SysV: (PAHole)
47  * struct Foo {
48  *     long long int a:45;                0:19   8
49  *     long long int b:24;                0:251  8
50  *     XXX 251 bits hole, try to pack
</pre>
</td>
</tr>
</table>
<center><a href="../../java/jextract/TestTypedef.java.sdiff.html" target="_top">&lt; prev</a> <a href="../../../../index.html" target="_top">index</a> next &gt;</center>  </body>
</html>