<!DOCTYPE html>
<html>
  <head>
    <meta charset="utf-8" />
    <title>Sdiff test/jdk/tools/jextract/BadBitfieldTest.java</title>
    <link rel="stylesheet" href="../../../../style.css" />
  </head>
<body>
<center>&lt; prev <a href="../../../../index.html" target="_top">index</a> <a href="ConstantsTest.java.sdiff.html" target="_top">next &gt;</a></center>    <h2>test/jdk/tools/jextract/BadBitfieldTest.java</h2>
     <a class="print" href="javascript:print()">Print this page</a>
<table>
<tr valign="top">
<td>
<hr />
<pre>
 8  *
 9  * This code is distributed in the hope that it will be useful, but WITHOUT
10  * ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
11  * FITNESS FOR A PARTICULAR PURPOSE.  See the GNU General Public License
12  * version 2 for more details (a copy is included in the LICENSE file that
13  * accompanied this code).
14  *
15  * You should have received a copy of the GNU General Public License version
16  * 2 along with this work; if not, write to the Free Software Foundation,
17  * Inc., 51 Franklin St, Fifth Floor, Boston, MA 02110-1301 USA.
18  *
19  * Please contact Oracle, 500 Oracle Parkway, Redwood Shores, CA 94065 USA
20  * or visit www.oracle.com if you need additional information or have any
21  * questions.
22  */
23 
24 /*
25  * @test
26  * @requires os.family != &quot;windows&quot;
27  * @modules jdk.incubator.jextract

28  * @build BadBitfieldTest
29  * @run testng BadBitfieldTest
30  */
31 
32 /*
33  * Not running on Windows since MSVC will not cross storage unit boundaries.
34  * Resulting struct on SysV is 16 bytes, but 24 on MSx64
35  *
36  * MSVC: (/d1reportSingleClassLayoutFoo)
37  * class Foo    size(24):
38  *      +---
39  *  0.    | a (bitstart=0,nbits=45)
40  *  8.    | b (bitstart=0,nbits=24)
41  *  8.    | c (bitstart=24,nbits=1)
42  * 16.    | d (bitstart=0,nbits=58)
43  *      +---
44  *
45  * SysV: (PAHole)
46  * struct Foo {
47  *     long long int a:45;                0:19   8
</pre>
</td>
<td>
<hr />
<pre>
 8  *
 9  * This code is distributed in the hope that it will be useful, but WITHOUT
10  * ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
11  * FITNESS FOR A PARTICULAR PURPOSE.  See the GNU General Public License
12  * version 2 for more details (a copy is included in the LICENSE file that
13  * accompanied this code).
14  *
15  * You should have received a copy of the GNU General Public License version
16  * 2 along with this work; if not, write to the Free Software Foundation,
17  * Inc., 51 Franklin St, Fifth Floor, Boston, MA 02110-1301 USA.
18  *
19  * Please contact Oracle, 500 Oracle Parkway, Redwood Shores, CA 94065 USA
20  * or visit www.oracle.com if you need additional information or have any
21  * questions.
22  */
23 
24 /*
25  * @test
26  * @requires os.family != &quot;windows&quot;
27  * @modules jdk.incubator.jextract
<span class="line-added">28  * @library /test/lib</span>
29  * @build BadBitfieldTest
30  * @run testng BadBitfieldTest
31  */
32 
33 /*
34  * Not running on Windows since MSVC will not cross storage unit boundaries.
35  * Resulting struct on SysV is 16 bytes, but 24 on MSx64
36  *
37  * MSVC: (/d1reportSingleClassLayoutFoo)
38  * class Foo    size(24):
39  *      +---
40  *  0.    | a (bitstart=0,nbits=45)
41  *  8.    | b (bitstart=0,nbits=24)
42  *  8.    | c (bitstart=24,nbits=1)
43  * 16.    | d (bitstart=0,nbits=58)
44  *      +---
45  *
46  * SysV: (PAHole)
47  * struct Foo {
48  *     long long int a:45;                0:19   8
</pre>
</td>
</tr>
</table>
<center>&lt; prev <a href="../../../../index.html" target="_top">index</a> <a href="ConstantsTest.java.sdiff.html" target="_top">next &gt;</a></center>  </body>
</html>