<!DOCTYPE html>
<html>
  <head>
    <meta charset="utf-8" />
    <title>Frames core/org.openjdk.jmc.flightrecorder.rules.jdk/src/main/resources/org/openjdk/jmc/flightrecorder/rules/jdk/messages/internal/messages_ja.properties</title>
    <link rel="stylesheet" href="../../../../../../../../../../../../../style.css" />
    <script type="text/javascript" src="../../../../../../../../../../../../../navigation.js"></script>
  </head>
<body onkeypress="keypress(event);">
<a name="0"></a>
<hr />
<pre>  1 #
  2 #  Copyright (c) 2018, 2019, Oracle and/or its affiliates. All rights reserved.
  3 #
  4 #  DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS FILE HEADER.
  5 #
  6 #  The contents of this file are subject to the terms of either the Universal Permissive License 
  7 #  v 1.0 as shown at http://oss.oracle.com/licenses/upl
  8 #   
  9 #  or the following license:
 10 #   
 11 #  Redistribution and use in source and binary forms, with or without modification, are permitted
 12 #  provided that the following conditions are met:
 13 #   
 14 #  1. Redistributions of source code must retain the above copyright notice, this list of conditions
 15 #  and the following disclaimer.
 16 #   
 17 #  2. Redistributions in binary form must reproduce the above copyright notice, this list of
 18 #  conditions and the following disclaimer in the documentation and/or other materials provided with
 19 #  the distribution.
 20 #   
 21 #  3. Neither the name of the copyright holder nor the names of its contributors may be used to
 22 #  endorse or promote products derived from this software without specific prior written permission.
 23 #
 24 #  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS &quot;AS IS&quot; AND ANY EXPRESS OR
 25 #  IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND
 26 #  FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR
 27 #  CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 28 #  DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
 29 #  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 30 #  WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY
 31 #  WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 32 #
 33 Preference_SHORT_RECORDING=\u8A18\u9332\u4E0B\u9650
 34 Preference_SHORT_RECORDING_LONG=\u30EB\u30FC\u30EB\u304C\u6A5F\u80FD\u3059\u308B\u3046\u3048\u3067\u6709\u7528\u3068\u8003\u3048\u3089\u308C\u308B\u6700\u4F4E\u9650\u306E\u8A18\u9332\u306E\u9577\u3055\u3002
 35 
 36 AllocationByClassRule_RULE_NAME=\u5272\u308A\u5F53\u3066\u3089\u308C\u305F\u30AF\u30E9\u30B9
 37 # {0} is a class name
 38 AllocationByClassRule_TEXT_MESSAGE=\u6700\u3082\u5272\u308A\u5F53\u3066\u3089\u308C\u3066\u3044\u308B\u30AF\u30E9\u30B9\u306F\u304A\u305D\u3089\u304F&#39;&#39;{0}&#39;&#39;\u3067\u3059\u3002\u3053\u306E\u30AF\u30E9\u30B9\u306E\u6700\u3082\u983B\u7E41\u306A\u5272\u5F53\u3066\u30D1\u30B9\u306F\u6B21\u306E\u3068\u304A\u308A\u3067\u3059: {1}
 39 AllocationByThreadRule_RULE_NAME=\u5272\u5F53\u3066\u30B9\u30EC\u30C3\u30C9
 40 # {0} is a thread name
 41 AllocationByThreadRule_TEXT_MESSAGE=\u6700\u3082\u591A\u304F\u306E\u5272\u5F53\u3066\u3092\u5B9F\u884C\u3057\u3066\u3044\u308B\u30B9\u30EC\u30C3\u30C9\u306F\u304A\u305D\u3089\u304F&#39;&#39;{0}&#39;&#39;\u3067\u3059\u3002\u3053\u306E\u30AF\u30E9\u30B9\u306E\u6700\u3082\u983B\u7E41\u306A\u5272\u5F53\u3066\u30D1\u30B9\u306F\u6B21\u306E\u3068\u304A\u308A\u3067\u3059: {1}
 42 AllocationRuleFactory_TEXT_CLASS_INFO_LONG=\u983B\u7E41\u306B\u5272\u308A\u5F53\u3066\u3089\u308C\u308B\u30AF\u30E9\u30B9\u306F\u3001\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u306E\u524A\u6E1B\u3092\u8A66\u884C\u3059\u308B\u969B\u306E\u30B9\u30BF\u30FC\u30C8\u5730\u70B9\u3068\u3057\u3066\u6700\u9069\u3067\u3059\u3002\u6700\u3082\u4E00\u822C\u7684\u306B\u5272\u308A\u5F53\u3066\u3089\u308C\u3066\u3044\u308B\u30AF\u30E9\u30B9\u306E\u96C6\u8A08\u3055\u308C\u305F\u30B9\u30BF\u30C3\u30AF\u30FB\u30C8\u30EC\u30FC\u30B9\u3092\u53C2\u7167\u3057\u3066\u3001\u591A\u6570\u306E\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u304C\u540C\u3058\u547C\u51FA\u3057\u30D1\u30B9\u306B\u6CBF\u3063\u3066\u4F5C\u6210\u3055\u308C\u3066\u3044\u308B\u304B\u3069\u3046\u304B\u3092\u78BA\u8A8D\u3057\u3066\u304F\u3060\u3055\u3044\u3002\u6700\u3082\u983B\u7E41\u306B\u5229\u7528\u3055\u308C\u308B\u30D1\u30B9\u306E\u547C\u51FA\u3057\u3092\u6E1B\u3089\u3059\u3053\u3068\u3067\u3001\u4F5C\u6210\u3055\u308C\u308B\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306E\u6570\u3092\u524A\u6E1B\u3059\u308B\u3088\u3046\u306B\u3057\u3066\u304F\u3060\u3055\u3044\u3002
 43 AllocationRuleFactory_TEXT_THREAD_INFO_LONG=\u540C\u3058\u30B9\u30EC\u30C3\u30C9\u306B\u3088\u3063\u3066\u5B9F\u884C\u3055\u308C\u305F\u591A\u6570\u306E\u5272\u5F53\u3066\u306F\u3001\u30DE\u30EB\u30C1\u30B9\u30EC\u30C3\u30C9\u30FB\u30D7\u30ED\u30B0\u30E9\u30E0\u306E\u554F\u984C\u3092\u793A\u3059\u5834\u5408\u304C\u3042\u308A\u307E\u3059\u3002\u6700\u3082\u5272\u5F53\u3066\u7387\u306E\u9AD8\u3044\u30B9\u30EC\u30C3\u30C9\u306E\u96C6\u8A08\u3055\u308C\u305F\u30B9\u30BF\u30C3\u30AF\u30FB\u30C8\u30EC\u30FC\u30B9\u3092\u53C2\u7167\u3057\u3066\u304F\u3060\u3055\u3044\u3002\u5272\u5F53\u3066\u7387\u306E\u6291\u5236\u307E\u305F\u306F\u30A2\u30AF\u30C6\u30A3\u30D6\u30FB\u30B9\u30EC\u30C3\u30C9\u9593\u3067\u306E\u5747\u8861\u5316\u304C\u53EF\u80FD\u304B\u3069\u3046\u304B\u78BA\u8A8D\u3057\u3066\u304F\u3060\u3055\u3044\u3002
 44 ApplicationHaltsRule_HALTS_INFO_LIMIT=\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u505C\u6B62\u60C5\u5831\u5236\u9650
 45 ApplicationHaltsRule_HALTS_INFO_LIMIT_DESC=\u60C5\u5831\u901A\u77E5\u306E\u30C8\u30EA\u30AC\u30FC\u306B\u5FC5\u8981\u306A\u6642\u9593\u30A6\u30A3\u30F3\u30C9\u30A6\u306B\u304A\u3051\u308B\u3001\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u505C\u6B62\u3068\u5B9F\u884C\u6642\u9593\u306E\u6BD4\u7387
 46 ApplicationHaltsRule_HALTS_WARNING_LIMIT=\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u505C\u6B62\u8B66\u544A\u5236\u9650
 47 ApplicationHaltsRule_HALTS_WARNING_LIMIT_DESC=\u60C5\u5831\u901A\u77E5\u306E\u30C8\u30EA\u30AC\u30FC\u306B\u5FC5\u8981\u306A\u6642\u9593\u30A6\u30A3\u30F3\u30C9\u30A6\u306B\u304A\u3051\u308B\u3001\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u505C\u6B62\u3068\u5B9F\u884C\u6642\u9593\u306E\u6BD4\u7387
 48 ApplicationHaltsRule_HALTS_WINDOW_SIZE=\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u505C\u6B62\u306E\u6642\u9593\u30A6\u30A3\u30F3\u30C9\u30A6\u30FB\u30B5\u30A4\u30BA
 49 ApplicationHaltsRule_HALTS_WINDOW_SIZE_DESC=\u30EB\u30FC\u30EB\u306E\u8A55\u4FA1\u6642\u306B\u4F7F\u7528\u3055\u308C\u308B\u6642\u9593\u30A6\u30A3\u30F3\u30C9\u30A6\u30FB\u30B5\u30A4\u30BA
 50 # {0} is a concatenated string of event type ids
 51 ApplicationHaltsRule_EXTRA_EVENT_TYPES=\u6B21\u306E\u30A4\u30D9\u30F3\u30C8\u30FB\u30BF\u30A4\u30D7\u3092\u6709\u52B9\u5316\u3059\u308B\u3068\u3001\u3053\u306E\u30EB\u30FC\u30EB\u306E\u7CBE\u5EA6\u304C\u5411\u4E0A\u3057\u307E\u3059: {0}\u3002
 52 ApplicationHaltsRule_RULE_NAME=\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u505C\u6B62
 53 ApplicationHaltsRule_RULE_TEXT=\u505C\u6B62\u306B\u3088\u308A\u3001\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u52B9\u7387\u306B\u5F71\u97FF\u304C\u3042\u308A\u307E\u3057\u305F\u3002
 54 # {0} is a percentage, {1} is a timespan, {2} is a timestamp, {3} is a percentage
 55 ApplicationHaltsRule_RULE_TEXT_LONG={2}\u306B\u958B\u59CB\u3055\u308C\u305F{1}\u306E\u9593\u3001\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u505C\u6B62\u3068\u5B9F\u884C\u6642\u9593\u306E\u6700\u3082\u9AD8\u3044\u6BD4\u7387\u306F{0}%\u3067\u3057\u305F\u3002\u3053\u306E\u6642\u9593\u7BC4\u56F2\u306E\u9593\u3001\u505C\u6B62\u306E{3}%\u306FGC\u4EE5\u5916\u306E\u7406\u7531\u304C\u539F\u56E0\u3067\u3057\u305F\u3002&lt;p&gt;\u8A18\u9332\u5168\u4F53\u306B\u304A\u3051\u308B\u5408\u8A08\u505C\u6B62\u7387\u306F{4}%\u3067\u3057\u305F\u3002\u5408\u8A08\u505C\u6B62\u306E{5}%\u306F\u3001GC\u4EE5\u5916\u306E\u7406\u7531\u304C\u539F\u56E0\u3067\u3057\u305F\u3002
 56 ApplicationHaltsRule_RULE_TEXT_RECOMMENDATION=\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u505C\u6B62\u306E\u539F\u56E0\u306F\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u3067\u3042\u308B\u3053\u3068\u304C\u591A\u3044\u3067\u3059\u304C\u3001\u904E\u5EA6\u306E\u30B9\u30EC\u30C3\u30C9\u30FB\u30C0\u30F3\u30D7\u3084\u30D2\u30FC\u30D7\u30FB\u30C0\u30F3\u30D7\u306A\u3069\u304C\u539F\u56E0\u306E\u5834\u5408\u3082\u3042\u308A\u307E\u3059\u3002VM\u64CD\u4F5C\u306E\u60C5\u5831\u3001\u53EF\u80FD\u306A\u5834\u5408\u306F\u30BB\u30FC\u30D5\u30DD\u30A4\u30F3\u30C8\u56FA\u6709\u306E\u60C5\u5831\u3092\u8ABF\u67FB\u3057\u3066\u304F\u3060\u3055\u3044\u3002
 57 ApplicationHaltsRule_RULE_TEXT_OK=\u505C\u6B62\u306B\u3088\u308B\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u52B9\u7387\u3078\u306E\u5F71\u97FF\u306F\u5927\u304D\u304F\u3042\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002
 58 
 59 AutoboxingRule_RULE_NAME=\u30D7\u30EA\u30DF\u30C6\u30A3\u30D6\u304B\u3089\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u3078\u306E\u5909\u63DB
 60 AutoboxingRule_AUTOBOXING_RATIO_INFO_LIMIT=\u30D7\u30EA\u30DF\u30C6\u30A3\u30D6\u304B\u3089\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u3078\u306E\u5909\u63DB\u306E\u5272\u5F53\u3066\u7387\u60C5\u5831\u5236\u9650
 61 AutoboxingRule_AUTOBOXING_RATIO_INFO_LIMIT_DESC=\u30D7\u30EA\u30DF\u30C6\u30A3\u30D6\u304B\u3089\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u3078\u306E\u5909\u63DB\u306B\u3088\u308A\u751F\u3058\u305F\u5272\u5F53\u3066\u3068\u3001\u60C5\u5831\u901A\u77E5\u306E\u30C8\u30EA\u30AC\u30FC\u306B\u5FC5\u8981\u306A\u5408\u8A08\u5272\u5F53\u3066\u3092\u6BD4\u8F03\u3057\u305F\u3068\u304D\u306E\u6BD4\u7387\u3002
 62 AutoboxingRule_AUTOBOXING_RATIO_WARNING_LIMIT=\u30D7\u30EA\u30DF\u30C6\u30A3\u30D6\u304B\u3089\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u3078\u306E\u5909\u63DB\u306E\u5272\u5F53\u3066\u7387\u8B66\u544A\u5236\u9650
 63 AutoboxingRule_AUTOBOXING_RATIO_WARNING_LIMIT_DESC=\u30D7\u30EA\u30DF\u30C6\u30A3\u30D6\u304B\u3089\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u3078\u306E\u5909\u63DB\u306B\u3088\u308A\u751F\u3058\u305F\u5272\u5F53\u3066\u3068\u3001\u8B66\u544A\u306E\u30C8\u30EA\u30AC\u30FC\u306B\u5FC5\u8981\u306A\u5408\u8A08\u5272\u5F53\u3066\u3092\u6BD4\u8F03\u3057\u305F\u3068\u304D\u306E\u6BD4\u7387\u3002
 64 AutoboxingRule_RESULT_NO_AUTOBOXING=\u30D7\u30EA\u30DF\u30C6\u30A3\u30D6\u578B\u304B\u3089\u3001\u5BFE\u5FDC\u3059\u308B\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u578B\u3078\u306E\u5909\u63DB\u306B\u3088\u308A\u751F\u3058\u305F\u5272\u5F53\u3066\u306F\u3042\u308A\u307E\u305B\u3093\u3002
 65 # {0} is a type name
 66 AutoboxingRule_RESULT_MOST_AUTOBOXED_TYPE=\u30D7\u30EA\u30DF\u30C6\u30A3\u30D6\u304C\u5909\u63DB\u3055\u308C\u305F\u6700\u3082\u983B\u7E41\u306A\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u578B\u306F&#39;&#39;{0}&#39;&#39;\u3067\u3059\u3002
 67 # {0} is a type name, {1} is a size in bytes, {2} is a method reference string
 68 AutoboxingRule_RESULT_MOST_AUTOBOXED_TYPE_LONG=\u30D7\u30EA\u30DF\u30C6\u30A3\u30D6\u304C\u5909\u63DB\u3055\u308C\u305F\u6700\u3082\u983B\u7E41\u306A\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u578B\u306F&#39;&#39;{0}&#39;&#39;\u3067\u3001\u3053\u308C\u306B\u3088\u308A{1}\u304C\u5272\u308A\u5F53\u3066\u3089\u308C\u307E\u3057\u305F\u3002\u6700\u3082\u983B\u7E41\u306A\u30B3\u30FC\u30EB\u30FB\u30B5\u30A4\u30C8\u306F&#39;&#39;{2}&#39;&#39;\u3067\u3059\u3002
 69 AutoboxingRule_RESULT_AUTOBOXING_RATIO=\u5408\u8A08\u5272\u5F53\u3066({1})\u306E{0}%\u306F\u3001\u30D7\u30EA\u30DF\u30C6\u30A3\u30D6\u578B\u304B\u3089\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u578B\u3078\u306E\u5909\u63DB\u306B\u3088\u308A\u751F\u3058\u307E\u3057\u305F\u3002
 70 AutoboxingRule_RESULT_LONG=\u30D7\u30EA\u30DF\u30C6\u30A3\u30D6\u304B\u3089\u5BFE\u5FDC\u3059\u308B\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u578B\u3078\u306E\u5909\u63DB\u306F\u3001\u660E\u793A\u7684\u306B\u884C\u308F\u308C\u308B\u3053\u3068\u3082\u3042\u308A\u307E\u3059\u304C\u3001Autoboxing\u306B\u3088\u308A\u884C\u308F\u308C\u308B\u5834\u5408\u3082\u3042\u308A\u307E\u3059\u3002\u5408\u8A08\u5272\u5F53\u3066\u306E\u5927\u90E8\u5206\u304C\u305D\u306E\u3088\u3046\u306A\u5909\u63DB\u306B\u3088\u308A\u751F\u3058\u3066\u3044\u308B\u5834\u5408\u306F\u3001\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306E\u30BD\u30FC\u30B9\u30FB\u30B3\u30FC\u30C9\u3092\u5909\u66F4\u3057\u3066\u3001\u305D\u306E\u52D5\u4F5C\u3092\u56DE\u907F\u3059\u308B\u3053\u3068\u3092\u691C\u8A0E\u3057\u3066\u304F\u3060\u3055\u3044\u3002\u5272\u5F53\u3066\u306E\u30B9\u30BF\u30C3\u30AF\u30FB\u30C8\u30EC\u30FC\u30B9\u3092\u53C2\u7167\u3057\u3001\u30B3\u30FC\u30C9\u306E\u3069\u306E\u90E8\u5206\u3092\u5909\u66F4\u3059\u308B\u304B\u3092\u5224\u65AD\u3057\u307E\u3059\u3002\u3053\u306E\u30EB\u30FC\u30EB\u3067\u306F\u3001\u5BFE\u5FDC\u3059\u308B\u30D7\u30EA\u30DF\u30C6\u30A3\u30D6\u304C\u3042\u308B\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u578B8\u3064\u306E\u3046\u3061\u3001\u3044\u305A\u308C\u304B\u306EvalueOf\u30E1\u30BD\u30C3\u30C9\u3078\u306E\u547C\u51FA\u3057\u304C\u691C\u51FA\u3055\u308C\u307E\u3059\u3002
 71 BiasedLockingRevocationRule_CONFIG_FILTERED_CLASSES=\u30D5\u30A3\u30EB\u30BF\u3055\u308C\u305F\u30AF\u30E9\u30B9
 72 BiasedLockingRevocationRule_CONFIG_FILTERED_CLASSES_LONG=\u30EC\u30DD\u30FC\u30C8\u3057\u306A\u3044\u30AF\u30E9\u30B9\u540D\u306E\u30AB\u30F3\u30DE\u533A\u5207\u308A\u306E\u30EA\u30B9\u30C8
 73 BiasedLockingRevocationRule_CONFIG_WARNING_LIMIT=\u53D6\u6D88\u3057\u8B66\u544A\u5236\u9650
 74 BiasedLockingRevocationRule_CONFIG_WARNING_LIMIT_LONG=\u8B66\u544A\u3092\u958B\u59CB\u3059\u308B\u53D6\u6D88\u3057\u306E\u6570
 75 BiasedLockingRevocationRule_NAME=\u30D0\u30A4\u30A2\u30B9\u30FB\u30ED\u30C3\u30AF\u53D6\u6D88\u3057
 76 BiasedLockingRevocationRule_TEXT_OK=\u30D0\u30A4\u30A2\u30B9\u30FB\u30ED\u30C3\u30AF\u306B\u95A2\u308F\u308B\u3053\u3068\u3067\u7121\u52B9\u5316\u3055\u308C\u305F\u30AF\u30E9\u30B9\u306F\u3042\u308A\u307E\u305B\u3093
 77 BiasedLockingRevocationRule_TEXT_REVOKED_CLASSES_FOUND=\u5B8C\u5168\u306B\u53D6\u308A\u6D88\u3055\u308C\u305F\u30AF\u30E9\u30B9\u304C\u3042\u308A\u307E\u3059\u3002
 78 BiasedLockingRevocationRule_TEXT_REVOKED_CLASSES_FOUND_LONG=\u6B21\u306E\u30AF\u30E9\u30B9\u306F\u3001\u30D0\u30A4\u30A2\u30B9\u30FB\u30ED\u30C3\u30AF\u306E\u4F7F\u7528\u304C\u7121\u52B9\u5316\u3055\u308C\u307E\u3057\u305F:
 79 BiasedLockingRevocationRule_TEXT_REVOKE_LIMIT_CLASSES_FOUND=\u30AF\u30E9\u30B9\u306E\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u304C\u3001\u30E6\u30FC\u30B6\u30FC\u304C\u69CB\u6210\u3057\u305F\u5236\u9650\u3092\u8D85\u3048\u3066\u53D6\u308A\u6D88\u3055\u308C\u307E\u3057\u305F\u3002
 80 # {0} is the user configured revocation limit
 81 BiasedLockingRevocationRule_TEXT_REVOKE_LIMIT_CLASSES_FOUND_LONG=\u30AF\u30E9\u30B9\u306E\u6B21\u306E\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306F\u3001\u30E6\u30FC\u30B6\u30FC\u304C\u3053\u306E\u30EB\u30FC\u30EB\u306B\u69CB\u6210\u3057\u305F\u5236\u9650\u3092\u8D85\u3048\u3066\u53D6\u308A\u6D88\u3055\u308C\u307E\u3057\u305F(\u5236\u9650={0}\u3001\u7121\u52B9\u5316\u3055\u308C\u3066\u3044\u308B\u30AF\u30E9\u30B9\u306F\u542B\u307F\u307E\u305B\u3093):
 82 # {0} is the classes that were filtered out from the result.
 83 BiasedLockingRevocationRule_TEXT_EPILOGUE=&lt;p&gt;\u30D0\u30A4\u30A2\u30B9\u30FB\u30ED\u30C3\u30AF\u306F\u3001\u7AF6\u5408\u3057\u306A\u3044\u30ED\u30C3\u30AF\u306E\u30B3\u30B9\u30C8\u3092\u307B\u307C\u30ED\u30C3\u30AF\u306E\u306A\u3044\u30D1\u30D5\u30A9\u30FC\u30DE\u30F3\u30B9\u306B\u307E\u3067\u4F4E\u6E1B\u3059\u308B\u305F\u3081\u3001JVM\u3067\u4F7F\u7528\u3055\u308C\u3066\u3044\u308B\u6280\u8853\u3067\u3059\u3002\u30B9\u30EC\u30C3\u30C9\u304C\u3001\u30ED\u30C3\u30AF\u30FB\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306B\u305D\u306E\u30B9\u30EC\u30C3\u30C9\u81EA\u8EAB\u306B\u5BFE\u3059\u308B\u30D0\u30A4\u30A2\u30B9\u3092\u304B\u3051\u308B\u3068\u3001\u305D\u306E\u30B9\u30EC\u30C3\u30C9\u306B\u3088\u308B\u5F8C\u7D9A\u306E\u30ED\u30C3\u30AF\u306E\u8CA0\u8377\u304C\u975E\u5E38\u306B\u5C11\u306A\u304F\u306A\u308A\u307E\u3059\u3002\u4ED6\u306E\u30B9\u30EC\u30C3\u30C9\u304C\u4F7F\u7528\u4E2D\u306E\u30ED\u30C3\u30AF\u304C\u958B\u59CB\u3055\u308C\u308B\u3068\u3001\u305D\u306E\u30D0\u30A4\u30A2\u30B9\u306F\u53D6\u308A\u6D88\u3055\u308C\u308B\u304B\u3001\u3082\u3046\u4E00\u65B9\u306E\u30B9\u30EC\u30C3\u30C9\u306B\u5BFE\u3057\u3066\u518D\u5EA6\u30D0\u30A4\u30A2\u30B9\u304C\u304B\u3051\u3089\u308C\u307E\u3059\u3002\u3042\u308B\u3044\u306F\u3001JVM\u306E\u305D\u308C\u4EE5\u964D\u306E\u30E9\u30F3\u30BF\u30A4\u30E0\u3067\u518D\u5EA6\u30D0\u30A4\u30A2\u30B9\u304C\u304B\u3051\u3089\u308C\u306A\u3044\u3088\u3046\u53D6\u308A\u6D88\u3055\u308C\u307E\u3059\u3002&lt;/p&gt;&lt;p&gt;\u53D6\u308A\u6D88\u3055\u308C\u305F\u30AF\u30E9\u30B9\u304C\u591A\u6570\u3042\u3063\u3066\u3082\u554F\u984C\u3067\u306F\u3042\u308A\u307E\u305B\u3093\u304C\u3001\u6700\u9069\u5316\u3084\u30C1\u30E5\u30FC\u30CB\u30F3\u30B0\u3001\u8A2D\u8A08\u306E\u6539\u5584\u3092\u884C\u3046\u597D\u6A5F\u3067\u306F\u3042\u308A\u307E\u3059\u3002\u305F\u3068\u3048\u3070\u3001\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306E\u8D77\u52D5\u6642\u306B\u7AF6\u5408\u304C\u591A\u6570\u3042\u308B\u3068\u3001\u53D6\u6D88\u3057\u306E\u30B3\u30B9\u30C8\u304C\u751A\u5927\u306B\u306A\u308B\u305F\u3081\u3001&#39;&#39;-XX:BiasedLockingStartupDelay=&amp;lt;time in ms&amp;gt;&#39;&#39;\u30D5\u30E9\u30B0\u3092\u4F7F\u7528\u3057\u3066\u3001\u30D0\u30A4\u30A2\u30B9\u30FB\u30ED\u30C3\u30AF\u306E\u6709\u52B9\u5316\u3092\u9045\u3089\u305B\u308B\u3053\u3068\u304C\u8003\u3048\u3089\u308C\u307E\u3059\u3002\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u304C\u7AF6\u5408\u30ED\u30C3\u30AF\u306B\u975E\u5E38\u306B\u4F9D\u5B58\u3057\u3066\u3044\u3066\u3001\u304B\u3064\u518D\u8A2D\u8A08\u3067\u304D\u306A\u3044\u5834\u5408\u306F\u3001\u30D0\u30A4\u30A2\u30B9\u30FB\u30ED\u30C3\u30AF\u5168\u4F53\u306E\u7121\u52B9\u5316(&#39;&#39;-XX:-UseBiasedLocking&#39;&#39;)\u304C\u6709\u76CA\u3067\u3059\u3002\u30D9\u30F3\u30C1\u30DE\u30FC\u30AF\u30FB\u30C6\u30B9\u30C8\u3092\u884C\u3046\u5834\u5408\u306F\u3001&#39;&#39;-XX:BiasedLockingStartupDelay&#39;&#39;\u3092\u30BC\u30ED\u306B\u8A2D\u5B9A\u3057\u307E\u3059\u3002&lt;p&gt;&lt;p&gt;\u6B21\u306E\u30AF\u30E9\u30B9\u306F\u9664\u5916\u3055\u308C\u3066\u3044\u307E\u3057\u305F: {0}&lt;/p&gt;
 84 BiasedLockingRevocationPauseRule_CONFIG_WARNING_LIMIT=\u30D0\u30A4\u30A2\u30B9\u30FB\u30ED\u30C3\u30AF\u8B66\u544A\u5236\u9650\u6642\u9593
 85 BiasedLockingRevocationPauseRule_CONFIG_WARNING_LIMIT_LONG=\u8B66\u544A\u306E\u30C8\u30EA\u30AC\u30FC\u306B\u5FC5\u8981\u306A\u30D0\u30A4\u30A2\u30B9\u30FB\u30ED\u30C3\u30AF\u306E\u53D6\u6D88\u3057\u306B\u8CBB\u3084\u3055\u308C\u305F\u5408\u8A08\u6642\u9593
 86 BiasedLockingRevocationPauseRule_RULE_NAME=\u30D0\u30A4\u30A2\u30B9\u30FB\u30ED\u30C3\u30AF\u53D6\u6D88\u3057\u306E\u4E00\u6642\u4F11\u6B62
 87 BiasedLockingRevocationPauseRule_TEXT_INFO_LONG=\u3053\u308C\u3092\u56DE\u907F\u3059\u308B\u306B\u306F\u3001\u30D0\u30A4\u30A2\u30B9\u30FB\u30ED\u30C3\u30AF\u3092\u30AA\u30D5\u306B\u3059\u308B\u304B(&#39;-XX:-UseBiasedLocking&#39;)\u3001\u3053\u308C\u304C\u8D77\u52D5\u6642\u306B\u767A\u751F\u3059\u308B\u5834\u5408\u306F\u30D0\u30A4\u30A2\u30B9\u30FB\u30ED\u30C3\u30AF\u306E\u4F7F\u7528\u3092\u9045\u5EF6\u3057\u307E\u3059(&#39;-XX:BiasedLockingStartupDelay&#39;)\u3002
 88 # {0} is a time period
 89 BiasedLockingRevocationPauseRule_TEXT_MESSAGE=\u30D0\u30A4\u30A2\u30B9\u30FB\u30ED\u30C3\u30AF\u306E\u53D6\u6D88\u3057\u306B\u8CBB\u3084\u3057\u305F\u5408\u8A08\u6642\u9593\u306F{0}\u3067\u3057\u305F\u3002
 90 BiasedLockingRevocationPauseRule_TEXT_OK=\u30D0\u30A4\u30A2\u30B9\u30FB\u30ED\u30C3\u30AF\u306E\u53D6\u6D88\u3057\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3002
 91 BufferLostRuleFactory_CONFIG_WARN_LIMIT=\u30D0\u30C3\u30D5\u30A1\u6D88\u5931\u5236\u9650
 92 BufferLostRuleFactory_CONFIG_WARN_LIMIT_LONG=\u8B66\u544A\u306E\u30C8\u30EA\u30AC\u30FC\u306B\u5FC5\u8981\u3068\u3055\u308C\u308B\u6D88\u5931\u30D0\u30C3\u30D5\u30A1\u30FB\u30A4\u30D9\u30F3\u30C8\u306E\u6570
 93 BufferLostRuleFactory_RULE_NAME=\u6D88\u5931\u30D5\u30E9\u30A4\u30C8\u30FB\u30EC\u30B3\u30FC\u30C0\u30FB\u30D0\u30C3\u30D5\u30A1
 94 BufferLostRuleFactory_RULE_TEXT_OK=\u30D5\u30E9\u30A4\u30C8\u30FB\u30EC\u30B3\u30FC\u30C0\u30FB\u30D0\u30C3\u30D5\u30A1\u306F\u8A18\u9332\u4E2D\u306B\u6D88\u5931\u3057\u307E\u305B\u3093\u3067\u3057\u305F\u3002
 95 # {0} is a number, {1} is a size in bytes
 96 BufferLostRuleFactory_TEXT_INFO=\u5408\u8A08\u30B5\u30A4\u30BA{1}\u306E{0}\u30D5\u30E9\u30A4\u30C8\u30FB\u30EC\u30B3\u30FC\u30C0\u30FB\u30A4\u30D9\u30F3\u30C8\u30FB\u30D0\u30C3\u30D5\u30A1\u304C\u6D88\u5931\u3057\u307E\u3057\u305F\u3002
 97 # {0} is a number, {1} is a size in bytes, {2} is a time stamp
 98 BufferLostRuleFactory_TEXT_INFO_LONG={0}\u30D5\u30E9\u30A4\u30C8\u30FB\u30EC\u30B3\u30FC\u30C0\u30FB\u30A4\u30D9\u30F3\u30C8\u30FB\u30D0\u30C3\u30D5\u30A1\u304C\u6D88\u5931\u3057\u307E\u3057\u305F\u3002\u6D88\u5931\u30C7\u30FC\u30BF\u306E\u5408\u8A08\u30B5\u30A4\u30BA\u306F{1}\u3067\u3001\u6700\u521D\u306E\u6D88\u5931\u30D0\u30C3\u30D5\u30A1\u304C{2}\u3067\u767A\u751F\u3057\u3066\u3044\u307E\u3059\u3002\u30A4\u30D9\u30F3\u30C8\u306E\u3042\u308B\u30D0\u30C3\u30D5\u30A1\u306F\u3001\u30D5\u30E9\u30A4\u30C8\u30FB\u30EC\u30B3\u30FC\u30C0\u306B\u7570\u5E38\u306A\u9AD8\u30D7\u30EC\u30C3\u30B7\u30E3\u304C\u3042\u308B\u5834\u5408\u306B\u524A\u9664\u3055\u308C\u307E\u3059\u3002\u3053\u308C\u3092\u56DE\u907F\u3059\u308B\u305F\u3081\u3001\u9AD8\u3044\u30A4\u30D9\u30F3\u30C8\u7387\u307E\u305F\u306F\u5927\u304D\u306A\u30DA\u30A4\u30ED\u30FC\u30C9(\u3042\u308B\u3044\u306F\u305D\u306E\u4E21\u65B9)\u3092\u6301\u3064\u30A4\u30D9\u30F3\u30C8\u30FB\u30BF\u30A4\u30D7\u306B\u3064\u3044\u3066\u306F\u7279\u306B\u3001\u8A18\u9332\u3055\u308C\u308B\u30A4\u30D9\u30F3\u30C8\u6570\u3092\u524A\u6E1B\u3057\u3066\u304F\u3060\u3055\u3044\u3002
 99 ClassLeakingRule_CONFIG_WARNING_LIMIT=\u8B66\u544A\u5236\u9650
100 ClassLeakingRule_CONFIG_WARNING_LIMIT_LONG=\u8B66\u544A\u3092\u767A\u884C\u3059\u308B\u305F\u3081\u306E\u30AF\u30E9\u30B9\u306E\u30ED\u30FC\u30C9\u56DE\u6570\u3002
101 ClassLeakingRule_NAME=\u30AF\u30E9\u30B9\u306E\u30EA\u30FC\u30AF
102 ClassLeakingRule_TEXT_OK=\u5236\u9650\u3092\u8D85\u3048\u3066\u30ED\u30FC\u30C9\u3055\u308C\u305F\u540C\u4E00\u540D\u306E\u30AF\u30E9\u30B9\u306F\u3042\u308A\u307E\u305B\u3093\u3002
103 # {0} is the class, {1} is the number of time it was loaded
104 ClassLeakingRule_TEXT_WARN=1\u3064\u306E\u30AF\u30E9\u30B9\u304C\u30ED\u30FC\u30C9\u3055\u308C\u305F\u56DE\u6570\u3068\u3001\u305D\u306E\u30AF\u30E9\u30B9\u304C\u30A2\u30F3\u30ED\u30FC\u30C9\u3055\u308C\u305F\u56DE\u6570\u306E\u5DEE\u304C\u3001\u30E6\u30FC\u30B6\u30FC\u306B\u3088\u308A\u6307\u5B9A\u3055\u308C\u305F\u5236\u9650\u3092\u8D85\u3048\u307E\u3057\u305F\u3002\u6700\u3082\u30ED\u30FC\u30C9\u3055\u308C\u305F\u30AF\u30E9\u30B9: {0} ({1})
105 # {0} is the number of classes exceeding the limit
106 ClassLeakingRule_TEXT_WARN_LONG=\u4E00\u90E8\u306E\u30AF\u30E9\u30B9\u304C\u8907\u6570\u56DE\u30ED\u30FC\u30C9\u3055\u308C\u30011\u3064\u306E\u30AF\u30E9\u30B9\u304C\u30ED\u30FC\u30C9\u3055\u308C\u305F\u56DE\u6570\u3068\u3001\u305D\u306E\u30AF\u30E9\u30B9\u304C\u30A2\u30F3\u30ED\u30FC\u30C9\u3055\u308C\u305F\u56DE\u6570\u306E\u5DEE\u304C\u3001\u30E6\u30FC\u30B6\u30FC\u306B\u3088\u308A\u6307\u5B9A\u3055\u308C\u305F\u5236\u9650\u3092\u8D85\u3048\u307E\u3057\u305F\u3002\u3053\u308C\u81EA\u4F53\u306F\u554F\u984C\u3067\u306F\u3042\u308A\u307E\u305B\u3093\u304C\u3001\u8907\u6570\u56DE\u30ED\u30FC\u30C9\u3055\u308C\u308B\u3053\u3068\u304C\u60F3\u5B9A\u3055\u308C\u308B\u30AF\u30E9\u30B9\u304B\u3069\u3046\u304B\u3092\u78BA\u8A8D\u3057\u3001\u30AF\u30E9\u30B9\u30FB\u30ED\u30FC\u30C0\u30FC\u30FB\u30EA\u30FC\u30AF\u304C\u767A\u751F\u3057\u3066\u3044\u306A\u3044\u3053\u3068\u3092\u78BA\u304B\u3081\u3066\u304F\u3060\u3055\u3044\u3002&lt;p&gt;\u30ED\u30FC\u30C9\u3055\u308C\u305F\u4E0A\u4F4D{0}\u306E\u30AF\u30E9\u30B9:&lt;/p&gt;
107 ClassLoadingRule_CONFIG_DURATION_LIMIT=\u30AF\u30E9\u30B9\u30ED\u30FC\u30C9\u671F\u9593\u5236\u9650
108 ClassLoadingRule_CONFIG_DURATION_LIMIT_LONG=\u8B66\u544A\u3092\u30C8\u30EA\u30AC\u30FC\u3059\u308B\u5FC5\u8981\u306E\u3042\u308B\u6700\u77ED\u30AF\u30E9\u30B9\u30ED\u30FC\u30C9\u671F\u9593
109 ClassLoadingRule_CONFIG_RATIO_LIMIT=\u30AF\u30E9\u30B9\u30ED\u30FC\u30C9\u7387\u5236\u9650
110 ClassLoadingRule_CONFIG_RATIO_LIMIT_LONG=\u30AF\u30E9\u30B9\u30ED\u30FC\u30C9\u3067\u8CBB\u3084\u3055\u308C\u305F\u6642\u9593\u3068\u8A18\u9332\u306E\u5408\u8A08\u671F\u9593\u306E\u9593\u306E\u6700\u5C0F\u6BD4\u7387
111 ClassLoadingRuleFactory_RULE_NAME=\u30AF\u30E9\u30B9\u30FB\u30ED\u30FC\u30C9\u30FB\u30D7\u30EC\u30C3\u30B7\u30E3
112 ClassLoadingRuleFactory_RULE_TEXT_OK=\u3053\u306E\u8A18\u9332\u4E2D\u306E\u65B0\u898F\u30AF\u30E9\u30B9\u306E\u30ED\u30FC\u30C9\u306B\u306F\u9577\u6642\u9593\u304B\u304B\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002
113 ClassLoadingRuleFactory_TEXT_INFO=\u3053\u306E\u8A18\u9332\u4E2D\u3001{1}\u306E\u65B0\u898F\u30AF\u30E9\u30B9\u306E\u30ED\u30FC\u30C9\u306B{0}\u304B\u304B\u308A\u307E\u3057\u305F\u3002
114 ClassLoadingRuleFactory_TEXT_INFO_LONG=\u3053\u306E\u8A18\u9332\u4E2D\u3001{1}\u306E\u65B0\u898F\u30AF\u30E9\u30B9\u306E\u30ED\u30FC\u30C9\u306B{0}\u304B\u304B\u308A\u307E\u3057\u305F\u3002\u6700\u9577\u306E\u30AF\u30E9\u30B9\u30FB\u30ED\u30FC\u30C9\u30FB\u30A4\u30D9\u30F3\u30C8\u306F{2}\u304B\u304B\u308A\u307E\u3057\u305F\u3002&lt;p&gt;\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306E\u30A6\u30A9\u30FC\u30E0\u30A2\u30C3\u30D7\u30FB\u30D5\u30A7\u30FC\u30BA\u4E2D\u306B\u8A18\u9332\u304C\u767A\u751F\u3057\u305F\u5834\u5408\u3001\u3053\u308C\u306F\u60F3\u5B9A\u5185\u3067\u3059\u3002\u305D\u3046\u3067\u306F\u306A\u3044\u5834\u5408\u3001\u3053\u306E\u30AF\u30E9\u30B9\u304C\u30ED\u30FC\u30C9\u3055\u308C\u3066\u3044\u308B\u7406\u7531\u3092\u78BA\u8A8D\u3059\u308B\u3053\u3068\u3092\u304A\u85A6\u3081\u3057\u307E\u3059\u3002
115 CodeCacheRuleFactory_DEFAULT_LONG_DESCRIPTION=\u30B3\u30FC\u30C9\u30FB\u30AD\u30E3\u30C3\u30B7\u30E5\u304C\u3044\u3063\u3071\u3044\u306E\u5834\u5408\u306F\u3001JVM\u304C\u65B0\u898F\u30E1\u30BD\u30C3\u30C9\u306E\u30B3\u30F3\u30D1\u30A4\u30EB\u3092\u505C\u6B62\u3057\u3001\u30B3\u30FC\u30C9\u306E\u5B9F\u884C\u304C\u5FC5\u8981\u4EE5\u4E0A\u306B\u9045\u304F\u306A\u308A\u307E\u3059\u3002\u3053\u308C\u3092\u56DE\u907F\u3059\u308B\u306B\u306F\u3001\u30B3\u30FC\u30C9\u30FB\u30AD\u30E3\u30C3\u30B7\u30E5\u306E\u30B5\u30A4\u30BA\u3092\u5897\u3084\u3059(&#39;-XX:ReservedCodeCacheSize&#39;)\u304B\u3001\u30B3\u30F3\u30D1\u30A4\u30EB\u3057\u304D\u3044\u5024\u3092\u5897\u3084\u3057\u3066(&#39;-XX:CompileThreshold&#39;)\u304F\u3060\u3055\u3044\u3002
116 CodeCacheRuleFactory_JDK8_TEXT_WARN=\u8A18\u9332\u4E2D\u306B\u30B3\u30FC\u30C9\u30FB\u30AD\u30E3\u30C3\u30B7\u30E5\u306E\u7A7A\u304D\u304C\u7D04{0}\u3067\u3057\u305F\u3002\u3053\u308C\u304C\u554F\u984C\u306B\u306A\u3063\u305F\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002
117 CodeCacheRuleFactory_RULE_NAME=\u30B3\u30FC\u30C9\u30FB\u30AD\u30E3\u30C3\u30B7\u30E5
118 CodeCacheRuleFactory_BLOG_REFERENCE=\u30B3\u30FC\u30C9\u30FB\u30AD\u30E3\u30C3\u30B7\u30E5\u306E\u8A73\u7D30\u306F\u3001&lt;a href=&quot;https://blogs.oracle.com/poonam/why-do-i-get-message-codecache-is-full-compiler-has-been-disabled&quot;&gt;\u3053\u306E\u30D6\u30ED\u30B0\u306E\u6295\u7A3F&lt;/a&gt;\u3092\u53C2\u7167\u3057\u3066\u304F\u3060\u3055\u3044\u3002
119 CodeCacheRuleFactory_SIZE_INFO_LIMIT=\u30B3\u30FC\u30C9\u30FB\u30AD\u30E3\u30C3\u30B7\u30E5\u5360\u6709\u7387\u60C5\u5831\u5236\u9650
120 CodeCacheRuleFactory_SIZE_INFO_LIMIT_DESC=\u5360\u6709\u7387\u304C\u3053\u306E\u5236\u9650\u3092\u8D85\u3048\u308B\u3068\u3001\u30EB\u30FC\u30EB\u306B\u3088\u3063\u3066\u60C5\u5831\u306E\u7D50\u679C\u304C\u8FD4\u3055\u308C\u307E\u3059
121 CodeCacheRuleFactory_SIZE_WARN_LIMIT=\u30B3\u30FC\u30C9\u30FB\u30AD\u30E3\u30C3\u30B7\u30E5\u5360\u6709\u7387\u8B66\u544A\u5236\u9650
122 CodeCacheRuleFactory_SIZE_WARN_LIMIT_DESC=\u5360\u6709\u7387\u304C\u3053\u306E\u5236\u9650\u3092\u8D85\u3048\u308B\u3068\u3001\u30EB\u30FC\u30EB\u306B\u3088\u3063\u3066\u8B66\u544A\u306E\u7D50\u679C\u304C\u623B\u3055\u308C\u307E\u3059
123 CodeCacheRuleFactory_TEXT_OK=\u8A18\u9332\u5185\u3067\u30B3\u30FC\u30C9\u30FB\u30AD\u30E3\u30C3\u30B7\u30E5\u306E\u554F\u984C\u306F\u691C\u51FA\u3055\u308C\u307E\u305B\u3093\u3067\u3057\u305F\u3002
124 CodeCacheRuleFactory_TEXT_WARN=\u3053\u306E\u8A18\u9332\u4E2D\u306B\u30B3\u30FC\u30C9\u30FB\u30AD\u30E3\u30C3\u30B7\u30E5\u304C\u4E00\u676F\u306B\u306A\u308A\u307E\u3057\u305F\u3002
125 CodeCacheRuleFactory_TEXT_WARN_LONG=\u3053\u308C\u306F\u3001\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306E\u30B3\u30FC\u30C9\u304C\u5927\u91CF\u3067\u3042\u308B\u304B\u3001\u30B3\u30FC\u30C9\u30FB\u30AD\u30E3\u30C3\u30B7\u30E5\u304C\u5C0F\u3055\u3059\u304E\u308B\u5834\u5408\u306B\u767A\u751F\u3057\u307E\u3059\u3002\u30B3\u30FC\u30C9\u30FB\u30AD\u30E3\u30C3\u30B7\u30E5\u304C\u3044\u3063\u3071\u3044\u306E\u5834\u5408\u306F\u3001JVM\u304C\u65B0\u898F\u30E1\u30BD\u30C3\u30C9\u306E\u30B3\u30F3\u30D1\u30A4\u30EB\u3092\u505C\u6B62\u3057\u3001\u30B3\u30FC\u30C9\u306E\u5B9F\u884C\u304C\u5FC5\u8981\u4EE5\u4E0A\u306B\u9045\u304F\u306A\u308A\u307E\u3059\u3002&#39;-XX:ReservedCodeCacheSize&#39;\u3092\u4F7F\u7528\u3057\u3066\u3001&#39;-XX:ReservedCodeCacheSize=128M&#39;\u306E\u3088\u3046\u306B\u3001\u30B3\u30FC\u30C9\u30FB\u30AD\u30E3\u30C3\u30B7\u30E5\u306E\u30B5\u30A4\u30BA\u3092\u5897\u3084\u3057\u3066\u304F\u3060\u3055\u3044\u3002
126 CodeCacheRuleFactory_WARN_LONG_DESCRIPTION=\u3053\u308C\u306B\u3088\u308A\u3001\u30B3\u30FC\u30C9\u30FB\u30AD\u30E3\u30C3\u30B7\u30E5\u304C\u30B9\u30A4\u30FC\u30D7\u3055\u308C\u308B\u983B\u5EA6\u304C\u9AD8\u307E\u308A\u3001\u5360\u6709\u7387\u304C\u9AD8\u3051\u308C\u3070\u30B9\u30A4\u30FC\u30D7\u3082\u983B\u7E41\u306B\u884C\u308F\u308C\u308B\u3088\u3046\u306B\u306A\u308A\u307E\u3059\u3002
127 CodeCacheRuleFactory_WARN_SEGMENTED_HEAP_SHORT_DESCRIPTION=\u8A18\u9332\u4E2D\u306B{0}\u30B3\u30FC\u30C9\u30FB\u30D2\u30FC\u30D7\u304C50%\u3092\u8D85\u3048\u308B\u5360\u6709\u7387\u306B\u9054\u3057\u307E\u3057\u305F\u3002
128 CodeCacheRuleFactory_WARN_SEGMENTED_HEAPS_SHORT_DESCRIPTION=\u8A18\u9332\u4E2D\u306B{0}\u30B3\u30FC\u30C9\u30FB\u30D2\u30FC\u30D7\u304C50%\u3092\u8D85\u3048\u308B\u5360\u6709\u7387\u306B\u9054\u3057\u307E\u3057\u305F\u3002
129 CompareCpuRule_RULE_NAME=\u7AF6\u5408\u3057\u3066\u3044\u308BCPU\u4F7F\u7528\u7387
130 CompareCpuRule_TEXT_INFO_LONG=\u540C\u3058\u30B3\u30F3\u30D4\u30E5\u30FC\u30BF\u4E0A\u306ECPU\u3084\u4ED6\u306E\u30EA\u30BD\u30FC\u30B9\u3092\u4F7F\u7528\u3059\u308B\u30D7\u30ED\u30BB\u30B9\u304C\u4ED6\u306B\u3082\u3042\u308B\u5834\u5408\u3001\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u30FB\u30D1\u30D5\u30A9\u30FC\u30DE\u30F3\u30B9\u306B\u5F71\u97FF\u304C\u51FA\u308B\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002\u4EE3\u8868\u7684\u306A\u30D7\u30ED\u30D5\u30A1\u30A4\u30EA\u30F3\u30B0\u3092\u884C\u3046\u5834\u5408\u3001\u307E\u305F\u306F\u3088\u308A\u9AD8\u3044\u30B9\u30EB\u30FC\u30D7\u30C3\u30C8\u3092\u5F97\u308B\u5834\u5408\u306F\u3001\u30DE\u30B7\u30F3\u3067\u5B9F\u884C\u4E2D\u306ECPU\u96C6\u7D04\u7684\u306A\u4ED6\u306E\u30D7\u30ED\u30BB\u30B9\u3092\u30B7\u30E3\u30C3\u30C8\u30C0\u30A6\u30F3\u3057\u307E\u3059\u3002
131 CompareCpuRule_TEXT_TOO_FEW_SAMPLES=\u7D50\u679C\u306E\u8A08\u7B97\u306B\u4F7F\u7528\u3067\u304D\u308B\u30B5\u30F3\u30D7\u30EB\u304C\u4E0D\u8DB3\u3057\u3066\u3044\u307E\u3059\u3002
132 # {0} is a time period, {1} is a time stamp, {2} is a percentage
133 CompareCpuRule_TEXT_MESSAGE={2}\u306E\u5E73\u5747CPU\u8CA0\u8377\u306F\u3001{1}\u3067\u958B\u59CB\u3059\u308B{0}\u4E2D\u306E\u4ED6\u306E\u51E6\u7406\u304C\u539F\u56E0\u3067\u3057\u305F\u3002
134 CompareCpuRule_INFO_LIMIT=\u7AF6\u5408\u3057\u3066\u3044\u308BCPU\u4F7F\u7528\u7387\u5236\u9650
135 CompareCpuRule_INFO_LIMIT_LONG=\u60C5\u5831\u901A\u77E5\u306E\u30C8\u30EA\u30AC\u30FC\u306B\u5FC5\u8981\u3068\u3055\u308C\u308B\u3001\u4ED6\u306E\u30D7\u30ED\u30BB\u30B9\u306B\u3088\u3063\u3066\u4F7F\u7528\u3055\u308C\u308BCPU\u91CF
136 CompareCpuRule_WARNING_LIMIT=\u7AF6\u5408\u3057\u3066\u3044\u308BCPU\u4F7F\u7528\u7387\u8B66\u544A\u5236\u9650
137 CompareCpuRule_WARNING_LIMIT_LONG=\u8B66\u544A\u306E\u30C8\u30EA\u30AC\u30FC\u306B\u5FC5\u8981\u3068\u3055\u308C\u308B\u3001\u4ED6\u306E\u30D7\u30ED\u30BB\u30B9\u306B\u3088\u3063\u3066\u4F7F\u7528\u3055\u308C\u308BCPU\u91CF
138 CompressedOopsRuleFactory_RULE_NAME=\u5727\u7E2EOops
139 CompressedOopsRuleFactory_TEXT_INFO=Java\u30D2\u30FC\u30D7\u30FB\u30B5\u30A4\u30BA\u304C32GB\u3092\u4E0B\u56DE\u308A\u3001\u5727\u7E2EOops\u304C\u30AA\u30D5\u306B\u3055\u308C\u3066\u3044\u307E\u3059\u3002
140 CompressedOopsRuleFactory_TEXT_INFO_LONG=\u30D2\u30FC\u30D7\u30FB\u30B5\u30A4\u30BA\u304C32GB\u6D88\u8CBB\u30E1\u30E2\u30EA\u30FC\u3092\u4E0B\u56DE\u308A\u3001\u4E0D\u8981\u306A\u30AD\u30E3\u30C3\u30B7\u30E5\u30FB\u30D7\u30EC\u30C3\u30B7\u30E3\u3092\u3082\u305F\u3089\u3059\u5834\u5408\u306F\u3001\u5727\u7E2E\u3055\u308C\u305F\u901A\u5E38\u306E\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u30FB\u30DD\u30A4\u30F3\u30BF\u3092\u4F7F\u7528\u3057\u307E\u305B\u3093\u3002\u3053\u306E\u6A5F\u80FD\u3092\u6709\u52B9\u306B\u3059\u308B\u306B\u306F\u3001JVM\u5F15\u6570&#39;-XX:+UseCompressedOops&#39;\u3092\u4F7F\u7528\u3057\u3066\u304F\u3060\u3055\u3044\u3002
141 CompressedOopsRuleFactory_TEXT_OK=\u5727\u7E2EOops\u306E\u8A2D\u5B9A\u306FOK\u3067\u3057\u305F\u3002
142 ConcurrentFailedRuleFactory_TEXT_WARN=\u7279\u5B9A\u306E\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u4E2D\u306B\u4E26\u884C\u30E2\u30FC\u30C9\u306E\u5931\u6557\u304C\u767A\u751F\u3057\u307E\u3057\u305F\u3002
143 ConcurrentFailedRuleFactory_TEXT_WARN_LONG=\u4E26\u884C\u30E2\u30FC\u30C9\u306E\u5931\u6557\u306F\u3001\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30BF\u304CJava\u30D7\u30ED\u30B0\u30E9\u30E0\u306E\u51E6\u7406\u306B\u8FFD\u3044\u3064\u3044\u3066\u3044\u306A\u3044\u3053\u3068\u3092\u610F\u5473\u3057\u307E\u3059\u3002&lt;a href=&quot;http://www.oracle.com/technetwork/articles/java/vmoptions-jsp-140102.html&quot;&gt;-XX:InitiatingHeapOccupancyPercent&lt;/a&gt;\u306E\u5024\u3092\u4E0B\u3052\u308B\u3053\u3068\u3092\u8A66\u3057\u3066\u304F\u3060\u3055\u3044\u3002
144 ContextSwitchRule_AGGR_MAX_BLOCKS=\u6700\u5927\u30D6\u30ED\u30C3\u30AF\u6570
145 ContextSwitchRule_CONFIG_WARNING_LIMIT=\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u5207\u66FF\u3048\u7387\u8B66\u544A\u5236\u9650
146 ContextSwitchRule_CONFIG_WARNING_LIMIT_LONG=\u8B66\u544A\u306E\u30C8\u30EA\u30AC\u30FC\u306B\u5FC5\u8981\u3068\u3055\u308C\u308B\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u5207\u66FF\u3048\u7387(\u5207\u66FF\u3048/\u79D2)
147 ContextSwitchRuleFactory_RULE_NAME=\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u5207\u66FF\u3048
148 ContextSwitchRuleFactory_TEXT_INFO=\u30D7\u30ED\u30B0\u30E9\u30E0\u306F\u8A18\u9332\u4E2D\u306B\u591A\u6570\u306E\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u5207\u66FF\u3048\u3092\u5F15\u304D\u8D77\u3053\u3057\u307E\u3059\u3002
149 ContextSwitchRuleFactory_TEXT_INFO_LONG=\u30D7\u30ED\u30B0\u30E9\u30E0\u30FB\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u304C\u983B\u7E41\u306B\u5207\u308A\u66FF\u308F\u3063\u3066\u591A\u6570\u306E\u30B9\u30EC\u30C3\u30C9\u304C\u540C\u3058\u30E2\u30CB\u30BF\u30FC\u4E0A\u3067\u5F85\u6A5F\u3057\u3066\u3044\u307E\u3059\u3002\u4F7F\u7528\u3059\u308B\u30B9\u30EC\u30C3\u30C9\u6570\u306E\u524A\u6E1B\u3092\u691C\u8A0E\u3059\u308B\u304B\u3001\u4ED6\u306E\u624B\u6CD5\u306B\u3088\u3063\u3066\u30ED\u30C3\u30AF\u7AF6\u5408\u306E\u6E1B\u5C11\u3092\u8A66\u884C\u3057\u3066\u304F\u3060\u3055\u3044\u3002
150 ContextSwitchRuleFactory_TEXT_OK=\u30D7\u30ED\u30B0\u30E9\u30E0\u306F\u8A18\u9332\u4E2D\u306B\u904E\u5EA6\u306E\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u5207\u66FF\u3048\u3092\u884C\u3044\u307E\u305B\u3093\u3067\u3057\u305F\u3002
151 DMSIncidentRule_AGGR_INCIDENTS_COUNT=DMS\u30A4\u30F3\u30B7\u30C7\u30F3\u30C8
152 DMSIncidentRule_AGGR_INCIDENTS_COUNT_DESC=DMS\u30A4\u30F3\u30B7\u30C7\u30F3\u30C8\u306E\u6570
153 DMSIncidentRule_CONFIG_WARNING_LIMIT=DMS\u30A4\u30F3\u30B7\u30C7\u30F3\u30C8\u8B66\u544A\u5236\u9650
154 DMSIncidentRule_CONFIG_WARNING_LIMIT_LONG=\u8B66\u544A\u306E\u30C8\u30EA\u30AC\u30FC\u306B\u5FC5\u8981\u3068\u3055\u308C\u308BDMS\u30A4\u30F3\u30B7\u30C7\u30F3\u30C8\u306E\u6570
155 DMSIncidentRuleFactory_RULE_NAME=DMS\u30A4\u30F3\u30B7\u30C7\u30F3\u30C8
156 DMSIncidentRuleFactory_TEXT_OK=DMS\u30A4\u30F3\u30B7\u30C7\u30F3\u30C8\u304C\u8A18\u9332\u3067\u5831\u544A\u3055\u308C\u307E\u305B\u3093\u3067\u3057\u305F\u3002
157 DMSIncidentRuleFactory_TEXT_WARN=\u5831\u544A\u3055\u308C\u305FDMS\u30A4\u30F3\u30B7\u30C7\u30F3\u30C8\u304C\u3042\u308A\u307E\u3057\u305F\u3002
158 # {0} is a number
159 DMSIncidentRuleFactory_TEXT_WARN_LONG={0}\u306E\u5831\u544A\u3055\u308C\u305FDMS(\u30C0\u30A4\u30CA\u30DF\u30C3\u30AF\u30FB\u30E2\u30CB\u30BF\u30EA\u30F3\u30B0\u30FB\u30B5\u30FC\u30D3\u30B9)\u30A4\u30F3\u30B7\u30C7\u30F3\u30C8\u304C\u3042\u308A\u307E\u3059\u3002
160 DeprecatedGcRuleFactory_TEXT_WARN_PERMGEN_LONG=Java\u30E6\u30FC\u30B6\u30FC\u306F\u30AF\u30E9\u30B9\u30FB\u30E1\u30BF\u30C7\u30FC\u30BF\u306A\u3069\u306B\u4E88\u7D04\u3059\u308B\u30E1\u30E2\u30EA\u30FC\u91CF\u3092\u524D\u3082\u3063\u3066\u77E5\u308B\u5FC5\u8981\u304C\u306A\u3044\u305F\u3081\u3001PermGen\u306FJDK 8\u3067\u524A\u9664\u3055\u308C\u307E\u3057\u305F\u3002JRockit\u304A\u3088\u3073J9 JVM\u3067\u306E\u5834\u5408\u3068\u540C\u69D8\u3001\u30CD\u30A4\u30C6\u30A3\u30D6\u30FB\u30E1\u30E2\u30EA\u30FC\u304C\u73FE\u5728\u30AF\u30E9\u30B9\u30FB\u30E1\u30BF\u30C7\u30FC\u30BF\u306B\u4F7F\u7528\u3055\u308C\u3001\u5FC5\u8981\u306B\u5FDC\u3058\u3066\u52D5\u7684\u306B\u62E1\u5927\u3057\u307E\u3059\u3002java.lang.OutOfMemoryError: PermGen\u306E\u7B49\u4FA1\u6A5F\u80FD\u306F\u3055\u3089\u306B\u547C\u51FA\u3057\u304C\u96E3\u3057\u304F\u306A\u308A\u307E\u3059\u3002\u30E1\u30BF\u30B9\u30DA\u30FC\u30B9\u30FB\u30E1\u30E2\u30EA\u30FC\u306E\u518D\u5229\u7528\u306E\u8A66\u884C\u3092\u958B\u59CB\u3059\u308B\u6642\u671F\u306B\u5F71\u97FF\u3092\u53CA\u307C\u3059\u305F\u3081\u3001&lt;a href=&quot;https://docs.oracle.com/javase/8/docs/technotes/tools/unix/java.html&quot;&gt;MaxMetaspaceSize\u30D5\u30E9\u30B0&lt;/a&gt;\u3092\u78BA\u8A8D\u3057\u3066\u304F\u3060\u3055\u3044\u3002
161 DumpReason_RULE_NAME=\u30C0\u30F3\u30D7\u306E\u4F8B\u5916\u7684\u306A\u7406\u7531
162 DumpReasonRule_TEXT_OK=\u3053\u306E\u8A18\u9332\u306F\u3001\u4F8B\u5916\u7684\u306A\u7406\u7531\u3067\u30C0\u30F3\u30D7\u3055\u308C\u307E\u305B\u3093\u3067\u3057\u305F\u3002
163 DumpReasonRule_TEXT_INFO=\u3053\u306E\u8A18\u9332\u306F\u3001\u4F8B\u5916\u7684\u306A\u7406\u7531\u3067\u30C0\u30F3\u30D7\u3055\u308C\u307E\u3057\u305F\u3002
164 DumpReasonRule_TEXT_LONG_CRASH=JVM\u306E\u30AF\u30E9\u30C3\u30B7\u30E5\u304C\u539F\u56E0\u3067\u3001\u8A18\u9332\u304C\u30C0\u30F3\u30D7\u3055\u308C\u307E\u3057\u305F\u3002\u8A18\u9332\u306E\u6700\u5F8C\u306B\u3001\u4E00\u90E8\u306E\u30A4\u30D9\u30F3\u30C8\u304C\u542B\u307E\u308C\u3066\u3044\u306A\u3044\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002
165 DumpReasonRule_TEXT_LONG_OOM=\u30E1\u30E2\u30EA\u30FC\u4E0D\u8DB3\u304C\u539F\u56E0\u3067\u3001\u8A18\u9332\u304C\u30C0\u30F3\u30D7\u3055\u308C\u307E\u3057\u305F\u3002\u8A18\u9332\u306E\u6700\u5F8C\u306B\u3001\u4E00\u90E8\u306E\u30A4\u30D9\u30F3\u30C8\u304C\u542B\u307E\u308C\u3066\u3044\u306A\u3044\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002
166 DumpReasonRule_TEXT_LONG_COREDUMP=\u8A18\u9332\u306F\u30B3\u30A2\u30FB\u30C0\u30F3\u30D7\u304B\u3089\u62BD\u51FA\u3055\u308C\u307E\u3057\u305F\u3002
167 DumpReasonRule_TEXT_INFO_UNKNOWN=\u3053\u306E\u8A18\u9332\u306F\u3001\u4F8B\u5916\u7684\u306A\u7406\u7531\u3067\u306F\u306A\u304F\u3001\u4E0D\u660E\u306A\u7406\u7531\u3067\u30C0\u30F3\u30D7\u3055\u308C\u307E\u3057\u305F\u3002
168 DumpReasonRule_TEXT_LONG_UNKNOWN=\u8A18\u9332\u306F\u6B21\u306E\u7406\u7531\u3067\u30C0\u30F3\u30D7\u3055\u308C\u307E\u3057\u305F: {0}\u3002
169 DumpReasonRule_CRASH_SCORE=\u30AF\u30E9\u30C3\u30B7\u30E5\u30FB\u30B9\u30B3\u30A2
170 DumpReasonRule_CRASH_SCORE_LONG=\u30AF\u30E9\u30C3\u30B7\u30E5\u304C\u539F\u56E0\u3067\u30C0\u30F3\u30D7\u3055\u308C\u305F\u8A18\u9332\u306E\u30B9\u30B3\u30A2
171 DumpReasonRule_OOM_SCORE=OOM\u30B9\u30B3\u30A2
172 DumpReasonRule_OOM_SCORE_LONG=\u30E1\u30E2\u30EA\u30FC\u4E0D\u8DB3\u304C\u539F\u56E0\u3067\u30C0\u30F3\u30D7\u3055\u308C\u305F\u8A18\u9332\u306E\u30B9\u30B3\u30A2
173 DumpReasonRule_COREDUMP_SCORE=\u30B3\u30A2\u30FB\u30C0\u30F3\u30D7\u30FB\u30B9\u30B3\u30A2
174 DumpReasonRule_COREDUMP_SCORE_LONG=\u30B3\u30A2\u30FB\u30C0\u30F3\u30D7\u304B\u3089\u62BD\u51FA\u3055\u308C\u305F\u8A18\u9332\u306E\u30B9\u30B3\u30A2
175 DuplicateFlagsRuleFactory_RULE_NAME=\u91CD\u8907\u30D5\u30E9\u30B0
176 DuplicateFlagsRuleFactory_TEXT_OK=\u30B3\u30DE\u30F3\u30C9\u884C\u306B\u91CD\u8907JVM\u30D5\u30E9\u30B0\u304C\u3042\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002
177 DuplicateFlagsRuleFactory_TEXT_WARN_SINGULAR=1\u3064\u306EJVM\u30D5\u30E9\u30B0\u304C\u91CD\u8907\u3057\u3066\u3044\u307E\u3057\u305F\u3002
178 # {0} is a number
179 DuplicateFlagsRuleFactory_TEXT_WARN=\u91CD\u8907\u3057\u305F{0}\u500B\u306EJVM\u30D5\u30E9\u30B0\u304C\u3042\u308A\u307E\u3057\u305F\u3002
180 # {0} is an HTML list of duplicated JVM flags
181 DuplicateFlagsRuleFactory_TEXT_WARN_LONG=\u91CD\u8907\u3057\u305FJVM\u30D5\u30E9\u30B0\u306F\u3001\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306E\u8D77\u52D5\u6642\u306B\u4F7F\u7528\u3055\u308C\u305F\u30B9\u30AF\u30EA\u30D7\u30C8\u306E\u8907\u6570\u30EC\u30A4\u30E4\u30FC\u3067\u5F15\u304D\u8D77\u3053\u3055\u308C\u308B\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002\u30B9\u30AF\u30EA\u30D7\u30C8\u306E1\u3064\u3067\u30D5\u30E9\u30B0\u306E1\u3064\u3092\u5909\u66F4\u3059\u308B\u3068\u610F\u56F3\u3055\u308C\u305F\u52B9\u679C\u304C\u73FE\u308C\u306A\u3044\u5834\u5408\u304C\u3042\u308B\u305F\u3081\u3001\u91CD\u8907\u30D5\u30E9\u30B0\u304C\u3042\u308B\u3053\u3068\u306F\u5371\u967A\u3067\u3059\u3002\u3053\u308C\u306F\u7279\u306B\u3001\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u95A2\u9023\u306E\u30B7\u30B9\u30C6\u30E0\u30FB\u30D7\u30ED\u30D1\u30C6\u30A3\u306B\u3068\u3063\u3066\u5371\u967A\u306B\u306A\u308B\u3053\u3068\u304C\u3042\u308A\u307E\u3059\u3002\u30D5\u30E9\u30B0\u304C\u5B9A\u7FA9\u3055\u308C\u3066\u3044\u308B\u3059\u3079\u3066\u306E\u5834\u6240\u3092\u7279\u5B9A\u3057\u3066\u30011\u3064\u3060\u3051\u4FDD\u6301\u3059\u308B\u3088\u3046\u306B\u3057\u3066\u304F\u3060\u3055\u3044\u3002\u6B21\u306E\u30D5\u30E9\u30B0\u304C\u91CD\u8907\u3057\u3066\u3044\u307E\u3057\u305F: {0}
182 ErrorRule_CONFIG_INFO_LIMIT=\u30A8\u30E9\u30FC\u7387\u60C5\u5831\u5236\u9650
183 ErrorRule_CONFIG_INFO_LIMIT_LONG=\u60C5\u5831\u901A\u77E5\u306E\u30C8\u30EA\u30AC\u30FC\u306B\u5FC5\u8981\u306A1\u5206\u5F53\u305F\u308A\u306E\u30A8\u30E9\u30FC\u30FB\u30A4\u30D9\u30F3\u30C8\u6570
184 ErrorRule_CONFIG_WARN_LIMIT=\u30A8\u30E9\u30FC\u7387\u8B66\u544A\u5236\u9650
185 ErrorRule_CONFIG_WARN_LIMIT_LONG=\u8B66\u544A\u306E\u30C8\u30EA\u30AC\u30FC\u306B\u5FC5\u8981\u306A1\u5206\u5F53\u305F\u308A\u306E\u30A8\u30E9\u30FC\u30FB\u30A4\u30D9\u30F3\u30C8\u6570
186 ErrorRule_CONFIG_EXCLUDED_ERRORS=\u9664\u5916\u3055\u308C\u305F\u30A8\u30E9\u30FC\u30FB\u30AF\u30E9\u30B9
187 ErrorRule_CONFIG_EXCLUDED_ERRORS_LONG=\u9664\u5916\u3059\u308B\u30A8\u30E9\u30FC\u30FB\u30AF\u30E9\u30B9\u3092\u8AAC\u660E\u3059\u308B\u6B63\u898F\u8868\u73FE\u3002\u4F8B: (com.sun.el.parser.ELParser\\$LookaheadSuccess|java.lang.NoSuchMethodError)
188 ErrorRule_CONFIG_WINDOW_SIZE=\u30B9\u30E9\u30A4\u30C7\u30A3\u30F3\u30B0\u30FB\u30A6\u30A3\u30F3\u30C9\u30A6\u30FB\u30B5\u30A4\u30BA
189 ErrorRule_CONFIG_WINDOW_SIZE_LONG=1\u5206\u5F53\u305F\u308A\u306E\u30A8\u30E9\u30FC\u304C\u591A\u3044\u671F\u9593\u3092\u7279\u5B9A\u3059\u308B\u305F\u3081\u306B\u4F7F\u7528\u3055\u308C\u308B\u30B9\u30E9\u30A4\u30C7\u30A3\u30F3\u30B0\u30FB\u30A6\u30A3\u30F3\u30C9\u30A6\u306E\u30B5\u30A4\u30BA\u3002
190 ErrorRule_RULE_NAME=\u30B9\u30ED\u30FC\u3055\u308C\u305F\u30A8\u30E9\u30FC
191 ErrorRule_TEXT_OK=\u30D7\u30ED\u30B0\u30E9\u30E0\u306F\u30A8\u30E9\u30FC\u3092\u751F\u6210\u3057\u307E\u305B\u3093\u3067\u3057\u305F\u3002
192 # {0} is a number, {1} is a time range
193 ErrorRule_TEXT_WARN=\u30D7\u30ED\u30B0\u30E9\u30E0\u306F{1}\u306E\u9593\u306B1\u5206\u5F53\u305F\u308A\u5E73\u5747{0}\u4EF6\u306E\u30A8\u30E9\u30FC\u3092\u751F\u6210\u3057\u307E\u3057\u305F\u3002
194 # {0} is a number, {1} is a time range, {2} is a number, {3} is an error class name, {4} is a number
195 ErrorRule_TEXT_WARN_LONG=\u30D7\u30ED\u30B0\u30E9\u30E0\u306F{1}\u306E\u9593\u306B1\u5206\u5F53\u305F\u308A\u5E73\u5747{0}\u4EF6\u306E\u30A8\u30E9\u30FC\u3092\u751F\u6210\u3057\u307E\u3057\u305F\u3002\u5408\u8A08\u3067{2}\u4EF6\u306E\u30A8\u30E9\u30FC\u304C\u30B9\u30ED\u30FC\u3055\u308C\u307E\u3057\u305F\u3002&lt;p&gt;\u6700\u3082\u983B\u7E41\u306A\u30A8\u30E9\u30FC\u306F&#39;&#39;{3}&#39;&#39;\u3067\u3001\u3053\u308C\u306F{4}\u56DE\u30B9\u30ED\u30FC\u3055\u308C\u307E\u3057\u305F\u3002&lt;p&gt;\u30B9\u30ED\u30FC\u3055\u308C\u305F\u30A8\u30E9\u30FC\u3092\u8ABF\u67FB\u3057\u3001\u56DE\u907F\u3067\u304D\u308B\u304B\u3069\u3046\u304B\u78BA\u8A8D\u3057\u3066\u304F\u3060\u3055\u3044\u3002\u30A8\u30E9\u30FC\u306F\u3001\u30B3\u30FC\u30C9\u306E\u5B9F\u884C\u3067\u4F55\u304B\u304C\u4E0A\u624B\u304F\u3044\u304B\u306A\u304B\u3063\u305F\u3053\u3068\u3092\u793A\u3057\u3066\u304A\u308A\u3001\u30D5\u30ED\u30FC\u5236\u5FA1\u306B\u306F\u4F7F\u7528\u3067\u304D\u307E\u305B\u3093\u3002
196 # {0} is a regexp exclude string, {1} is a number
197 ErrorRule_TEXT_WARN_EXCLUDED_INFO=\u6B21\u306E\u6B63\u898F\u8868\u73FE\u306F\u3001\u3053\u306E\u30EB\u30FC\u30EB\u304B\u3089{1}\u4EF6\u306E\u30A8\u30E9\u30FC\u3092\u9664\u5916\u3059\u308B\u305F\u3081\u306B\u4F7F\u7528\u3055\u308C\u307E\u3057\u305F: &#39;&#39;{0}&#39;&#39;\u3002
198 ExceptionRule_CONFIG_INFO_LIMIT=\u4F8B\u5916\u7387\u60C5\u5831\u5236\u9650
199 ExceptionRule_CONFIG_INFO_LIMIT_LONG=\u60C5\u5831\u901A\u77E5\u306E\u30C8\u30EA\u30AC\u30FC\u306B\u5FC5\u8981\u306A1\u79D2\u5F53\u305F\u308A\u306B\u30B9\u30ED\u30FC\u3055\u308C\u308B\u4F8B\u5916\u306E\u6570
200 ExceptionRule_CONFIG_WARN_LIMIT=\u4F8B\u5916\u7387\u8B66\u544A\u5236\u9650
201 ExceptionRule_CONFIG_WARN_LIMIT_LONG=\u8B66\u544A\u306E\u30C8\u30EA\u30AC\u30FC\u306B\u5FC5\u8981\u306A1\u79D2\u5F53\u305F\u308A\u306B\u30B9\u30ED\u30FC\u3055\u308C\u308B\u4F8B\u5916\u306E\u6570
202 ExceptionRule_RULE_NAME=\u30B9\u30ED\u30FC\u3055\u308C\u305F\u4F8B\u5916
203 ExceptionRule_TEXT_INFO_LONG=\u4F8B\u5916\u306E\u30B9\u30ED\u30FC\u306F\u3001\u901A\u5E38\u306E\u30B3\u30FC\u30C9\u3092\u5B9F\u884C\u3059\u308B\u3088\u308A\u8CA0\u8377\u304C\u5927\u304D\u3044\u305F\u3081\u3001\u4F7F\u7528\u3059\u308B\u306E\u306F\u4F8B\u5916\u7684\u306A\u72B6\u6CC1\u306E\u307F\u306B\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002\u30B9\u30ED\u30FC\u3055\u308C\u305F\u4F8B\u5916\u3092\u8ABF\u67FB\u3057\u3001\u4F8B\u5916\u4EE5\u5916\u306E\u30D5\u30ED\u30FC\u5236\u5FA1\u3067\u56DE\u907F\u3067\u304D\u308B\u3082\u306E\u304C\u306A\u3044\u304B\u78BA\u8A8D\u3057\u3066\u304F\u3060\u3055\u3044\u3002
204 # {0} is a time period, {1} is a time stamp, {2} is a number
205 ExceptionRule_TEXT_MESSAGE={1}\u306B\u958B\u59CB\u3055\u308C\u305F{0}\u306E\u9593\u306B\u3001\u30D7\u30ED\u30B0\u30E9\u30E0\u306F1\u79D2\u5F53\u305F\u308A{2}\u4EF6\u306E\u4F8B\u5916\u3092\u751F\u6210\u3057\u307E\u3057\u305F\u3002
206 FatalErrorRule_RULE_NAME=\u81F4\u547D\u7684\u30A8\u30E9\u30FC
207 FatalErrorRule_TEXT_OK=JVM\u306F\u6B63\u5E38\u306B\u30B7\u30E3\u30C3\u30C8\u30C0\u30A6\u30F3\u3055\u308C\u307E\u3057\u305F\u3002
208 FatalErrorRule_TEXT_INFO=\u30C7\u30FC\u30E2\u30F3\u4EE5\u5916\u306EJava\u30B9\u30EC\u30C3\u30C9\u304C\u6B8B\u3063\u3066\u3044\u306A\u3044\u305F\u3081\u3001JVM\u306F\u30B7\u30E3\u30C3\u30C8\u30C0\u30A6\u30F3\u3055\u308C\u307E\u3057\u305F\u3002
209 FatalErrorRule_TEXT_WARN=JVM\u306F\u81F4\u547D\u7684\u30A8\u30E9\u30FC\u306E\u305F\u3081\u30B7\u30E3\u30C3\u30C8\u30C0\u30A6\u30F3\u3055\u308C\u307E\u3057\u305F\u3002\u3053\u308C\u306F\u3001\u30D7\u30ED\u30B0\u30E9\u30E0\u304C\u6B63\u5E38\u306B\u7D42\u4E86\u3057\u306A\u304B\u3063\u305F\u305F\u3081\u3001\u8ABF\u67FB\u3059\u308B\u5FC5\u8981\u304C\u3042\u308B\u3053\u3068\u3092\u793A\u3057\u3066\u3044\u307E\u3059\u3002
210 FasttimeRule_TEXT_WARN=\u3053\u306E\u30D5\u30E9\u30A4\u30C8\u8A18\u9332\u306F\u3001\u590F\u6642\u9593\u63DB\u7B97\u306E\u30D0\u30B0\u3068\u3068\u3082\u306BJVM\u3067\u4F5C\u6210\u3055\u308C\u307E\u3057\u305F\u3002
211 FasttimeRule_TEXT_WARN_LONG=\u3053\u306E\u8A18\u9332\u306E\u30BF\u30A4\u30E0\u30B9\u30BF\u30F3\u30D7\u306F\u4FE1\u983C\u6027\u304C\u306A\u304F\u3001\u5B9F\u969B\u306E\u30C7\u30FC\u30BF\u3092\u9069\u5207\u306B\u8868\u3057\u3066\u3044\u306A\u3044\u304B\u3001JMC\u306E\u554F\u984C\u3092\u5F15\u304D\u8D77\u3053\u3059\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002\u3053\u306E\u554F\u984C\u3092\u89E3\u6C7A\u3059\u308B\u306B\u306F\u3001Java 7u60\u4EE5\u4E0A\u306B\u30A2\u30C3\u30D7\u30B0\u30EC\u30FC\u30C9\u3057\u3066\u304F\u3060\u3055\u3044\u3002
212 FewSampledThreadsRule_AGGR_SAMPLES_PER_THREAD=\u30B9\u30EC\u30C3\u30C9\u5F53\u305F\u308A\u306E\u30B5\u30F3\u30D7\u30EB\u6570
213 FewSampledThreadsRule_AGGR_SAMPLES_PER_THREAD_DESC=\u30B9\u30EC\u30C3\u30C9\u5F53\u305F\u308A\u306E\u30B5\u30F3\u30D7\u30EB\u6570
214 # {0} is a percentage, {1} a time period, {2} a timestamp.
215 FewSampledThreadsRule_APPLICATION_IDLE=\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u304C\u30A2\u30A4\u30C9\u30EB\u72B6\u614B\u306E\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002{2}\u306B\u958B\u59CB\u3055\u308C\u305F{1}\u306E\u6642\u9593\u30A6\u30A3\u30F3\u30C9\u30A6\u306E\u9593\u3001JVM CPU\u306E\u6700\u5927\u5E73\u5747\u4F7F\u7528\u7387\u306F{0}%\u3067\u3057\u305F\u3002
216 FewSampledThreadsRule_APPLICATION_IDLE_LONG=\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306E\u5F85\u6A5F\u6642\u9593\u304C\u539F\u56E0\u306E\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002\u305D\u306E\u4ED6\u306E\u30EB\u30FC\u30EB\u306E\u60C5\u5831\u3092\u53C2\u7167\u3057\u3066\u304F\u3060\u3055\u3044\u3002\u307E\u305F\u306F\u3001\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u304C\u4F55\u3082\u5B9F\u884C\u3057\u3066\u3044\u306A\u3044\u53EF\u80FD\u6027\u3082\u3042\u308A\u307E\u3059\u3002
217 FewSampledThreadsRule_CPU_WINDOW_SIZE=CPU\u30A6\u30A3\u30F3\u30C9\u30A6\u30FB\u30B5\u30A4\u30BA
218 FewSampledThreadsRule_CPU_WINDOW_SIZE_LONG=CPU\u4F7F\u7528\u7387\u306E\u8A08\u7B97\u306B\u4F7F\u7528\u3055\u308C\u308B\u30B9\u30E9\u30A4\u30C7\u30A3\u30F3\u30B0\u30FB\u30A6\u30A3\u30F3\u30C9\u30A6\u30FB\u30B5\u30A4\u30BA\u3002
219 FewSampledThreadsRule_MIN_CPU_RATIO=CPU\u6700\u5C0F\u4F7F\u7528\u7387
220 FewSampledThreadsRule_MIN_CPU_RATIO_LONG=\u3053\u306E\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u304C\u30A2\u30A4\u30C9\u30EB\u72B6\u614B\u3067\u3042\u308B\u3068\u307F\u306A\u3059CPU\u6700\u5C0F\u4F7F\u7528\u7387\u3002
221 FewSampledThreadsRule_MIN_SAMPLE_COUNT=\u6700\u5C0F\u5408\u8A08\u30B5\u30F3\u30D7\u30EB\u6570
222 FewSampledThreadsRule_MIN_SAMPLE_COUNT_LONG=\u3053\u306E\u30EB\u30FC\u30EB\u304C\u9069\u7528\u3055\u308C\u308B\u3001\u8A18\u9332\u6642\u306E\u6700\u5C0F\u30B5\u30F3\u30D7\u30EB\u6570\u3002
223 FewSampledThreadsRule_MIN_SAMPLE_COUNT_PER_THREAD=\u30B9\u30EC\u30C3\u30C9\u5F53\u305F\u308A\u306E\u6700\u5C0F\u30B5\u30F3\u30D7\u30EB\u6570
224 FewSampledThreadsRule_MIN_SAMPLE_COUNT_PER_THREAD_LONG=\u30B9\u30EC\u30C3\u30C9\u304C\u30B5\u30F3\u30D7\u30EA\u30F3\u30B0\u3055\u308C\u305F\u3068\u307F\u306A\u3059\u3001\u30B9\u30EC\u30C3\u30C9\u5185\u306E\u6700\u5C0F\u30B5\u30F3\u30D7\u30EB\u6570\u3002
225 FewSampledThreadsRule_SAMPLED_THREADS_RATIO_WARNING_LIMIT=\u30B5\u30F3\u30D7\u30EB\u5316\u30B9\u30EC\u30C3\u30C9\u7387\u5236\u9650
226 FewSampledThreadsRule_SAMPLED_THREADS_RATIO_WARNING_LIMIT_LONG=\u8B66\u544A\u306E\u30C8\u30EA\u30AC\u30FC\u306B\u5FC5\u8981\u3068\u3055\u308C\u308B\u30B5\u30F3\u30D7\u30EB\u5316\u30B9\u30EC\u30C3\u30C9\u3068\u30CF\u30FC\u30C9\u30A6\u30A7\u30A2\u30FB\u30B9\u30EC\u30C3\u30C9\u9593\u306E\u6BD4\u7387\u3002
227 FewSampledThreadsRule_TEXT_OK=\u30B5\u30F3\u30D7\u30EB\u5316\u30B9\u30EC\u30C3\u30C9\u306E\u91CF\u306B\u554F\u984C\u306F\u3042\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002
228 FewSampledThreadsRule_TEXT_OK_LONG=\u30CF\u30FC\u30C9\u30A6\u30A7\u30A2\u30FB\u30B9\u30EC\u30C3\u30C9\u306E\u91CF\u3092\u8D85\u3048\u308B\u30B5\u30F3\u30D7\u30EB\u5316\u30B9\u30EC\u30C3\u30C9\u304C\u3042\u308A\u307E\u3059\u3002\u3053\u308C\u306F\u3001\u3053\u306E\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u3067\u306F\u3001\u4F7F\u7528\u53EF\u80FD\u306A\u30CF\u30FC\u30C9\u30A6\u30A7\u30A2\u306E\u4E26\u5217\u5EA6\u304C\u5341\u5206\u3067\u3042\u308B\u3053\u3068\u3092\u610F\u5473\u3057\u307E\u3059\u3002
229 # {0} and {1} are numbers
230 FewSampledThreadsRule_TEXT_NOT_ENOUGH_SAMPLES=\u8A18\u9332\u5185\u306E\u30E1\u30BD\u30C3\u30C9\u30FB\u30D7\u30ED\u30D5\u30A1\u30A4\u30EA\u30F3\u30B0\u30FB\u30B5\u30F3\u30D7\u30EB\u304C{0}\u306E\u307F\u3067\u3059\u3002\u3053\u306E\u30EB\u30FC\u30EB\u304C\u6A5F\u80FD\u3059\u308B\u306B\u306F\u3001\u5C11\u306A\u304F\u3068\u3082{1}\u306E\u30B5\u30F3\u30D7\u30EB\u304C\u5FC5\u8981\u3067\u3059\u3002
231 FewSampledThreadsRule_RULE_NAME=\u30D1\u30E9\u30EC\u30EB\u30FB\u30B9\u30EC\u30C3\u30C9
232 FewSampledThreadsRule_TEXT_INFO=\u30B5\u30F3\u30D7\u30EB\u5316\u30B9\u30EC\u30C3\u30C9\u306E\u6570\u304C\u3001\u30CF\u30FC\u30C9\u30A6\u30A7\u30A2\u30FB\u30B9\u30EC\u30C3\u30C9(\u30B3\u30A2)\u306E\u5408\u8A08\u6570\u3092\u4E0B\u56DE\u3063\u3066\u3044\u307E\u3059\u3002
233 # {0} is a count, {1} is a count, {2} is a count
234 FewSampledThreadsRule_TEXT_INFO_LONG=\u30E1\u30BD\u30C3\u30C9\u30FB\u30B5\u30F3\u30D7\u30EB\u304C\u5C11\u306A\u304F\u3068\u3082{0}\u542B\u307E\u308C\u308B\u30B9\u30EC\u30C3\u30C9\u304C{1}\u898B\u3064\u304B\u308A\u307E\u3057\u305F\u304C\u3001\u30DE\u30B7\u30F3\u306B\u306F\u30CF\u30FC\u30C9\u30A6\u30A7\u30A2\u30FB\u30B9\u30EC\u30C3\u30C9(\u30B3\u30A2)\u304C{2}\u3042\u308A\u307E\u3059\u3002\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306B\u30E1\u30EA\u30C3\u30C8\u304C\u3042\u308B\u306E\u306F\u3001\u3088\u308A\u9AD8\u3044\u4E26\u5217\u30EC\u30D9\u30EB\u3067\u3059\u3002\u3053\u306E\u539F\u56E0\u306F\u3001\u30B9\u30EC\u30C3\u30C9\u306B\u304A\u3051\u308BJava\u30B3\u30FC\u30C9\u306E\u5B9F\u884C\u4EE5\u5916\u306E\u52D5\u4F5C(\u30CD\u30A4\u30C6\u30A3\u30D6\u30FB\u30B3\u30FC\u30C9\u306E\u5B9F\u884C\u307E\u305F\u306FJVM\u5185\u90E8\u3067\u306E\u6642\u9593\u7D4C\u904E\u306A\u3069)\u3067\u3042\u308B\u53EF\u80FD\u6027\u3082\u3042\u308A\u307E\u3059\u3002
235 FileReadRule_CONFIG_WARNING_LIMIT=\u30D5\u30A1\u30A4\u30EB\u8AAD\u53D6\u308A\u671F\u9593\u8B66\u544A\u5236\u9650
236 FileReadRule_CONFIG_WARNING_LIMIT_LONG=\u8B66\u544A\u3092\u30C8\u30EA\u30AC\u30FC\u3059\u308B\u5FC5\u8981\u306E\u3042\u308B\u6700\u77ED\u30D5\u30A1\u30A4\u30EB\u8AAD\u53D6\u308A\u671F\u9593
237 FileReadRuleFactory_RULE_NAME=\u30D5\u30A1\u30A4\u30EB\u8AAD\u53D6\u308A\u30D4\u30FC\u30AF\u671F\u9593
238 # {0} is a time period
239 FileReadRuleFactory_TEXT_OK=\u3053\u306E\u8A18\u9332\u5185\u306B\u3001\u9577\u671F\u306E\u30D5\u30A1\u30A4\u30EB\u8AAD\u53D6\u308A\u4E00\u6642\u4F11\u6B62\u306F\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3067\u3057\u305F(\u6700\u9577\u306F{0}\u3067\u3057\u305F)\u3002
240 FileReadRuleFactory_TEXT_NO_EVENTS=\u3053\u306E\u8A18\u9332\u306B\u306F\u30D5\u30A1\u30A4\u30EB\u8AAD\u53D6\u308A\u30A4\u30D9\u30F3\u30C8\u306F\u3042\u308A\u307E\u305B\u3093\u3002
241 # {0} is a time period
242 FileReadRuleFactory_TEXT_WARN=\u3053\u306E\u8A18\u9332\u306B\u306F\u3001\u9577\u671F\u306E\u30D5\u30A1\u30A4\u30EB\u8AAD\u53D6\u308A\u4E00\u6642\u4F11\u6B62\u304C\u3042\u308A\u307E\u3059(\u6700\u9577\u306F{0}\u3067\u3059)\u3002
243 # {0} is a time period, {1} is a time stamp, {2} is a size in bytes
244 FileReadRuleFactory_TEXT_WARN_LONG=\u8A18\u9332\u3055\u308C\u305F\u6700\u9577\u306E\u30D5\u30A1\u30A4\u30EB\u8AAD\u53D6\u308A\u306F\u3001{2}\u306E\u8AAD\u53D6\u308A\u306B{1}\u304B\u3089{0}\u304B\u304B\u308A\u307E\u3057\u305F\u3002
245 FileWriteRule_CONFIG_WARNING_LIMIT=\u30D5\u30A1\u30A4\u30EB\u66F8\u8FBC\u307F\u671F\u9593\u8B66\u544A\u5236\u9650
246 FileWriteRule_CONFIG_WARNING_LIMIT_LONG=\u8B66\u544A\u3092\u30C8\u30EA\u30AC\u30FC\u3059\u308B\u5FC5\u8981\u306E\u3042\u308B\u6700\u77ED\u30D5\u30A1\u30A4\u30EB\u66F8\u8FBC\u307F\u671F\u9593
247 FileWriteRuleFactory_RULE_NAME=\u30D5\u30A1\u30A4\u30EB\u66F8\u8FBC\u307F\u30D4\u30FC\u30AF\u671F\u9593
248 # {0} is a time period
249 FileWriteRuleFactory_TEXT_OK=\u3053\u306E\u8A18\u9332\u5185\u306B\u3001\u9577\u671F\u306E\u30D5\u30A1\u30A4\u30EB\u66F8\u8FBC\u307F\u4E00\u6642\u4F11\u6B62\u306F\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3067\u3057\u305F(\u6700\u9577\u306F{0}\u3067\u3057\u305F)\u3002
250 FileWriteRuleFactory_TEXT_NO_EVENTS=\u3053\u306E\u8A18\u9332\u306B\u306F\u30D5\u30A1\u30A4\u30EB\u66F8\u8FBC\u307F\u30A4\u30D9\u30F3\u30C8\u306F\u3042\u308A\u307E\u305B\u3093\u3002
251 # {0} is a time period
252 FileWriteRuleFactory_TEXT_WARN=\u3053\u306E\u8A18\u9332\u306B\u306F\u3001\u9577\u671F\u306E\u30D5\u30A1\u30A4\u30EB\u66F8\u8FBC\u307F\u4E00\u6642\u4F11\u6B62\u304C\u3042\u308A\u307E\u3059(\u6700\u9577\u306F{0}\u3067\u3059)\u3002
253 # {0} is a time period, {1} is a time stamp, {2} is a size in bytes
254 FileWriteRuleFactory_TEXT_WARN_LONG=\u8A18\u9332\u3055\u308C\u305F\u6700\u9577\u306E\u30D5\u30A1\u30A4\u30EB\u66F8\u8FBC\u307F\u306F\u3001{2}\u306E\u66F8\u8FBC\u307F\u306B{1}\u307E\u3067{0}\u304B\u304B\u3063\u3066\u3044\u307E\u3059\u3002
255 FlightRecordingSupportRule_RULE_NAME=\u30D5\u30E9\u30A4\u30C8\u8A18\u9332\u30B5\u30DD\u30FC\u30C8
256 FlightRecordingSupportRule_TEXT_OK=\u3053\u306E\u8A18\u9332\u306B\u4F7F\u7528\u3055\u308C\u305FJVM\u30D0\u30FC\u30B8\u30E7\u30F3\u306B\u306F\u30D5\u30E9\u30A4\u30C8\u30FB\u30EC\u30B3\u30FC\u30C0\u306E\u30D5\u30EB\u30FB\u30B5\u30DD\u30FC\u30C8\u304C\u3042\u308A\u307E\u3059\u3002
257 FlightRecordingSupportRule_EA_TEXT_WARN_SHORT=\u8A18\u9332\u306F\u521D\u671F\u30A2\u30AF\u30BB\u30B9\u30FB\u30D3\u30EB\u30C9\u3067\u884C\u308F\u308C\u3066\u3044\u307E\u3059\u3002
258 FlightRecordingSupportRule_EA_TEXT_WARN_LONG=\u3053\u306E\u8A18\u9332\u306FJRE ({0})\u306E\u521D\u671F\u30A2\u30AF\u30BB\u30B9\u30FB\u30D3\u30EB\u30C9\u3067\u884C\u308F\u308C\u3066\u3044\u307E\u3059\u3002\u81EA\u52D5\u5206\u6790\u306F\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u306A\u3044\u305F\u3081\u3001\u8A18\u9332\u3092\u5206\u6790\u3057\u3088\u3046\u3068\u3059\u308B\u3068\u30A8\u30E9\u30FC\u304C\u767A\u751F\u3059\u308B\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002
259 FlightRecordingSupportRule_NO_JVM_VERSION_EVENTS_TEXT=JVM\u30D0\u30FC\u30B8\u30E7\u30F3\u60C5\u5831\u304C\u8A18\u9332\u3055\u308C\u305FVM\u60C5\u5831\u30A4\u30D9\u30F3\u30C8\u304C\u3042\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002\u3053\u306E\u30EB\u30FC\u30EB\u3092\u4F7F\u7528\u3059\u308B\u306B\u306F\u3001JVM\u60C5\u5831\u30A4\u30D9\u30F3\u30C8\u3092\u30AA\u30F3\u306B\u3057\u3066\u304F\u3060\u3055\u3044\u3002
260 FlightRecordingSupportRule_UNSUPPORTED_TEXT_WARN_SHORT=\u8A18\u9332\u306F\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u306A\u3044JRE\u30D0\u30FC\u30B8\u30E7\u30F3\u3067\u884C\u308F\u308C\u3066\u3044\u307E\u3059\u3002
261 FlightRecordingSupportRule_UNSUPPORTED_TEXT_WARN_LONG=\u3053\u306E\u8A18\u9332\u306F\u3001JDK Flight Recorder\u304CHotSpot\u3067\u5B8C\u5168\u306B\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u308B\u524D\u306EJRE\u30D0\u30FC\u30B8\u30E7\u30F3{0}\u306E\u30E9\u30F3\u30BF\u30A4\u30E0\u3067\u884C\u308F\u308C\u3066\u3044\u307E\u3059\u30027u40\u3088\u308A\u524D\u306E\u30D0\u30FC\u30B8\u30E7\u30F3\u3067\u306F\u30D5\u30E9\u30A4\u30C8\u8A18\u9332\u306B\u3064\u3044\u3066\u90E8\u5206\u7684\u30B5\u30DD\u30FC\u30C8\u3057\u304B\u3042\u308A\u307E\u305B\u3093\u3002\u81EA\u52D5\u5206\u6790\u306F\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u306A\u3044\u305F\u3081\u3001\u3053\u306E\u8A18\u9332\u3092\u5206\u6790\u3057\u3088\u3046\u3068\u3059\u308B\u3068\u30A8\u30E9\u30FC\u304C\u767A\u751F\u3059\u308B\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002
262 
263 FullGcRule_RULE_NAME=G1/CMS\u306E\u5B8C\u5168\u306A\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3
264 FullGcRule_OTHER_COLLECTOR_IN_USE=\u3053\u306E\u30EB\u30FC\u30EB\u306F\u3001CMS\u304A\u3088\u3073G1\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30BF\u306B\u5BFE\u3057\u3066\u306E\u307F\u6709\u52B9\u3067\u3059\u304C\u3001\u3053\u306EJVM\u3067\u306F\u3069\u3061\u3089\u3082\u691C\u51FA\u3055\u308C\u307E\u305B\u3093\u3067\u3057\u305F\u3002
265 FullGcRule_FULL_GC_OCCURRED_TITLE=\u30D5\u30EBGC\u304C\u691C\u51FA\u3055\u308C\u307E\u3057\u305F\u3002
266 FullGcRule_FULL_GC_OCCURRED_DESC=\u3053\u306E\u8A18\u9332\u4E2D\u306B\u3001\u5C11\u306A\u304F\u3068\u3082\u4E00\u5EA6\u3001Stop-The-World\u578B\u306E\u30D5\u30EB\u30FB\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u304C\u767A\u751F\u3057\u307E\u3057\u305F\u3002CMS\u304A\u3088\u3073G1\u30B3\u30EC\u30AF\u30BF\u3067\u306F\u3001\u30D5\u30EBGC\u30A4\u30D9\u30F3\u30C8\u306F\u3001\u5F37\u529B\u306A\u30DE\u30A4\u30CA\u30B9\u306E\u30D1\u30D5\u30A9\u30FC\u30DE\u30F3\u30B9\u30FB\u30A4\u30F3\u30C7\u30A3\u30B1\u30FC\u30BF\u3067\u3059\u3002\u30C1\u30E5\u30FC\u30CB\u30F3\u30B0\u53EF\u80FD\u306AGC\u30D1\u30E9\u30E1\u30FC\u30BF\u3092\u4F7F\u7528\u3059\u308B\u3068\u3001\u30B3\u30EC\u30AF\u30BF\u3092\u4E26\u884C\u30E2\u30FC\u30C9\u3067\u52D5\u4F5C\u3055\u305B\u308B\u3053\u3068\u304C\u3067\u304D\u3001Stop-The-World\u578B\u306E\u4E00\u6642\u4F11\u6B62\u3092\u56DE\u907F\u3057\u305F\u308A\u3001GC\u3084\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306E\u30D1\u30D5\u30A9\u30FC\u30DE\u30F3\u30B9\u3092\u5411\u4E0A\u3055\u305B\u305F\u308A\u3059\u308B\u3053\u3068\u304C\u53EF\u80FD\u306B\u306A\u308A\u307E\u3059\u3002
267 FullGcRule_NO_FULL_GC_OCCURRED=Stop-the-World\u578B\u306E\u30D5\u30EBGC\u30A4\u30D9\u30F3\u30C8\u306F\u691C\u51FA\u3055\u308C\u307E\u305B\u3093\u3067\u3057\u305F\u3002
268 
269 GcFreedRatioRule_RULE_NAME=GC\u89E3\u653E\u7387
270 GcFreedRatioRule_GC_FREED_RATIO_INFO_LIMIT=\u30E9\u30A4\u30D6\u30FB\u30BB\u30C3\u30C8\u30FB\u30B5\u30A4\u30BA\u60C5\u5831\u5236\u9650\u3068\u6BD4\u8F03\u3057\u305F\u30011\u79D2\u5F53\u305F\u308A\u306B\u89E3\u653E\u3055\u308C\u305F\u30E1\u30E2\u30EA\u30FC
271 GcFreedRatioRule_GC_FREED_RATIO_INFO_LIMIT_DESC=\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u306B\u3088\u308A1\u79D2\u5F53\u305F\u308A\u306B\u89E3\u653E\u3055\u308C\u305F\u30E1\u30E2\u30EA\u30FC\u306E\u91CF\u3068\u3001\u60C5\u5831\u901A\u77E5\u306E\u30C8\u30EA\u30AC\u30FC\u306B\u5FC5\u8981\u306A\u30E9\u30A4\u30D6\u30FB\u30BB\u30C3\u30C8\u3092\u6BD4\u8F03\u3057\u305F\u3068\u304D\u306E\u6BD4\u7387\u3002
272 GcFreedRatioRule_WINDOW_SIZE=\u6642\u9593\u30A6\u30A3\u30F3\u30C9\u30A6\u30FB\u30B5\u30A4\u30BA
273 GcFreedRatioRule_WINDOW_SIZE_DESC=\u30EB\u30FC\u30EB\u306E\u8A55\u4FA1\u6642\u306B\u4F7F\u7528\u3059\u308B\u6642\u9593\u30A6\u30A3\u30F3\u30C9\u30A6\u30FB\u30B5\u30A4\u30BA\u3002
274 GcFreedRatioRule_FEW_GCS_LIMIT=\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u5236\u9650\u304C\u5C11\u306A\u3059\u304E\u307E\u3059
275 GcFreedRatioRule_FEW_GCS_LIMIT_DESC=\u30EB\u30FC\u30EB\u306E\u8A08\u7B97\u306B\u95A2\u9023\u6027\u3092\u6301\u305F\u305B\u308B\u305F\u3081\u306E\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u306E\u6700\u5C0F\u6570\u3002
276 # {0} is a count, # {1} is a count
277 GcFreedRatioRule_RESULT_FEW_GCS=\u691C\u51FA\u3055\u308C\u305F\u30D2\u30FC\u30D7\u30FB\u30B5\u30DE\u30EA\u30FC\u30FB\u30A4\u30D9\u30F3\u30C8\u304C{0}\u4EF6\u306E\u307F\u3067\u3057\u305F\u3002\u95A2\u9023\u6027\u306E\u3042\u308B\u7D50\u679C\u3092\u8A08\u7B97\u3059\u308B\u305F\u3081\u306B\u3001\u3053\u306E\u30EB\u30FC\u30EB\u306B\u306F\u3001\u5C11\u306A\u304F\u3068\u3082{1}\u4EF6\u306E\u30A4\u30D9\u30F3\u30C8\u304C\u5FC5\u8981\u3067\u3059\u3002\u8A18\u9332\u4E2D\u306B\u3001\u308F\u305A\u304B\u306A\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u3057\u304B\u767A\u751F\u3057\u306A\u304B\u3063\u305F\u3088\u3046\u3067\u3059\u3002\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u304C\u5C11\u306A\u3044\u306E\u306F\u3001\u4E00\u822C\u7684\u306B\u3088\u3044\u5146\u5019\u3067\u3059\u3002
278 GcFreedRatioRule_RESULT_OK=\u3053\u308C\u306F\u9069\u5EA6\u306A\u91CF\u3067\u3059\u3002
279 GcFreedRatioRule_RESULT_NOT_OK=\u3053\u308C\u306F\u904E\u5270\u306A\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002
280 # {0} is a number
281 GcFreedRatioRule_RESULT_SHORT_DESCRIPTION=\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u306B\u3088\u308A1\u79D2\u5F53\u305F\u308A\u306B\u89E3\u653E\u3055\u308C\u305F\u30E1\u30E2\u30EA\u30FC\u3068\u30E9\u30A4\u30D6\u30FB\u30BB\u30C3\u30C8\u306E\u6BD4\u7387\u306F{0}\u3067\u3059\u3002
282 # {0} is a memory amount, {1} is a timespan, {2} is a timestamp, {3} is a number, {4} is a memory amount
283 GcFreedRatioRule_RESULT_LONG_DESCRIPTION={2}\u306B\u958B\u59CB\u3055\u308C\u305F{1}\u306E\u9593\u3001\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u306B\u3088\u308A1\u79D2\u5F53\u305F\u308A{0}\u304C\u89E3\u653E\u3055\u308C\u307E\u3057\u305F\u3002\u3053\u308C\u306F\u3001\u5E73\u5747\u30E9\u30A4\u30D6\u30FB\u30BB\u30C3\u30C8({4})\u306E{3}\u500D\u3067\u3059\u3002
284 GcFreedRatioRule_RESULT_MORE_INFO=\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30BF\u3067\u5927\u91CF\u306E\u30E1\u30E2\u30EA\u30FC\u3092\u89E3\u653E\u3067\u304D\u308B\u5834\u5408\u3001\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306B\u3088\u308A\u3001\u5B58\u7D9A\u6642\u9593\u306E\u77ED\u3044\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u304C\u591A\u6570\u5272\u308A\u5F53\u3066\u3089\u308C\u3066\u3044\u308B\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002\u5272\u5F53\u3066\u7387\u3092\u4E0B\u3052\u308B\u306B\u306F\u3001\u5272\u5F53\u3066\u306E\u30B9\u30BF\u30C3\u30AF\u30FB\u30C8\u30EC\u30FC\u30B9\u3092\u8ABF\u67FB\u3057\u3001\u5927\u90E8\u5206\u306E\u5272\u5F53\u3066\u306E\u539F\u56E0\u3068\u306A\u3063\u3066\u3044\u308B\u30B3\u30FC\u30C9\u30FB\u30D1\u30B9\u3092\u78BA\u8A8D\u3057\u3066\u304F\u3060\u3055\u3044\u3002
285 
286 GcPauseRatioRule_INFO_LIMIT=GC\u4E00\u6642\u4F11\u6B62\u7387\u60C5\u5831\u5236\u9650
287 GcPauseRatioRule_INFO_LIMIT_DESC=\u60C5\u5831\u901A\u77E5\u306E\u30C8\u30EA\u30AC\u30FC\u306B\u5FC5\u8981\u306A\u6642\u9593\u30A6\u30A3\u30F3\u30C9\u30A6\u306B\u304A\u3051\u308B\u3001GC\u4E00\u6642\u4F11\u6B62\u3068\u5B9F\u884C\u6642\u9593\u306E\u6BD4\u7387
288 GcPauseRatioRule_WARNING_LIMIT=GC\u4E00\u6642\u4F11\u6B62\u7387\u8B66\u544A\u5236\u9650
289 GcPauseRatioRule_WARNING_LIMIT_DESC=\u8B66\u544A\u306E\u30C8\u30EA\u30AC\u30FC\u306B\u5FC5\u8981\u306A\u6642\u9593\u30A6\u30A3\u30F3\u30C9\u30A6\u306B\u304A\u3051\u308B\u3001GC\u4E00\u6642\u4F11\u6B62\u3068\u5B9F\u884C\u6642\u9593\u306E\u6BD4\u7387
290 GcPauseRatioRule_WINDOW_SIZE=GC\u4E00\u6642\u4F11\u6B62\u6642\u9593\u30A6\u30A3\u30F3\u30C9\u30A6\u30FB\u30B5\u30A4\u30BA
291 GcPauseRatioRule_WINDOW_SIZE_DESC=\u30EB\u30FC\u30EB\u306E\u8A55\u4FA1\u6642\u306B\u4F7F\u7528\u3055\u308C\u308B\u6642\u9593\u30A6\u30A3\u30F3\u30C9\u30A6\u30FB\u30B5\u30A4\u30BA
292 GcPauseRatioRule_RULE_NAME=GC\u306E\u4F11\u6B62
293 GcPauseRatioRule_RULE_TEXT=GC\u4E00\u6642\u4F11\u6B62\u306B\u3088\u308A\u3001\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u52B9\u7387\u306B\u5F71\u97FF\u304C\u3042\u308A\u307E\u3057\u305F\u3002
294 # {0} is a percentage, {1} is a timespan, {2} is a timestamp, {3} is a percentage
295 GcPauseRatioRule_RULE_TEXT_LONG={2}\u306B\u958B\u59CB\u3055\u308C\u305F{1}\u306E\u9593\u3001\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u4E00\u6642\u4F11\u6B62\u3068\u5B9F\u884C\u6642\u9593\u306E\u6700\u3082\u9AD8\u3044\u6BD4\u7387\u306F{0}%\u3067\u3057\u305F\u3002\u8A18\u9332\u5168\u4F53\u306E\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u4E00\u6642\u4F11\u6B62\u7387\u306F\u3001{3}%\u3067\u3057\u305F\u3002
296 GcPauseRatioRule_RULE_TEXT_RECOMMENDATION=\u4E00\u6642\u4F11\u6B62\u56DE\u6570\u306F\u3001\u30D2\u30FC\u30D7\u30FB\u30B5\u30A4\u30BA\u306E\u5897\u52A0\u3084\u3001\u5272\u5F53\u3066\u524A\u6E1B\u306E\u8A66\u884C\u306B\u3088\u3063\u3066\u6E1B\u3089\u305B\u308B\u5834\u5408\u304C\u3042\u308A\u307E\u3059\u3002
297 GcPauseRatioRule_RULE_TEXT_OK=GC\u4E00\u6642\u4F11\u6B62\u306B\u3088\u308B\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u52B9\u7387\u3078\u306E\u5F71\u97FF\u306F\u5927\u304D\u304F\u3042\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002
298 
299 GcLockerRule_CONFIG_WARNING_LIMIT=GC\u30ED\u30C3\u30AB\u30FC\u7387\u5236\u9650
300 GcLockerRule_CONFIG_WARNING_LIMIT_LONG=GC\u30ED\u30C3\u30AB\u30FC\u304C\u539F\u56E0\u306E\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u306E\u6570\u3068\u5408\u8A08\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u9593\u306E\u8B66\u544A\u5236\u9650\u7387
301 GcLockerRule_TEXT_NA=GC\u60C5\u5831\u30A4\u30D9\u30F3\u30C8\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3002
302 GcLockerRuleFactory_RULE_NAME=GC\u30ED\u30C3\u30AB\u30FC\u306B\u3088\u3063\u3066\u5F15\u304D\u8D77\u3053\u3055\u308C\u305FGC
303 # {0} is a percentage
304 GcLockerRuleFactory_TEXT_INFO=GC\u30ED\u30C3\u30AB\u30FC\u306F\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u306E{0}\u3092\u5F15\u304D\u8D77\u3053\u3057\u307E\u3057\u305F\u3002
305 GcLockerRuleFactory_TEXT_INFO_LONG=GC\u30ED\u30C3\u30AB\u30FC\u306B\u3088\u3063\u3066\u5F15\u304D\u8D77\u3053\u3055\u308C\u305F\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u306F\u3001\u30E9\u30F3\u30BF\u30A4\u30E0\u3067\u5927\u91CF\u306EJNI\u30B3\u30FC\u30C9\u304C\u5B9F\u884C\u3055\u308C\u305F\u3053\u3068\u3092\u793A\u3057\u307E\u3059\u3002\u3053\u308C\u3092\u56DE\u907F\u3059\u308B\u306B\u306F\u3001JNI\u306E\u7D4C\u904E\u6642\u9593\u3092\u6E1B\u3089\u3057\u307E\u3059\u3002
306 GcLockerRuleFactory_TEXT_OK=GC\u30ED\u30C3\u30AB\u30FC\u306F\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u3092\u5F15\u304D\u8D77\u3053\u3057\u307E\u305B\u3093\u3067\u3057\u305F\u3002
307 GcStallRule_RULE_NAME=GC\u505C\u6B62
308 GcStallRule_TEXT_OK=\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30BF\u304C\u30EF\u30FC\u30AF\u30ED\u30FC\u30C9\u3092\u7DAD\u6301\u3067\u304D\u306A\u304B\u3063\u305F\u3068\u3044\u3046\u6307\u6A19\u306F\u691C\u51FA\u3055\u308C\u307E\u305B\u3093\u3067\u3057\u305F
309 General_CONFIG_CLASS_LIMIT=\u30AF\u30E9\u30B9\u5236\u9650
310 General_CONFIG_CLASS_LIMIT_LONG=\u30EC\u30DD\u30FC\u30C8\u3059\u308B\u8B66\u544A\u5236\u9650\u3092\u8D85\u3048\u3066\u3044\u308B\u30AF\u30E9\u30B9\u306E\u6700\u5927\u6570\u3002
311 General_NO_STACK_TRACE_AVAILABLE=&lt;p&gt;&amp;lt;\u4F7F\u7528\u53EF\u80FD\u306A\u30B9\u30BF\u30C3\u30AF\u30FB\u30C8\u30EC\u30FC\u30B9\u306F\u3042\u308A\u307E\u305B\u3093&amp;gt;&lt;/p&gt;
312 General_RULE_REQUIRES_EVENTS_FROM_ONE_OF_MANY=\u3053\u306E\u30EB\u30FC\u30EB\u3067\u306F\u3001\u6B21\u306E\u30A4\u30D9\u30F3\u30C8\u30FB\u30BF\u30A4\u30D7\u306E\u3044\u305A\u308C\u304B\u304B\u3089\u30A4\u30D9\u30F3\u30C8\u3092\u4F7F\u7528\u3067\u304D\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059: {0}\u3002
313 General_TEXT_COULD_NOT_DETERMINE_JAVA_VERSION=Java\u30D0\u30FC\u30B8\u30E7\u30F3\u3092\u7279\u5B9A\u3067\u304D\u307E\u305B\u3093\u3002
314 General_UNKNOWN_ADDRESS=&lt;\u4E0D\u660E\u306A\u30A2\u30C9\u30EC\u30B9&gt;
315 General_UNKNOWN_FILE_NAME=&lt;\u4E0D\u660E\u306A\u30D5\u30A1\u30A4\u30EB&gt;
316 HeapContentRule_AGGR_CLASS_SCORE=\u30AF\u30E9\u30B9\u30FB\u30B9\u30B3\u30A2
317 HeapContentRuleFactory_RULE_NAME=\u30D2\u30FC\u30D7\u306E\u5185\u5BB9
318 HeapContentRuleFactory_TEXT_INFO=\u307B\u3068\u3093\u3069\u306E\u30D2\u30FC\u30D7\u306F\u5C11\u6570\u306E\u30AF\u30E9\u30B9\u306B\u3088\u3063\u3066\u4F7F\u7528\u3055\u308C\u307E\u3057\u305F\u3002
319 HeapContentRuleFactory_TEXT_INFO_LONG=\u30D2\u30FC\u30D7\u4F7F\u7528\u91CF\u3092\u524A\u6E1B\u3059\u308B\u5FC5\u8981\u304C\u3042\u308B\u5834\u5408\u306F\u3001\u3053\u3053\u304B\u3089\u958B\u59CB\u3059\u308B\u3053\u3068\u3092\u304A\u85A6\u3081\u3057\u307E\u3059\u3002
320 HeapContentRuleFactory_TEXT_OK=\u30D2\u30FC\u30D7\u306E\u5185\u5BB9\u306B\u554F\u984C\u306F\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002
321 HeapInspectionGcRuleFactory_RULE_NAME=\u30D2\u30FC\u30D7\u691C\u67FB\u306B\u3088\u3063\u3066\u5F15\u304D\u8D77\u3053\u3055\u308C\u305FGC
322 # {0} is a number
323 HeapInspectionGcRuleFactory_TEXT_INFO=JVM\u306F{0}\u30D2\u30FC\u30D7\u691C\u67FB\u306E\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u3092\u5B9F\u884C\u3057\u307E\u3057\u305F\u3002
324 HeapInspectionGcRuleFactory_TEXT_INFO_LONG=\u30D2\u30FC\u30D7\u691C\u67FB\u306E\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u306E\u5B9F\u884C\u306F\u4E00\u822C\u7684\u306B\u9577\u6642\u9593\u3092\u8981\u3059\u308B\u305F\u3081\u3001\u554F\u984C\u3068\u306A\u308B\u5834\u5408\u304C\u3042\u308A\u307E\u3059\u3002
325 HeapInspectionGcRuleFactory_TEXT_INFO_LONG_JFR=\u3053\u308C\u3089\u306E\u691C\u67FB\u306E\u4E00\u90E8\u306F&#39;\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u6570&#39; JFR\u30A4\u30D9\u30F3\u30C8\u306B\u3088\u3063\u3066\u5F15\u304D\u8D77\u3053\u3055\u308C\u307E\u3057\u305F\u3002\u3053\u308C\u306F\u3001\u305D\u306E\u30A4\u30D9\u30F3\u30C8\u304C\u6709\u52B9\u306A\u3059\u3079\u3066\u306E\u8A18\u9332\u306E\u6700\u521D\u304A\u3088\u3073\u6700\u5F8C\u3067\u30D5\u30EB\u30FB\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u3092\u30C8\u30EA\u30AC\u30FC\u3057\u307E\u3059\u3002\u5FC5\u8981\u306A\u3068\u304D\u306E\u307F\u8A18\u9332\u304C\u4F5C\u6210\u3055\u308C\u308B\u5834\u5408\u3084\u3001\u3042\u307E\u308A\u983B\u7E41\u306B\u4F5C\u6210\u3055\u308C\u306A\u3044\u5834\u5408\u3001\u7D50\u679C\u3068\u3057\u3066\u751F\u3058\u308B\u4E00\u6642\u4F11\u6B62\u306F\u901A\u5E38\u306E\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u52D5\u4F5C\u306B\u542B\u307E\u308C\u306A\u3044\u305F\u3081\u3001\u3053\u308C\u3089\u306E\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u306F\u3001\u554F\u984C\u306B\u306A\u3089\u306A\u3044\u306E\u304C\u4E00\u822C\u7684\u3067\u3059\u3002\u81EA\u52D5\u30B9\u30AF\u30EA\u30D7\u30C8\u306A\u3069\u3067\u8A18\u9332\u304C\u983B\u7E41\u306B\u53CE\u96C6\u3055\u308C\u308B\u5834\u5408\u3001\u307E\u305F\u306F\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u304C\u4E00\u6642\u4F11\u6B62\u306E\u5F71\u97FF\u3092\u53D7\u3051\u308B\u5834\u5408\u306F\u3001\u554F\u984C\u306B\u306A\u308B\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002\u305D\u306E\u5834\u5408\u306F\u3001&#39;\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u6570&#39;\u30A4\u30D9\u30F3\u30C8\u306E\u7121\u52B9\u5316\u3092\u691C\u8A0E\u3057\u3066\u304F\u3060\u3055\u3044\u3002
326 HeapInspectionGcRuleFactory_TEXT_OK=JVM\u306F\u30D2\u30FC\u30D7\u691C\u67FB\u306EGC\u3092\u5B9F\u884C\u3057\u307E\u305B\u3093\u3067\u3057\u305F\u3002
327 HeapInspectionGcRuleFactory_TEXT_OK_LONG=JVM\u306F\u30D2\u30FC\u30D7\u691C\u67FB\u306EGC\u3092\u5B9F\u884C\u3057\u307E\u305B\u3093\u3067\u3057\u305F\u3002\u5B9F\u884C\u306F\u4E00\u822C\u7684\u306B\u9577\u6642\u9593\u3092\u8981\u3059\u308B\u305F\u3081\u3001\u3053\u308C\u306F\u9069\u5207\u3067\u3059\u3002
328 HeapInspectionRule_CONFIG_WARNING_LIMIT=\u30D2\u30FC\u30D7\u691C\u67FBGC\u5236\u9650
329 HeapInspectionRule_CONFIG_WARNING_LIMIT_LONG=\u30D2\u30FC\u30D7\u691C\u67FB\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u306E\u6570\u3068\u5408\u8A08\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u9593\u306E\u8B66\u544A\u5236\u9650\u7387
330 HighGcRuleFactory_RULE_NAME=GC\u30D7\u30EC\u30C3\u30B7\u30E3
331 # {0} is a time period, {1} is a time stamp, {2} is a percentage
332 HighGcRuleFactory_TEXT_INFO=JVM\u306F{1}\u3067\u958B\u59CB\u3059\u308B{0}\u306E\u9593\u306E\u6642\u9593\u306E{2}\u306B\u5BFE\u3057\u3066\u4E00\u6642\u4F11\u6B62\u3057\u307E\u3057\u305F\u3002
333 HighGcRuleFactory_TEXT_INFO_LONG=\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u306E\u5B9F\u884C\u306B\u8CBB\u3084\u3055\u308C\u308B\u6642\u9593\u306F\u3001\u30D2\u30FC\u30D7\u30FB\u30B5\u30A4\u30BA\u306E\u5897\u52A0\u3084\u3001\u5272\u5F53\u3066\u524A\u6E1B\u306E\u8A66\u884C\u306B\u3088\u3063\u3066\u524A\u6E1B\u3067\u304D\u308B\u5834\u5408\u304C\u3042\u308A\u307E\u3059\u3002
334 HighGcRuleFactory_TEXT_OK=\u30E9\u30F3\u30BF\u30A4\u30E0\u3067\u306F\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u306E\u5B9F\u884C\u306B\u591A\u304F\u306E\u6642\u9593\u306F\u8CBB\u3084\u3055\u308C\u307E\u305B\u3093\u3067\u3057\u305F\u3002
335 HighJvmCpuRule_AGGR_MAX_ENDTIME=\u6700\u5927\u7D42\u4E86\u6642\u9593
336 HighJvmCpuRule_AGGR_MIN_ENDTIME=\u6700\u5C0F\u7D42\u4E86\u6642\u9593
337 HighJvmCpuRule_CONFIG_CPU_INFO_LIMIT=JVM CPU\u4F7F\u7528\u7387\u60C5\u5831\u5236\u9650
338 HighJvmCpuRule_CONFIG_CPU_INFO_LIMIT_LONG=\u60C5\u5831\u901A\u77E5\u306E\u30C8\u30EA\u30AC\u30FC\u306B\u5FC5\u8981\u3068\u3055\u308C\u308B\u3001JVM\u306B\u3088\u3063\u3066\u4F7F\u7528\u3055\u308C\u308BCPU\u91CF
339 HighJvmCpuRule_CONFIG_MIN_CPU_LIMIT_LONG=\u8B66\u544A\u3092\u30C8\u30EA\u30AC\u30FC\u3059\u308B\u6700\u5C0FCPU\u8CA0\u8377\u671F\u9593
340 HighJvmCpuRule_CONFIG_MIN_CPULOAD=\u6700\u5C0FCPU\u8CA0\u8377\u671F\u9593
341 HighJvmCpuRule_CONFIG_SAMPLE_LIMIT=\u6B20\u843D\u30B5\u30F3\u30D7\u30EB\u5236\u9650
342 HighJvmCpuRule_CONFIG_SAMPLE_LIMIT_LONG=\u8B66\u544A\u3092\u30C8\u30EA\u30AC\u30FC\u3059\u308B\u6700\u5C0F\u6B20\u843D\u30B5\u30F3\u30D7\u30EB
343 HighJvmCpuRule_FEW_SAMPLES=\u3053\u306E\u8A18\u9332\u306B\u306F\u3001CPU\u8CA0\u8377\u304C\u9AD8\u3044\u5834\u5408\u3067\u3082\u30D7\u30ED\u30D5\u30A1\u30A4\u30EA\u30F3\u30B0\u30FB\u30B5\u30F3\u30D7\u30EB\u304C\u307B\u3068\u3093\u3069\u542B\u307E\u308C\u3066\u3044\u307E\u305B\u3093\u3002
344 HighJvmCpuRule_FEW_SAMPLES_LONG=\u3053\u306E\u3088\u3046\u306B\u30D7\u30ED\u30D5\u30A1\u30A4\u30EA\u30F3\u30B0\u30FB\u30C7\u30FC\u30BF\u306F\u95A2\u9023\u3057\u3066\u3044\u306A\u3044\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u304C\u5927\u91CF\u306EJNI\u30B3\u30FC\u30C9\u3092\u5B9F\u884C\u3057\u3066\u3044\u308B\u3001\u307E\u305F\u306FJVM\u304CGC\u3001\u30AF\u30E9\u30B9\u30FB\u30ED\u30FC\u30C7\u30A3\u30F3\u30B0\u3001JIT\u30B3\u30F3\u30D1\u30A4\u30EB\u306A\u3069\u306B\u9577\u6642\u9593\u3092\u8CBB\u3084\u3057\u3066\u3044\u308B\u3053\u3068\u304C\u539F\u56E0\u3067\u3042\u308B\u5834\u5408\u304C\u3042\u308A\u307E\u3059\u3002
345 HighJvmCpuRule_LONG_CPU_LOAD_PERIOD=\u3053\u306E\u8A18\u9332\u306B\u306F\u3001&#39;CPU\u8CA0\u8377&#39;\u30A4\u30D9\u30F3\u30C8\u306B\u5BFE\u3059\u308B\u9AD8\u3044\u30B5\u30F3\u30D7\u30EA\u30F3\u30B0\u671F\u9593\u304C\u3042\u308A\u307E\u3059\u3002
346 # {0} is a time period
347 HighJvmCpuRule_LONG_CPU_LOAD_PERIOD_LONG=&#39;&#39;CPU\u8CA0\u8377&#39;&#39;\u30A4\u30D9\u30F3\u30C8\u306E\u30B5\u30F3\u30D7\u30EA\u30F3\u30B0\u671F\u9593\u304C{0}\u306B\u8A2D\u5B9A\u3055\u308C\u307E\u3057\u305F\u304C\u3001\u3053\u308C\u306F\u9AD8\u3059\u304E\u3066CPU\u8CA0\u8377\u95A2\u9023\u306E\u30EB\u30FC\u30EB\u304C\u6A5F\u80FD\u3057\u307E\u305B\u3093\u3002
348 HighJvmCpuRule_RULE_NAME=\u9AD8\u3044JVM CPU\u8CA0\u8377
349 HighJvmCpuRule_TEXT_OK=JVM\u304C\u3001CPU\u8CA0\u8377\u3092\u9AD8\u304F\u3059\u308B\u3053\u3068\u306F\u306A\u3044\u3088\u3046\u3067\u3059\u3002
350 HighJvmCpuRule_TEXT_WARN=JVM\u306F\u5927\u91CF\u306ECPU\u3092\u30ED\u30FC\u30C9\u3057\u307E\u3059\u3002
351 HotMethodsRuleFactory_NOT_ENOUGH_SAMPLES=\u30B9\u30B3\u30A2\u3092\u8A08\u7B97\u3059\u308B\u306E\u306B\u5341\u5206\u306A\u5B9F\u884C\u30B5\u30F3\u30D7\u30EB\u3092\u62BD\u51FA\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306E\u8CA0\u8377\u3092\u5897\u3084\u3059\u304B\u3001\u30B5\u30F3\u30D7\u30EB\u671F\u9593\u3092\u77ED\u304F\u3059\u308B\u304B\u3001\u8A18\u9332\u6642\u9593\u3092\u9577\u304F\u3059\u308B\u3053\u3068\u3067\u3001\u3088\u308A\u591A\u304F\u306E\u30B5\u30F3\u30D7\u30EB\u306E\u751F\u6210\u3092\u8A66\u884C\u3057\u3066\u304F\u3060\u3055\u3044\u3002
352 # {0} is a method name, {1} is a percentage, {2} is a duration of time
353 HotMethodsRuleFactory_TEXT_INFO=\u8A18\u9332\u306E{2}\u30A6\u30A3\u30F3\u30C9\u30A6\u306E\u9593\u3001\u6700\u3082\u30B5\u30F3\u30D7\u30EA\u30F3\u30B0\u3055\u308C\u305F\u30E1\u30BD\u30C3\u30C9\u306F{0}\u3067\u3001\u60F3\u5B9A\u3055\u308C\u308B\u30B5\u30F3\u30D7\u30EB\u306E{1}\u3067\u3057\u305F\u3002
354 # {0} is a list of method names with a percentage and a timespan, {1} is the hottest stack trace
355 HotMethodsRuleFactory_TEXT_INFO_LONG=\u6B21\u306E\u30E1\u30BD\u30C3\u30C9\u306F\u3001\u30B3\u30FC\u30C9\u6700\u9069\u5316\u306B\u6700\u3082\u95A2\u9023\u3059\u308B\u5019\u88DC\u3067\u3059: {0}&lt;p&gt;\u3053\u308C\u3089\u306E\u30E1\u30BD\u30C3\u30C9\u306F\u3001\u8A18\u9332\u306E\u7279\u5B9A\u306E\u30A6\u30A3\u30F3\u30C9\u30A6\u306B\u304A\u3044\u3066\u3001\u6700\u3082\u30B5\u30F3\u30D7\u30EA\u30F3\u30B0\u3055\u308C\u305F\u30E1\u30BD\u30C3\u30C9\u3067\u3059\u3002\u5404\u30E1\u30BD\u30C3\u30C9\u306B\u8868\u793A\u3055\u308C\u3066\u3044\u308B\u30D1\u30FC\u30BB\u30F3\u30C6\u30FC\u30B8\u306F\u3001\u305D\u306E\u30A6\u30A3\u30F3\u30C9\u30A6\u3067\u60F3\u5B9A\u3055\u308C\u308B\u6700\u5927\u30B5\u30F3\u30D7\u30EB\u6570\u3068\u6BD4\u8F03\u3057\u3066\u3001\u5B9F\u884C\u30B5\u30F3\u30D7\u30EB\u304C\u3044\u304F\u3064\u767A\u751F\u3057\u305F\u304B\u3092\u8868\u3057\u3066\u3044\u307E\u3059\u3002&lt;p&gt;\u6700\u3082\u983B\u7E41\u306A\u30B9\u30BF\u30C3\u30AF\u30FB\u30C8\u30EC\u30FC\u30B9\u3092\u6B21\u306B\u793A\u3057\u307E\u3059: {1}
356 HotMethodsRuleFactory_TEXT_OK=\u6700\u9069\u5316\u3067\u7279\u306B\u52B9\u679C\u304C\u73FE\u308C\u308B\u30E1\u30BD\u30C3\u30C9\u306F\u691C\u51FA\u3055\u308C\u307E\u305B\u3093\u3067\u3057\u305F\u3002
357 IgnoreUnrecognizedVMOptionsRuleFactory_TEXT_INFO=JVM\u306F\u8A8D\u8B58\u3055\u308C\u306A\u3044VM\u30AA\u30D7\u30B7\u30E7\u30F3\u3092\u7121\u8996\u3057\u307E\u3057\u305F\u3002
358 IgnoreUnrecognizedVMOptionsRuleFactory_TEXT_INFO_LONG=\u8A8D\u8B58\u3055\u308C\u306A\u3044VM\u30AA\u30D7\u30B7\u30E7\u30F3\u3092\u7121\u8996\u3057\u305FJVM\u3067\u8A18\u9332\u304C\u5B9F\u884C\u3055\u308C\u307E\u3057\u305F\u3002\u3053\u308C\u306F\u3001\u7121\u52B9\u306AVM\u30D5\u30E9\u30B0\u306E\u5B58\u5728\u306E\u78BA\u8A8D\u304C\u884C\u308F\u308C\u306A\u304B\u3063\u305F\u3053\u3068\u3092\u610F\u5473\u3057\u307E\u3059\u3002\u3064\u307E\u308A\u3001\u69CB\u6210\u3055\u308C\u3066\u3044\u308B\u3068\u601D\u3063\u3066\u3044\u3066\u3082\u69CB\u6210\u3055\u308C\u3066\u3044\u306A\u3044VM\u52D5\u4F5C\u304C\u5B58\u5728\u3059\u308B\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002\u3053\u308C\u306F\u3001\u5B9F\u884C\u4E2D\u306EVM\u3067\u305D\u308C\u304C\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u3066\u3044\u306A\u3044\u3053\u3068\u3001\u307E\u305F\u306F\u30AA\u30D7\u30B7\u30E7\u30F3\u306E\u30B9\u30DA\u30EB\u304C\u9593\u9055\u3063\u3066\u3044\u308B\u3053\u3068\u304C\u539F\u56E0\u3068\u8003\u3048\u3089\u308C\u307E\u3059\u3002\u5FC5\u8981\u306A\u5834\u5408\u3092\u9664\u304D\u3001&#39;-XX:+IgnoreUnrecognizedVMOptions&#39;\u30B3\u30DE\u30F3\u30C9\u884C\u30AA\u30D7\u30B7\u30E7\u30F3\u306F\u4F7F\u7528\u3057\u306A\u3044\u3067\u304F\u3060\u3055\u3044\u3002
359 # {0} is an object type with a field name, {1} is a number, {2} is another object type with a field name
360 IncreasingLiveSetRule_LOADED_CLASSES_PERCENT=\u30ED\u30FC\u30C9\u3055\u308C\u305F\u30AF\u30E9\u30B9
361 IncreasingLiveSetRule_LOADED_CLASSES_PERCENT_DESC=\u30ED\u30FC\u30C9\u3055\u308C\u305F\u30AF\u30E9\u30B9\u306E\u30D1\u30FC\u30BB\u30F3\u30C6\u30FC\u30B8\u3002\u30A6\u30A9\u30FC\u30E0\u30A2\u30C3\u30D7\u30FB\u30D5\u30A7\u30FC\u30BA\u304C\u5B8C\u4E86\u3057\u305F\u3053\u3068\u3092\u793A\u3057\u307E\u3059\u3002\u30EB\u30FC\u30EB\u3067\u306F\u3001\u3053\u306E\u91CF\u306E\u30AF\u30E9\u30B9\u304C\u30ED\u30FC\u30C9\u3055\u308C\u308B\u524D\u306B\u884C\u308F\u308C\u305F\u5272\u5F53\u3066\u306F\u7121\u8996\u3055\u308C\u307E\u3059\u3002
362 IncreasingLiveSetRule_TEXT_INFO_BALANCED=\u305D\u306E\u4ED6\u306E\u30AF\u30E9\u30B9\u3088\u308A\u30EA\u30FC\u30AF\u304C\u767A\u751F\u3057\u3066\u3044\u308B\u3068\u601D\u308F\u308C\u308B\u7279\u5B9A\u306E\u30AF\u30E9\u30B9\u306F\u3042\u308A\u307E\u305B\u3093\u3002
363 IncreasingLiveSetRule_TEXT_INFO_LONG=&#39;GC\u30EB\u30FC\u30C8\u3078\u306E\u30C8\u30EC\u30FC\u30B9\u30FB\u30D1\u30B9&#39;\u30AA\u30D7\u30B7\u30E7\u30F3\u3092\u6709\u52B9\u5316\u3057\u3066\u30C0\u30F3\u30D7\u3092\u5B9F\u884C\u3059\u308B\u3068\u3001\u30E1\u30E2\u30EA\u30FC\u30FB\u30EA\u30FC\u30AF\u306E\u53EF\u80FD\u6027\u3092\u3088\u308A\u8A73\u7D30\u306B\u5206\u6790\u3067\u304D\u307E\u3059\u3002
364 # {0} is a timestamp
365 IncreasingLiveSetRule_TEXT_INFO_NO_CANDIDATES=\u30EA\u30FC\u30AF\u5019\u88DC\u306F\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002\u60F3\u5B9A\u3055\u308C\u308B\u3059\u3079\u3066\u306E\u5019\u88DC\u304C\u3001\u69CB\u6210\u3055\u308C\u305F\u3057\u304D\u3044\u5024\u3092\u4E0B\u56DE\u3063\u3066\u3044\u308B\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002\u307E\u305F\u3001\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306B\u3088\u308A\u5B58\u7D9A\u671F\u9593\u306E\u9577\u3044\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u304C\u5927\u91CF\u306B\u5272\u308A\u5F53\u3066\u3089\u308C\u308B\u3053\u3068\u306F\u3053\u308C\u4EE5\u964D\u306A\u3044\u3068\u30EB\u30FC\u30EB\u304C\u60F3\u5B9A\u3057\u305F{0}\u3088\u308A\u5F8C\u306B\u3001\u5B58\u7D9A\u6642\u9593\u306E\u9577\u3044\u5272\u5F53\u3066\u304C\u767A\u751F\u3057\u305F\u3053\u3068\u306B\u3088\u308B\u507D\u967D\u6027\u306E\u53EF\u80FD\u6027\u3082\u3042\u308A\u307E\u3059\u3002
366 IncreasingLiveSetRule_TEXT_INFO_UNBALANCED=\u305D\u306E\u4ED6\u306E\u30AF\u30E9\u30B9\u3088\u308A\u30EA\u30FC\u30AF\u304C\u767A\u751F\u3057\u3066\u3044\u308B\u3068\u601D\u308F\u308C\u308B\u30AF\u30E9\u30B9\u304C\u8907\u6570\u3042\u308A\u307E\u3059\u3002
367 IncreasingLiveSetRule_TEXT_OK=\u30E1\u30E2\u30EA\u30FC\u30FB\u30EA\u30FC\u30AF\u306F\u691C\u51FA\u3055\u308C\u307E\u305B\u3093\u3067\u3057\u305F\u3002
368 IncreasingLiveSetRule_RELEVANCE_THRESHOLD=\u30EA\u30FC\u30AF\u5019\u88DC\u95A2\u9023\u6027\u3057\u304D\u3044\u5024
369 IncreasingLiveSetRule_RELEVANCE_THRESHOLD_DESC=\u30E9\u30A4\u30D6\u30FB\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u3092\u30E1\u30E2\u30EA\u30FC\u30FB\u30EA\u30FC\u30AF\u3068\u307F\u306A\u3059\u304B\u3069\u3046\u304B\u306E\u5224\u65AD\u306B\u4F7F\u7528\u3059\u308B\u8A08\u7B97\u6E08\u306E\u95A2\u9023\u6027\u3057\u304D\u3044\u5024\u3002
370 IncreasingLiveSetRule_CANDIDATE_REFERRED_BY=\u5019\u88DC\u306F\u3053\u306E\u9023\u9396\u306B\u3088\u3063\u3066\u53C2\u7167\u3055\u308C\u3066\u3044\u307E\u3059\u3002
371 IncreasingLiveSetRule_ELLIPSIS=...
372 # {0} is a number
373 IncreasingLiveSetRule_LEAK_CANDIDATES=\u53C2\u7167\u30C4\u30EA\u30FC\u306E\u5206\u6790\u3067\u3001{0}\u306E\u30EA\u30FC\u30AF\u5019\u88DC\u304C\u691C\u51FA\u3055\u308C\u307E\u3057\u305F\u3002
374 IncreasingLiveSetRuleFactory_RULE_NAME=\u30D2\u30FC\u30D7\u306E\u30E9\u30A4\u30D6\u30FB\u30BB\u30C3\u30C8\u50BE\u5411
375 # {0} is a number denoted in Mebibytes per second
376 IncreasingLiveSetRuleFactory_TEXT_INFO=\u30D2\u30FC\u30D7\u306E\u30E9\u30A4\u30D6\u30FB\u30BB\u30C3\u30C8\u304C\u3001\u8A18\u9332\u4E2D\u306B1\u79D2\u5F53\u305F\u308A\u7D04{0}\u306E\u30B9\u30D4\u30FC\u30C9\u3067\u5897\u52A0\u3057\u3066\u3044\u307E\u3059\u3002
377 IncreasingLiveSetRuleFactory_TEXT_INFO_LONG=\u3053\u308C\u306F\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306E\u30E1\u30E2\u30EA\u30FC\u30FB\u30EA\u30FC\u30AF\u306B\u3088\u308B\u3082\u306E\u304B\u3001JVM\u304C\u6700\u8FD1\u8D77\u52D5\u3055\u308C\u305F\u5834\u5408\u306F\u3001\u77ED\u671F\u306E\u8A18\u9332\u306E\u30A2\u30FC\u30C6\u30A3\u30D5\u30A1\u30AF\u30C8\u3067\u3042\u308B\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002\u8A18\u9332\u306F\u3001JVM\u306E\u8D77\u52D5\u5F8C\u3001{0}\u306B\u958B\u59CB\u3055\u308C\u3066\u3044\u307E\u3059\u3002\u53EF\u80FD\u306A\u5834\u5408\u306F\u3001&#39;&#39;\u53E4\u3044\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u30FB\u30B5\u30F3\u30D7\u30EB&#39;&#39;\u30A4\u30D9\u30F3\u30C8\u3092\u4F7F\u7528\u3059\u308B\u3068\u3001\u60C5\u5831\u3092\u3055\u3089\u306B\u53CE\u96C6\u3067\u304D\u307E\u3059\u3002
378 IncreasingMetaspaceLiveSetRuleFactory_RULE_NAME=\u30E1\u30BF\u30B9\u30DA\u30FC\u30B9\u306E\u30E9\u30A4\u30D6\u30FB\u30BB\u30C3\u30C8\u50BE\u5411
379 IncreasingMetaspaceLiveSetRuleFactory_TEXT_INFO=\u30AF\u30E9\u30B9\u30FB\u30C7\u30FC\u30BF\u306F\u8A18\u9332\u4E2D\u306B\u30E1\u30BF\u30B9\u30DA\u30FC\u30B9\u5185\u3067\u7D99\u7D9A\u7684\u306B\u5897\u52A0\u3057\u3066\u3044\u308B\u3088\u3046\u306B\u898B\u3048\u307E\u3059\u3002
380 IncreasingMetaspaceLiveSetRuleFactory_TEXT_INFO_LONG=\u3053\u306E\u52D5\u4F5C\u306F\u30E1\u30BF\u30B9\u30DA\u30FC\u30B9\u306E\u30E1\u30E2\u30EA\u30FC\u30FB\u30EA\u30FC\u30AF\u3092\u793A\u3059\u5834\u5408\u304C\u3042\u308A\u3001\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u3067\u5FC5\u8981\u306B\u5FDC\u3058\u3066\u30AF\u30E9\u30B9\u3092\u30A2\u30F3\u30ED\u30FC\u30C9\u3057\u3066\u3044\u306A\u3044\u3053\u3068\u304C\u539F\u56E0\u3068\u306A\u308A\u5F97\u307E\u3059\u3002
381 IncreasingMetaspaceLiveSetRuleFactory_TEXT_OK=\u30AF\u30E9\u30B9\u30FB\u30C7\u30FC\u30BF\u306F\u8A18\u9332\u4E2D\u306B\u5897\u52A0\u3057\u3066\u3044\u308B\u3088\u3046\u306B\u898B\u3048\u307E\u305B\u3093\u3002
382 JavaBlocking_RULE_NAME=Java\u30D6\u30ED\u30C3\u30AD\u30F3\u30B0
383 JavaBlockingRule_AGGR_BALANCE_BY_INSTANCE=\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u3054\u3068
384 JavaBlockingRule_AGGR_BALANCE_BY_THREAD=\u30B9\u30EC\u30C3\u30C9\u5225
385 JavaBlockingRule_CONFIG_EXCLUDED_THREADS=Java\u304C\u9664\u5916\u3055\u308C\u305F\u30B9\u30EC\u30C3\u30C9\u540D\u3092\u30D6\u30ED\u30C3\u30AF\u3057\u307E\u3057\u305F
386 JavaBlockingRule_CONFIG_EXCLUDED_THREADS_LONG=\u9664\u5916\u3059\u308B\u30B9\u30EC\u30C3\u30C9\u540D\u3092\u8AAC\u660E\u3059\u308B\u6B63\u898F\u8868\u73FE\u3002\u4F8B: &#39;(.*weblogic\\.socket\\.Muxer.*|MyExcludedThreadName)&#39;
387 # {0} is a regexp exclude string
388 JavaBlockingRule_TEXT_EXCLUDED_THREADS=\u6B21\u306E\u6B63\u898F\u8868\u73FE\u306F\u3001\u3053\u306E\u30EB\u30FC\u30EB\u304B\u3089\u30B9\u30EC\u30C3\u30C9\u3092\u9664\u5916\u3059\u308B\u305F\u3081\u306B\u4F7F\u7528\u3055\u308C\u307E\u3057\u305F: &#39;&#39;{0}&#39;&#39;
389 # {0} is a time period
390 JavaBlockingRule_TEXT_INFO=\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u5185\u306E\u30B9\u30EC\u30C3\u30C9\u306F\u3001{0}\u306E\u5408\u8A08\u6642\u9593\u306B\u308F\u305F\u308A\u30ED\u30C3\u30AF\u3067\u30D6\u30ED\u30C3\u30AF\u3055\u308C\u307E\u3057\u305F\u3002
391 JavaBlockingRule_TEXT_MESSAGE=\u30ED\u30C3\u30AF\u7AF6\u5408\u306B\u3088\u308B\u904E\u5270\u306A\u554F\u984C\u306F\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002
392 # {0} is a class name, {1} is a number
393 JavaBlockingRule_TEXT_MOST_BLOCKED_CLASS=\u6700\u3082\u983B\u7E41\u306A\u30E2\u30CB\u30BF\u30FC\u30FB\u30AF\u30E9\u30B9\u306F&#39;&#39;{0}&#39;&#39;\u3067\u3001{1}\u56DE\u30D6\u30ED\u30C3\u30AF\u3055\u308C\u307E\u3057\u305F\u3002
394 # {0} is a thread name, {1} is a number
395 JavaBlockingRule_TEXT_MOST_BLOCKED_THREAD=\u6700\u3082\u983B\u7E41\u306A\u30B9\u30EC\u30C3\u30C9\u306F&#39;&#39;{0}&#39;&#39;\u3067\u3001{1}\u56DE\u30D6\u30ED\u30C3\u30AF\u3055\u308C\u307E\u3057\u305F\u3002
396 JavaBlockingRule_TEXT_OK=\u30ED\u30C3\u30AF\u7AF6\u5408\u306B\u3088\u308B\u554F\u984C\u306F\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002
397 LongGcPauseRuleFactory_RULE_NAME=GC\u4E00\u6642\u4F11\u6B62\u30D4\u30FC\u30AF\u671F\u9593
398 # {0} is a time period
399 LongGcPauseRuleFactory_TEXT_INFO=\u6700\u9577\u306EGC\u4E00\u6642\u4F11\u6B62\u306F{0}\u3067\u3057\u305F\u3002
400 LongGcPauseRuleFactory_TEXT_INFO_G1=\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30BF\u4E00\u6642\u4F11\u6B62\u3092\u6E1B\u3089\u3059\u305F\u3081\u306B\u69CB\u7BC9\u3055\u308C\u305FG1\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30BF\u3092\u4F7F\u7528\u3067\u304D\u307E\u3059\u3002G1\u3092\u6709\u52B9\u5316\u3059\u308B\u306B\u306F\u3001\u30B3\u30DE\u30F3\u30C9\u884C\u306B&#39;-XX:+UseG1GC&#39;\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
401 # {0} is a size in bytes, {1} is a size in bytes
402 LongGcPauseRuleFactory_TEXT_INFO_MX=\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306F\u3001\u30E9\u30A4\u30D6\u30FB\u30BB\u30C3\u30C8{0}\u3001\u30D2\u30FC\u30D7\u30FB\u30B5\u30A4\u30BA{1}\u3067\u5B9F\u884C\u3055\u308C\u307E\u3057\u305F\u3002\u30D2\u30FC\u30D7\u30FB\u30B5\u30A4\u30BA\u3092\u5C0F\u3055\u304F\u3059\u308B\u3068\u3001\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u306E\u4E00\u6642\u4F11\u6B62\u6642\u9593\u304C\u77ED\u304F\u306A\u308A\u307E\u3059\u3002
403 LongGcPauseRuleFactory_TEXT_INFO_REFERENCES=\u53C2\u7167\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306E\u51E6\u7406\u304C\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30BF\u4E00\u6642\u4F11\u6B62\u306E\u304B\u306A\u308A\u306E\u90E8\u5206\u3092\u5360\u3081\u3066\u3044\u307E\u3059\u3002\u53C2\u7167\u91CF\u3092\u524A\u6E1B\u3059\u308B\u304B\u3001&#39;-XX:+ParallelRefProcEnabled&#39;\u3092\u4F7F\u7528\u3057\u3066\u4E26\u5217\u53C2\u7167\u51E6\u7406\u3092\u6709\u52B9\u5316\u3059\u308B\u3053\u3068\u3067\u3001\u3053\u308C\u3092\u6E1B\u5C11\u3055\u305B\u3089\u308C\u308B\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002
404 LongGcPauseRuleFactory_TEXT_OK=\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306F\u9577\u671F\u306EGC\u4E00\u6642\u4F11\u6B62\u6642\u9593\u306E\u539F\u56E0\u306B\u306A\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002
405 LongGcPauseRule_CONFIG_INFO_LIMIT=GC\u4E00\u6642\u4F11\u6B62\u8B66\u544A\u5236\u9650
406 LongGcPauseRule_CONFIG_INFO_LIMIT_LONG=\u8B66\u544A\u306E\u30C8\u30EA\u30AC\u30FC\u306B\u5FC5\u8981\u3068\u3055\u308C\u308BGC\u4E00\u6642\u4F11\u6B62\u6642\u9593
407 LowOnPhysicalMemoryFactory_RULE_NAME=\u7A7A\u304D\u7269\u7406\u30E1\u30E2\u30EA\u30FC
408 # {0} is a percentage
409 LowOnPhysicalMemoryFactory_TEXT_INFO=\u4F7F\u7528\u3055\u308C\u305F\u30E1\u30E2\u30EA\u30FC\u306E\u6700\u5927\u91CF\u306F\u3001\u4F7F\u7528\u53EF\u80FD\u306A\u7269\u7406\u30E1\u30E2\u30EA\u30FC\u306E{0}\u3067\u3057\u305F\u3002
410 # {0} is a size in bytes, {1} is a percentage, {2} is a size in bytes
411 LowOnPhysicalMemoryFactory_TEXT_INFO_LONG=\u4F7F\u7528\u3055\u308C\u305F\u30E1\u30E2\u30EA\u30FC\u306E\u6700\u5927\u91CF\u306F{0}\u3067\u3057\u305F\u3002\u3053\u308C\u306F\u3001\u4F7F\u7528\u53EF\u80FD\u306A\u7269\u7406\u30E1\u30E2\u30EA\u30FC{2}\u306E{1}\u3067\u3057\u305F\u3002\u7A7A\u304D\u30E1\u30E2\u30EA\u30FC\u304C\u307B\u3068\u3093\u3069\u306A\u3044\u3068\u30B9\u30EF\u30C3\u30D4\u30F3\u30B0\u304C\u751F\u3058\u308B\u53EF\u80FD\u6027\u304C\u3042\u308A\u3001\u3053\u308C\u306F\u5927\u304D\u306A\u8CA0\u62C5\u3068\u306A\u308A\u307E\u3059\u3002\u3053\u308C\u3092\u56DE\u907F\u3059\u308B\u306B\u306F\u3001\u30E1\u30E2\u30EA\u30FC\u4F7F\u7528\u91CF\u3092\u6E1B\u5C11\u3055\u305B\u308B\u304B\u3001\u4F7F\u7528\u53EF\u80FD\u306A\u30E1\u30E2\u30EA\u30FC\u91CF\u3092\u5897\u52A0\u3055\u305B\u3066\u304F\u3060\u3055\u3044\u3002
412 LowOnPhysicalMemoryFactory_TEXT_OK=\u30B7\u30B9\u30C6\u30E0\u306F\u3053\u306E\u8A18\u9332\u4E2D\u306B\u4F4E\u3044\u7269\u7406\u30E1\u30E2\u30EA\u30FC\u3067\u5B9F\u884C\u3057\u307E\u305B\u3093\u3067\u3057\u305F\u3002
413 ManagementAgentRule_TEXT_INFO=\u7BA1\u7406\u30A8\u30FC\u30B8\u30A7\u30F3\u30C8\u8A2D\u5B9A(\u30DD\u30FC\u30C8\u3001\u8A8D\u8A3C\u3001SSL)\u304C\u5B9F\u884C\u6642\u306B\u5909\u66F4\u3055\u308C\u307E\u3057\u305F
414 ManagementAgentRule_TEXT_INFO_LONG=\u7BA1\u7406\u30A8\u30FC\u30B8\u30A7\u30F3\u30C8\u8A2D\u5B9A(\u30DD\u30FC\u30C8\u3001\u8A8D\u8A3C\u3001SSL)\u304C\u5B9F\u884C\u6642\u306B\u5909\u66F4\u3055\u308C\u307E\u3057\u305F\u3002\u3053\u308C\u304C\u5F71\u97FF\u3057\u305F\u53EF\u80FD\u6027\u306F\u9AD8\u304F\u3042\u308A\u307E\u305B\u3093\u304C\u3001\u8ABF\u67FB\u306B\u5F79\u7ACB\u3064\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002
415 ManagmentAgentRuleFactory_RULE_NAME=\u975E\u63A8\u5968\u306E\u7BA1\u7406\u30A8\u30FC\u30B8\u30A7\u30F3\u30C8\u8A2D\u5B9A
416 ManagmentAgentRuleFactory_TEXT_INFO_SSL_DISABLED=\u5B89\u5168\u3067\u306F\u306A\u3044\u7BA1\u7406\u30A8\u30FC\u30B8\u30A7\u30F3\u30C8\u8A2D\u5B9A: SSL\u7121\u52B9\u3002
417 ManagmentAgentRuleFactory_TEXT_INFO_SSL_DISABLED_LONG=\u30E9\u30F3\u30BF\u30A4\u30E0\u7BA1\u7406\u30A8\u30FC\u30B8\u30A7\u30F3\u30C8\u8A2D\u5B9A\u304C\u5B89\u5168\u3067\u306F\u3042\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002SSL/TLS\u304C\u7121\u52B9\u3067\u3057\u305F\u3002\u30C8\u30E9\u30D5\u30A3\u30C3\u30AF\u304C\u5B89\u5168\u3067\u306F\u306A\u304F\u306A\u308B\u305F\u3081\u3001\u3053\u308C\u306F\u672C\u756A\u30B7\u30B9\u30C6\u30E0\u3067\u63A8\u5968\u3055\u308C\u307E\u305B\u3093\u3002
418 ManagmentAgentRuleFactory_TEXT_OK=\u7BA1\u7406\u30A8\u30FC\u30B8\u30A7\u30F3\u30C8\u8A2D\u5B9A\u306B\u554F\u984C\u306F\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002
419 ManagmentAgentRuleFactory_TEXT_WARN_AUTH_DISABLED=\u5B89\u5168\u3067\u306F\u306A\u3044\u7BA1\u7406\u30A8\u30FC\u30B8\u30A7\u30F3\u30C8\u8A2D\u5B9A: \u30D1\u30B9\u30EF\u30FC\u30C9\u8A8D\u8A3C\u7121\u52B9\u3002
420 ManagmentAgentRuleFactory_TEXT_WARN_AUTH_DISABLED_LONG=\u30E9\u30F3\u30BF\u30A4\u30E0\u7BA1\u7406\u30A8\u30FC\u30B8\u30A7\u30F3\u30C8\u8A2D\u5B9A\u304C\u5B89\u5168\u3067\u306F\u3042\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002\u30D1\u30B9\u30EF\u30FC\u30C9\u8A8D\u8A3C\u304C\u7121\u52B9\u3067\u3057\u305F\u3002\u30DD\u30FC\u30C8\u756A\u53F7\u304A\u3088\u3073\u30DB\u30B9\u30C8\u540D\u3092\u77E5\u3063\u3066\u3044\u308B(\u307E\u305F\u306F\u4E88\u60F3\u3059\u308B)\u30EA\u30E2\u30FC\u30C8\u30FB\u30E6\u30FC\u30B6\u30FC\u304C\u3001Java\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u304A\u3088\u3073\u30D7\u30E9\u30C3\u30C8\u30D5\u30A9\u30FC\u30E0\u3092\u30E2\u30CB\u30BF\u30FC\u304A\u3088\u3073\u5236\u5FA1\u3067\u304D\u308B\u3088\u3046\u306B\u306A\u308A\u307E\u3059\u3002\u3053\u308C\u306F\u672C\u756A\u30B7\u30B9\u30C6\u30E0\u3067\u63A8\u5968\u3055\u308C\u307E\u305B\u3093\u3002
421 ManagmentAgentRuleFactory_TEXT_WARN_BOTH_DISABLED=\u5B89\u5168\u3067\u306F\u306A\u3044\u7BA1\u7406\u30A8\u30FC\u30B8\u30A7\u30F3\u30C8\u8A2D\u5B9A: \u30D1\u30B9\u30EF\u30FC\u30C9\u8A8D\u8A3C\u304A\u3088\u3073SSL\u306E\u4E21\u65B9\u304C\u7121\u52B9\u3002
422 ManagmentAgentRuleFactory_TEXT_WARN_BOTH_DISABLED_LONG=\u30E9\u30F3\u30BF\u30A4\u30E0\u7BA1\u7406\u30A8\u30FC\u30B8\u30A7\u30F3\u30C8\u8A2D\u5B9A\u304C\u5B89\u5168\u3067\u306F\u3042\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002\u30D1\u30B9\u30EF\u30FC\u30C9\u8A8D\u8A3C\u304A\u3088\u3073SSL\u306E\u4E21\u65B9\u304C\u7121\u52B9\u3067\u3057\u305F\u3002\u30DD\u30FC\u30C8\u756A\u53F7\u304A\u3088\u3073\u30DB\u30B9\u30C8\u540D\u3092\u77E5\u3063\u3066\u3044\u308B(\u307E\u305F\u306F\u4E88\u60F3\u3059\u308B)\u30EA\u30E2\u30FC\u30C8\u30FB\u30E6\u30FC\u30B6\u30FC\u304C\u3001Java\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u304A\u3088\u3073\u30D7\u30E9\u30C3\u30C8\u30D5\u30A9\u30FC\u30E0\u3092\u30E2\u30CB\u30BF\u30FC\u304A\u3088\u3073\u5236\u5FA1\u3067\u304D\u307E\u3059\u3002\u3053\u308C\u306F\u672C\u756A\u30B7\u30B9\u30C6\u30E0\u3067\u63A8\u5968\u3055\u308C\u307E\u305B\u3093\u3002
423 ManagmentAgentRuleFactory_TEXT_WARN_CONFIGURE_GUIDE=\u7BA1\u7406\u30A8\u30FC\u30B8\u30A7\u30F3\u30C8\u306E\u69CB\u6210\u65B9\u6CD5\u306E\u8A73\u7D30\u306F\u3001&lt;a href=&quot;https://docs.oracle.com/javase/8/docs/technotes/guides/management/agent.html&quot;&gt;Java\u30E2\u30CB\u30BF\u30EA\u30F3\u30B0\u304A\u3088\u3073\u7BA1\u7406\u30AC\u30A4\u30C9&lt;/a&gt;\u3092\u53C2\u7167\u3057\u3066\u304F\u3060\u3055\u3044\u3002
424 ManyRunningProcessesRule_RULE_NAME=\u7AF6\u5408\u3057\u3066\u3044\u308B\u30D7\u30ED\u30BB\u30B9
425 # {0} is a number, {1} is a time stamp
426 ManyRunningProcessesRule_TEXT_INFO=\u3053\u306E\u30D5\u30E9\u30A4\u30C8\u8A18\u9332\u306E\u4F5C\u6210\u4E2D\u306B\u3001{0}\u306E\u30D7\u30ED\u30BB\u30B9\u304C\u5B9F\u884C\u3055\u308C\u3066\u3044\u307E\u3057\u305F\u3002
427 # {0} is a number, {1} is a time stamp
428 ManyRunningProcessesRule_TEXT_INFO_LONG=\u3053\u306E\u30D5\u30E9\u30A4\u30C8\u8A18\u9332\u304C\u4F5C\u6210\u3055\u308C\u305F\u30DB\u30B9\u30C8\u30FB\u30DE\u30B7\u30F3\u3067\u3001{1}\u306B\u3001\u5408\u8A08{0}\u306E\u5225\u306E\u30D7\u30ED\u30BB\u30B9\u304C\u5B9F\u884C\u3055\u308C\u3066\u3044\u307E\u3057\u305F\u3002
429 ManyRunningProcessesRule_TEXT_RECOMMENDATION=\u3053\u308C\u304C\u30B5\u30FC\u30D0\u30FC\u74B0\u5883\u306E\u5834\u5408\u3001\u305D\u306E\u30DE\u30B7\u30F3\u3067\u5B9F\u884C\u3059\u308B\u306E\u306F\u3001\u305D\u306E\u4ED6\u306E\u91CD\u8981\u306A\u30D7\u30ED\u30BB\u30B9\u306E\u307F\u306B\u3059\u308B\u3053\u3068\u3092\u304A\u85A6\u3081\u3057\u307E\u3059\u3002
430 ManyRunningProcessesRule_INFO_LIMIT=\u7AF6\u5408\u3057\u3066\u3044\u308B\u30D7\u30ED\u30BB\u30B9\u5236\u9650
431 ManyRunningProcessesRule_INFO_LIMIT_LONG=\u60C5\u5831\u901A\u77E5\u306E\u30C8\u30EA\u30AC\u30FC\u306B\u5FC5\u8981\u3068\u3055\u308C\u308B\u3001\u540C\u6642\u30D7\u30ED\u30BB\u30B9\u306E\u6570
432 MetaspaceOomRuleFactory_RULE_NAME=\u30E1\u30BF\u30B9\u30DA\u30FC\u30B9\u304C\u30E1\u30E2\u30EA\u30FC\u4E0D\u8DB3\u3067\u3059
433 MetaspaceOomRuleFactory_TEXT_OK=\u3053\u306E\u8A18\u9332\u4E2D\u306B\u30E1\u30BF\u30B9\u30DA\u30FC\u30B9\u306F\u6D88\u8017\u3057\u307E\u305B\u3093\u3067\u3057\u305F\u3002
434 # {0} is a number
435 MetaspaceOomRuleFactory_TEXT_WARN=\u3053\u306E\u8A18\u9332\u306B\u306F{0} &#39;&#39;\u30E1\u30BF\u30B9\u30DA\u30FC\u30B9\u30FB\u30E1\u30E2\u30EA\u30FC\u4E0D\u8DB3&#39;&#39;\u30A4\u30D9\u30F3\u30C8\u304C\u3042\u308A\u307E\u3059\u3002
436 MetaspaceOomRuleFactory_TEXT_WARN_LONG=&#39;-XX:MaxMetaSpaceSize&#39;\u30D5\u30E9\u30B0\u3092\u5897\u52A0\u307E\u305F\u306F\u524A\u9664\u3059\u308B\u304B\u3001\u30AF\u30E9\u30B9\u304C\u9069\u5207\u306B\u30A2\u30F3\u30ED\u30FC\u30C9\u3055\u308C\u3066\u3044\u306A\u3044\u7406\u7531\u3092\u8ABF\u67FB\u3057\u307E\u3059\u3002
437 MethodProfilingDataProvider_AGGR_AGGR_TOP_FRAME_QUOTA=\u30C8\u30C3\u30D7\u30FB\u30D5\u30EC\u30FC\u30E0\u5272\u5F53\u3066\u5236\u9650
438 MethodProfilingDataProvider_AGGR_AGGR_TOP_FRAME_QUOTA_DESC=\u30C8\u30C3\u30D7\u30FB\u30D5\u30EC\u30FC\u30E0\u3068\u5408\u8A08\u30B5\u30F3\u30D7\u30EB\u30FB\u30AB\u30A6\u30F3\u30C8\u9593\u306E\u5272\u5F53\u3066\u5236\u9650
439 MethodProfilingDataProvider_AGGR_MAX_ENDTIME=\u6700\u5927\u7D42\u4E86\u6642\u9593
440 MethodProfilingDataProvider_AGGR_MIN_ENDTIME=\u6700\u5C0F\u7D42\u4E86\u6642\u9593
441 MethodProfilingDataProvider_AGGR_TOP_FRAME_BALANCE=\u30C8\u30C3\u30D7\u30FB\u30D5\u30EC\u30FC\u30E0\u30FB\u30D0\u30E9\u30F3\u30B9
442 MethodProfilingDataProvider_AGGR_TOP_FRAME_BALANCE_DESC=\u30B9\u30BF\u30C3\u30AF\u30C8\u30EC\u30FC\u30B9\u30FB\u30C8\u30C3\u30D7\u30FB\u30D5\u30EC\u30FC\u30E0\u9593\u306E\u76F8\u5BFE\u30D0\u30E9\u30F3\u30B9
443 MethodProfilingRule_RULE_NAME=\u30E1\u30BD\u30C3\u30C9\u30FB\u30D7\u30ED\u30D5\u30A1\u30A4\u30EA\u30F3\u30B0
444 MethodProfilingRule_WINDOW_SIZE=\u30E1\u30BD\u30C3\u30C9\u30FB\u30D7\u30ED\u30D5\u30A1\u30A4\u30EA\u30F3\u30B0\u30FB\u30A6\u30A3\u30F3\u30C9\u30A6\u30FB\u30B5\u30A4\u30BA
445 MethodProfilingRule_WINDOW_SIZE_DESC=\u3053\u306E\u8A18\u9332\u5185\u306E\u30E1\u30BD\u30C3\u30C9\u30FB\u30D7\u30ED\u30D5\u30A1\u30A4\u30EA\u30F3\u30B0\u30FB\u30B5\u30F3\u30D7\u30EB\u306E\u8A55\u4FA1\u306B\u4F7F\u7528\u3059\u308B\u30B9\u30E9\u30A4\u30C7\u30A3\u30F3\u30B0\u30FB\u30A6\u30A3\u30F3\u30C9\u30A6\u306E\u30B5\u30A4\u30BA\u3002\u3053\u306E\u30EB\u30FC\u30EB\u306E\u8A55\u4FA1\u306B\u9577\u6642\u9593\u304B\u304B\u308B\u5834\u5408\u306F\u3001\u3053\u306E\u30D1\u30E9\u30E1\u30FC\u30BF\u3092\u5927\u304D\u304F\u3059\u308B\u3053\u3068\u3092\u691C\u8A0E\u3057\u3066\u304F\u3060\u3055\u3044\u3002\u30A6\u30A3\u30F3\u30C9\u30A6\u30FB\u30B5\u30A4\u30BA\u3092\u5927\u304D\u304F\u3059\u308B\u3068\u30EB\u30FC\u30EB\u306E\u7CBE\u5EA6\u304C\u4F4E\u4E0B\u3059\u308B\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002
446 MethodProfilingRule_EXCLUDED_PACKAGES=\u30B9\u30BF\u30C3\u30AF\u30FB\u30C8\u30EC\u30FC\u30B9\u304B\u3089\u9664\u5916\u3059\u308B\u30D1\u30C3\u30B1\u30FC\u30B8
447 MethodProfilingRule_EXCLUDED_PACKAGES_DESC=\u30B9\u30BF\u30C3\u30AF\u30FB\u30C8\u30EC\u30FC\u30B9\u3092\u30C8\u30E9\u30D0\u30FC\u30B9\u3059\u308B\u969B\u306B\u9664\u5916\u3059\u308B\u30D1\u30C3\u30B1\u30FC\u30B8\u3002\u3069\u3061\u3089\u306B\u3082\u5C5E\u3055\u306A\u3044\u6700\u521D\u306E\u30D5\u30EC\u30FC\u30E0\u306B\u5230\u9054\u3059\u308B\u307E\u3067\u3001\u30D1\u30BF\u30FC\u30F3\u306B\u4E00\u81F4\u3059\u308B\u3059\u3079\u3066\u306E\u30D5\u30EC\u30FC\u30E0\u3092\u524A\u9664\u3057\u307E\u3059\u3002\u304B\u308F\u308A\u306B\u3001\u6700\u521D\u306B\u691C\u51FA\u3055\u308C\u305F\u30D5\u30EC\u30FC\u30E0\u3092\u65B0\u3057\u3044\u3082\u306E\u3068\u3057\u3066\u30AB\u30A6\u30F3\u30C8\u3057\u307E\u3059\u3002
448 # {0} is a number, {1} is a number
449 NumberOfGcThreadsRuleFactory_TEXT_INFO=\u30E9\u30F3\u30BF\u30A4\u30E0\u306F{0} GC\u30B9\u30EC\u30C3\u30C9\u3092{1} CPU\u30B3\u30A2\u306E\u3042\u308B\u30DE\u30B7\u30F3\u3067\u4F7F\u7528\u3057\u307E\u3057\u305F\u3002
450 NumberOfGcThreadsRuleFactory_TEXT_INFO_LONG=\u4F7F\u7528\u53EF\u80FD\u306A\u30B3\u30A2\u3088\u308A\u3082\u591A\u304F\u306EGC\u30B9\u30EC\u30C3\u30C9\u3092\u4F7F\u7528\u3059\u308B\u306E\u306F\u9069\u5207\u3067\u306F\u3042\u308A\u307E\u305B\u3093\u3002&#39;-XX:ParallelGCThreads&#39;\u30D5\u30E9\u30B0\u3092\u524A\u9664\u3059\u308B\u3068\u3001JVM\u3067GC\u30B9\u30EC\u30C3\u30C9\u306E\u6570\u3092\u81EA\u52D5\u7684\u306B\u8A2D\u5B9A\u3067\u304D\u307E\u3059\u3002
451 ObjectStatisticsDataProvider_AGGR_LIVE_SIZE_INCREASE=\u30E9\u30A4\u30D6\u5897\u52A0\u30B5\u30A4\u30BA
452 ObjectStatisticsDataProvider_AGGR_LIVE_SIZE_INCREASE_DESC=\u6700\u521D\u306E\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u5F8C\u304B\u3089\u6700\u5F8C\u306E\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u5F8C\u307E\u3067\u306E\u5408\u8A08\u30B5\u30A4\u30BA\u306E\u5DEE
453 OptionsCheckRule_CONFIG_ACCEPTED_OPTIONS=\u53D7\u5165\u308C\u6E08\u30AA\u30D7\u30B7\u30E7\u30F3
454 OptionsCheckRule_CONFIG_ACCEPTED_OPTIONS_LONG=\u3053\u306E\u30AB\u30F3\u30DE\u533A\u5207\u308A\u306E\u30EA\u30B9\u30C8\u306B\u3042\u308B-XX (\u672A\u691C\u8A3C) JVM\u30AA\u30D7\u30B7\u30E7\u30F3\u540D\u306F\u3001\u30EB\u30FC\u30EB\u3067\u30C1\u30A7\u30C3\u30AF\u3055\u308C\u307E\u305B\u3093
455 OptionsCheckRule_RULE_NAME=\u30B3\u30DE\u30F3\u30C9\u884C\u30AA\u30D7\u30B7\u30E7\u30F3\u30FB\u30C1\u30A7\u30C3\u30AF
456 # {0} is a Java version string
457 OptionsCheckRule_TEXT_DEPRECATED=Java {0}\u3067\u306F\u975E\u63A8\u5968\u3067\u3059\u3002
458 # {0} is a Java version string, {1} is a Java version string
459 OptionsCheckRule_TEXT_DEPRECATED_IGNORED=Java {0}\u3067\u306F\u975E\u63A8\u5968\u3067\u3001Java {1}\u3067\u306F\u7121\u8996\u3055\u308C\u307E\u3059\u3002
460 # {0} is a Java version string, {1} is a Java version string, {2} is a Java version string
461 OptionsCheckRule_TEXT_DEPRECATED_IGNORED_REMOVED=Java {0}\u3067\u306F\u975E\u63A8\u5968\u3067\u3001Java {1}\u3067\u306F\u7121\u8996\u3055\u308C\u3001Java {2}\u3067\u306F\u524A\u9664\u3055\u308C\u307E\u3059\u3002
462 # {0} is a Java version string, {1} is a Java version string
463 OptionsCheckRule_TEXT_DEPRECATED_REMOVED=Java {0}\u3067\u306F\u975E\u63A8\u5968\u3067\u3001Java {1}\u3067\u306F\u524A\u9664\u3055\u308C\u307E\u3059\u3002
464 OptionsCheckRule_TEXT_DEPRECATED_WARNING=\u975E\u63A8\u5968\u306E\u30AA\u30D7\u30B7\u30E7\u30F3\u30FB\u30D5\u30E9\u30B0\u306F\u56DE\u907F\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002\u3053\u308C\u3089\u306F\u30EC\u30AC\u30B7\u30FC\u30FB\u30B3\u30FC\u30C9\u3092\u6709\u52B9\u306B\u3059\u308B\u5834\u5408\u3068\u3001\u5B8C\u5168\u306B\u7121\u8996\u3055\u308C\u308B\u5834\u5408\u304C\u3042\u308A\u307E\u3059\u3002\u901A\u5E38\u306F\u3001\u4ECA\u5F8C\u306EJava\u30EA\u30EA\u30FC\u30B9\u3067\u524A\u9664\u3055\u308C\u307E\u3059\u3002
465 # {0} is a Java version string
466 OptionsCheckRule_TEXT_IGNORED=Java {0}\u3067\u306F\u7121\u8996\u3055\u308C\u307E\u3059\u3002
467 # {0} is a Java version string, {1} is a Java version string
468 OptionsCheckRule_TEXT_IGNORED_REMOVED=Java {0}\u3067\u306F\u7121\u8996\u3055\u308C\u3001Java {1}\u3067\u306F\u524A\u9664\u3055\u308C\u307E\u3059\u3002
469 OptionsCheckRule_TEXT_NA=JVM\u5F15\u6570\u306E\u3042\u308B\u30A4\u30D9\u30F3\u30C8\u306F\u8A18\u9332\u3055\u308C\u3066\u3044\u307E\u305B\u3093
470 OptionsCheckRule_TEXT_OK=\u30C9\u30AD\u30E5\u30E1\u30F3\u30C8\u5316\u3055\u308C\u3066\u3044\u306A\u3044\u304B\u3001\u975E\u63A8\u5968\u306B\u306A\u3063\u305F\u304B\u3001\u63A8\u5968\u3055\u308C\u3066\u3044\u306A\u3044\u30AA\u30D7\u30B7\u30E7\u30F3\u30FB\u30D5\u30E9\u30B0\u304C\u691C\u51FA\u3055\u308C\u307E\u3057\u305F
471 OptionsCheckRule_TEXT_UNDOC_DEPR_NOTREC=\u30C9\u30AD\u30E5\u30E1\u30F3\u30C8\u5316\u3055\u308C\u3066\u304A\u3089\u305A\u3001\u975E\u63A8\u5968\u306B\u306A\u3063\u305F\u3001\u63A8\u5968\u3055\u308C\u3066\u3044\u306A\u3044\u30AA\u30D7\u30B7\u30E7\u30F3\u30FB\u30D5\u30E9\u30B0\u304C\u691C\u51FA\u3055\u308C\u307E\u3057\u305F\u3002
472 OptionsCheckRule_TEXT_UNDOC_DEPR=\u30C9\u30AD\u30E5\u30E1\u30F3\u30C8\u5316\u3055\u308C\u3066\u304A\u3089\u305A\u3001\u975E\u63A8\u5968\u306B\u306A\u3063\u305F\u30AA\u30D7\u30B7\u30E7\u30F3\u30FB\u30D5\u30E9\u30B0\u304C\u691C\u51FA\u3055\u308C\u307E\u3057\u305F\u3002
473 OptionsCheckRule_TEXT_UNDOC_NOTREC=\u30C9\u30AD\u30E5\u30E1\u30F3\u30C8\u5316\u3055\u308C\u3066\u304A\u3089\u305A\u3001\u63A8\u5968\u3055\u308C\u3066\u3044\u306A\u3044\u30AA\u30D7\u30B7\u30E7\u30F3\u30FB\u30D5\u30E9\u30B0\u304C\u691C\u51FA\u3055\u308C\u307E\u3057\u305F\u3002
474 OptionsCheckRule_TEXT_DEPR_NOTREC=\u975E\u63A8\u5968\u306B\u306A\u3063\u305F\u3001\u63A8\u5968\u3055\u308C\u3066\u3044\u306A\u3044\u30AA\u30D7\u30B7\u30E7\u30F3\u30FB\u30D5\u30E9\u30B0\u304C\u691C\u51FA\u3055\u308C\u307E\u3057\u305F\u3002
475 OptionsCheckRule_TEXT_UNDOC=\u30C9\u30AD\u30E5\u30E1\u30F3\u30C8\u5316\u3055\u308C\u3066\u3044\u306A\u3044\u30AA\u30D7\u30B7\u30E7\u30F3\u30FB\u30D5\u30E9\u30B0\u304C\u691C\u51FA\u3055\u308C\u307E\u3057\u305F\u3002
476 OptionsCheckRule_TEXT_DEPR=\u975E\u63A8\u5968\u306E\u30AA\u30D7\u30B7\u30E7\u30F3\u30FB\u30D5\u30E9\u30B0\u304C\u691C\u51FA\u3055\u308C\u307E\u3057\u305F\u3002
477 OptionsCheckRule_TEXT_NOTREC=\u63A8\u5968\u3055\u308C\u3066\u3044\u306A\u3044\u30AA\u30D7\u30B7\u30E7\u30F3\u30FB\u30D5\u30E9\u30B0\u304C\u691C\u51FA\u3055\u308C\u307E\u3057\u305F\u3002
478 OptionsCheckRule_TEXT_GENERAL_PROBLEM=\u30AA\u30D7\u30B7\u30E7\u30F3\u30FB\u30D5\u30E9\u30B0\u306E\u554F\u984C\u304C\u691C\u51FA\u3055\u308C\u307E\u3057\u305F\u3002
479 OptionsCheckRule_TEXT_OPTION_DEPRECATED=\u6B21\u306E\u30AA\u30D7\u30B7\u30E7\u30F3\u30FB\u30D5\u30E9\u30B0\u306F\u975E\u63A8\u5968\u306B\u306A\u3063\u305F\u304B\u3001\u975E\u63A8\u5968\u306B\u306A\u308B\u4E88\u5B9A\u3067\u3059\u3002
480 OptionsCheckRule_TEXT_OPTION_NOT_DOCUMENTED=\u6B21\u306E\u30AA\u30D7\u30B7\u30E7\u30F3\u30FB\u30D5\u30E9\u30B0\u306F\u30C9\u30AD\u30E5\u30E1\u30F3\u30C8\u5316\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002
481 OptionsCheckRule_TEXT_OPTION_NOT_RECOMMENDED=\u6B21\u306E\u30AA\u30D7\u30B7\u30E7\u30F3\u30FB\u30D5\u30E9\u30B0\u306F\u304A\u85A6\u3081\u3057\u307E\u305B\u3093\u3002
482 OptionsCheckRule_TEXT_OPTIONS_DEPRECATED=\u6B21\u306E\u30AA\u30D7\u30B7\u30E7\u30F3\u30FB\u30D5\u30E9\u30B0\u306F\u975E\u63A8\u5968\u306B\u306A\u3063\u305F\u304B\u3001\u975E\u63A8\u5968\u306B\u306A\u308B\u4E88\u5B9A\u3067\u3059\u3002
483 OptionsCheckRule_TEXT_OPTIONS_NOT_DOCUMENTED=\u6B21\u306E\u30AA\u30D7\u30B7\u30E7\u30F3\u30FB\u30D5\u30E9\u30B0\u306F\u30C9\u30AD\u30E5\u30E1\u30F3\u30C8\u5316\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002
484 OptionsCheckRule_TEXT_OPTIONS_NOT_RECOMMENDED=\u6B21\u306E\u30AA\u30D7\u30B7\u30E7\u30F3\u30FB\u30D5\u30E9\u30B0\u306F\u304A\u85A6\u3081\u3057\u307E\u305B\u3093\u3002
485 # {0} is a Java version string
486 OptionsCheckRule_TEXT_REMOVED=Java {0}\u3067\u306F\u524A\u9664\u3055\u308C\u307E\u3059\u3002
487 OptionsCheckRule_TEXT_UNDOCUMENTED_WARNING=\u30C9\u30AD\u30E5\u30E1\u30F3\u30C8\u5316\u3055\u308C\u3066\u3044\u306A\u3044\u30D5\u30E9\u30B0\u306F\u3001\u5373\u6642\u306B\u306F\u660E\u3089\u304B\u306B\u306A\u3089\u306A\u3044\u65B9\u6CD5\u3067JVM\u306B\u5F71\u97FF\u3059\u308B\u3053\u3068\u304C\u3042\u308A\u3001\u5C06\u6765\u306E\u30EA\u30EA\u30FC\u30B9\u3067\u8B66\u544A\u306A\u3057\u306B\u524A\u9664\u3055\u308C\u308B\u53EF\u80FD\u6027\u3082\u3042\u308A\u307E\u3059\u3002
488 OptionsCheckRule_TEXT_USE_MAXRAMFRACTION=\u304B\u308F\u308A\u306BMaxRAMFraction\u3092\u4F7F\u7528\u3057\u3066\u304F\u3060\u3055\u3044
489 OverAggressiveRecordingSettingRuleFactory_RULE_NAME=\u975E\u63A8\u5968\u306E\u8A18\u9332\u8A2D\u5B9A
490 OverAggressiveRecordingSettingRuleFactory_RULE_TEXT_OK=\u8A18\u9332\u8A2D\u5B9A\u306B\u554F\u984C\u306F\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002
491 OverAggressiveRecordingSettingRuleFactory_TEXT_INFO=\u6B21\u306E\u30A4\u30D9\u30F3\u30C8\u30FB\u30BF\u30A4\u30D7\u306B\u3057\u304D\u3044\u5024\u304C\u3042\u308A\u307E\u305B\u3093\u3067\u3057\u305F: {0}\u3002
492 # {0} is a list of event type names
493 OverAggressiveRecordingSettingRuleFactory_TEXT_INFO_LONG=\u3057\u304D\u3044\u5024\u306E\u306A\u3044\u30A4\u30D9\u30F3\u30C8\u30FB\u30BF\u30A4\u30D7\u306B\u3088\u3063\u3066\u5927\u91CF\u306E\u30A4\u30D9\u30F3\u30C8\u304C\u751F\u6210\u3055\u308C\u3001\u30AA\u30FC\u30D0\u30FC\u30D8\u30C3\u30C9\u306E\u4E0A\u6607\u3092\u62DB\u304F\u5834\u5408\u304C\u3042\u308A\u307E\u3059\u3002\u3053\u308C\u304C\u610F\u56F3\u7684\u3067\u306F\u306A\u3044\u5834\u5408\u3001\u4ECA\u5F8C\u306E\u8A18\u9332\u306E\u305F\u3081\u306B\u30C6\u30F3\u30D7\u30EC\u30FC\u30C8\u306E\u8A2D\u5B9A\u3092\u78BA\u8A8D\u3057\u3066\u304F\u3060\u3055\u3044\u3002
494 ParGcFewThreadsRuleFactory_TEXT_INFO=JVM\u306F\u30D1\u30E9\u30EC\u30EBGC\u3092\u4F7F\u7528\u3057\u3066\u5B9F\u884C\u3055\u308C\u307E\u3057\u305F\u304C\u3001GC\u30B9\u30EC\u30C3\u30C9\u306F1\u3064\u3060\u3051\u3067\u3057\u305F\u3002
495 ParGcFewThreadsRuleFactory_TEXT_INFO_LONG=JVM\u306F\u30D1\u30E9\u30EC\u30EBGC\u3092\u4F7F\u7528\u3057\u3066\u5B9F\u884C\u3055\u308C\u307E\u3057\u305F\u304C\u3001GC\u30B9\u30EC\u30C3\u30C9\u306F1\u3064\u3060\u3051\u3067\u3057\u305F\u3002\u3053\u308C\u306F\u9069\u5207\u3067\u306F\u3042\u308A\u307E\u305B\u3093\u3002GC\u30B9\u30EC\u30C3\u30C9\u306E\u6570\u3092\u5909\u66F4\u3059\u308B\u306B\u306F\u3001\u30B3\u30DE\u30F3\u30C9\u884C\u30D5\u30E9\u30B0\u306E&lt;a href=&quot;https://docs.oracle.com/javase/8/docs/technotes/guides/vm/gctuning/parallel.html&quot;&gt;-XX:ParallelGCThreads=X&lt;/a&gt;\u3092\u4F7F\u7528\u3057\u307E\u3059\u3002&#39;-XX:ParallelGCThreads&#39;\u30D5\u30E9\u30B0\u3092\u4F7F\u7528\u305B\u305A\u306B\u5B9F\u884C\u3059\u308C\u3070\u3001JVM\u3067\u306F\u9069\u5207\u306A\u6570\u306EGC\u30B9\u30EC\u30C3\u30C9\u304C\u81EA\u52D5\u7684\u306B\u4F7F\u7528\u3055\u308C\u307E\u3059\u3002
496 ParallelOnSingleCpuRuleFactory_TEXT_INFO=\u30E9\u30F3\u30BF\u30A4\u30E0\u306F\u30B7\u30F3\u30B0\u30EB\u30B3\u30A2\u30FB\u30DE\u30B7\u30F3\u3067\u30D1\u30E9\u30EC\u30EBGC\u3092\u4F7F\u7528\u3057\u307E\u3057\u305F\u3002
497 ParallelOnSingleCpuRuleFactory_TEXT_INFO_LONG=\u30E9\u30F3\u30BF\u30A4\u30E0\u306F\u30B7\u30F3\u30B0\u30EB\u30B3\u30A2\u30FB\u30DE\u30B7\u30F3\u3067\u30D1\u30E9\u30EC\u30EBGC\u3092\u4F7F\u7528\u3057\u307E\u3057\u305F\u3002\u3053\u308C\u306F\u9069\u5207\u3067\u306F\u3042\u308A\u307E\u305B\u3093\u3002\u30B7\u30F3\u30B0\u30EB\u30B3\u30A2\u30FB\u30DE\u30B7\u30F3\u306B\u6700\u9069\u5316\u3055\u308C\u3066\u3044\u308B&lt;a href=&quot;https://docs.oracle.com/javase/8/docs/technotes/guides/vm/gctuning/collectors.html&quot;&gt;\u30B7\u30EA\u30A2\u30EB\u30FB\u30B3\u30EC\u30AF\u30BF&lt;/a&gt;\u3092\u304B\u308F\u308A\u306B\u4F7F\u7528\u3057\u3066\u304F\u3060\u3055\u3044\u3002
498 VerifyNoneRule_WLS_TEXT_INFO=\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u3067\u306F\u3001\u30D0\u30A4\u30C8\u30B3\u30FC\u30C9\u691C\u8A3C\u304C\u7121\u52B9\u5316\u3055\u308C\u305F\u307E\u307EWebLogic Server\u304C\u5B9F\u884C\u3055\u308C\u3066\u3044\u307E\u3057\u305F\u3002
499 VerifyNoneRule_WLS_TEXT_INFO_LONG=\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u3067\u306F\u3001\u30D0\u30A4\u30C8\u30B3\u30FC\u30C9\u691C\u8A3C\u304C\u7121\u52B9\u5316\u3055\u308C\u305F\u307E\u307EWebLogic Server\u304C\u5B9F\u884C\u3055\u308C\u3066\u3044\u307E\u3057\u305F\u3002\u4E00\u822C\u7684\u306B\u306F\u63A8\u5968\u3055\u308C\u307E\u305B\u3093\u304C\u3001WLS\u3067\u306F\u554F\u984C\u3042\u308A\u307E\u305B\u3093\u3002
500 VerifyNoneRule_TEXT_INFO=\u30D0\u30A4\u30C8\u30B3\u30FC\u30C9\u691C\u8A3C\u304C\u7121\u52B9\u5316\u3055\u308C\u305F\u307E\u307E\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u304C\u5B9F\u884C\u3055\u308C\u3066\u3044\u307E\u3057\u305F\u3002
501 VerifyNoneRule_TEXT_INFO_LONG=\u30D0\u30A4\u30C8\u30B3\u30FC\u30C9\u691C\u8A3C\u304C\u7121\u52B9\u5316\u3055\u308C\u305F\u307E\u307E\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u304C\u5B9F\u884C\u3055\u308C\u3066\u3044\u307E\u3057\u305F\u3002\u30D0\u30A4\u30C8\u30FB\u30B3\u30FC\u30C9\u691C\u8A3C\u306E\u7121\u52B9\u5316\u306F\u5B89\u5168\u3067\u306F\u306A\u3044\u305F\u3081\u3001\u672C\u756A\u30B7\u30B9\u30C6\u30E0\u3067\u306F\u884C\u308F\u306A\u3044\u3067\u304F\u3060\u3055\u3044\u3002\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306B\u5FC5\u8981\u306A\u3044\u5834\u5408\u306F\u3001\u30B3\u30DE\u30F3\u30C9\u884C\u3067&#39;-Xverify:none&#39;\u3084&#39;-noverify&#39;\u3092\u4F7F\u7528\u3057\u306A\u3044\u3067\u304F\u3060\u3055\u3044\u3002&lt;a href=&quot;https://www.securecoding.cert.org/confluence/display/java/ENV04-J.+Do+not+disable+bytecode+verification&quot;&gt;Java\u30BB\u30AD\u30E5\u30A2\u30FB\u30B3\u30FC\u30C7\u30A3\u30F3\u30B0\u30FB\u30B9\u30BF\u30F3\u30C0\u30FC\u30C9&lt;/a&gt;\u3092\u53C2\u7167\u3057\u3066\u304F\u3060\u3055\u3044\u3002
502 VerifyNoneRule_RULE_NAME=\u30D0\u30A4\u30C8\u30FB\u30B3\u30FC\u30C9\u691C\u8A3C
503 VerifyNoneRule_TEXT_OK=\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306F\u3001\u30D0\u30A4\u30C8\u30B3\u30FC\u30C9\u691C\u8A3C\u304C\u6709\u52B9\u306A\u72B6\u614B\u3067\u5B9F\u884C\u3055\u308C\u3066\u3044\u307E\u3057\u305F\u3002
504 DebugNonSafepointsRule_RULE_NAME=DebugNonSafepoints
505 DebugNonSafepointsRule_DISABLED_TEXT_INFO=DebugNonSafepoints\u304C\u660E\u793A\u7684\u306B\u7121\u52B9\u5316\u3055\u308C\u307E\u3057\u305F\u3002
506 DebugNonSafepointsRule_NOT_ENABLED_TEXT_INFO=DebugNonSafepoints\u304C\u6709\u52B9\u3067\u306F\u3042\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002
507 DebugNonSafepointsRule_NOT_ENABLED_TEXT_INFO_LONG=DebugNonSafepoints\u304C\u6709\u52B9\u5316\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u3001\u30BB\u30FC\u30D5\u30DD\u30A4\u30F3\u30C8\u306B\u306A\u3044\u30B9\u30EC\u30C3\u30C9\u306F\u6B63\u3057\u304F\u30B5\u30F3\u30D7\u30EB\u5316\u3055\u308C\u306A\u3044\u305F\u3081\u3001\u30E1\u30BD\u30C3\u30C9\u30FB\u30D7\u30ED\u30D5\u30A1\u30A4\u30EA\u30F3\u30B0\u30FB\u30C7\u30FC\u30BF\u306E\u6B63\u78BA\u6027\u306F\u4F4E\u4E0B\u3057\u307E\u3059\u3002\u3053\u308C\u3092\u6709\u52B9\u5316\u3059\u308B\u306B\u306F\u3001&#39;-XX:+UnlockDiagnosticVMOptions -XX:+DebugNonSafepoints&#39;\u306EJVM\u30D5\u30E9\u30B0\u3092\u4F7F\u7528\u3057\u3066\u304F\u3060\u3055\u3044\u3002\u3053\u308C\u3089\u306E\u30D5\u30E9\u30B0\u3092\u6709\u52B9\u5316\u3059\u308B\u3068\u3001\u30D1\u30D5\u30A9\u30FC\u30DE\u30F3\u30B9\u306E\u30AA\u30FC\u30D0\u30FC\u30D8\u30C3\u30C9\u304C\u308F\u305A\u304B\u306B\u767A\u751F\u3057\u307E\u3059\u3002\u8A73\u7D30\u306F\u3001&lt;a href=&quot;http://openjdk.java.net/groups/hotspot/docs/RuntimeOverview.html#Thread%20Management|outline&quot;&gt;HotSpot\u30E9\u30F3\u30BF\u30A4\u30E0\u6982\u8981/\u30B9\u30EC\u30C3\u30C9\u7BA1\u7406&lt;/a&gt;\u3092\u53C2\u7167\u3057\u3066\u304F\u3060\u3055\u3044\u3002
508 DebugNonSafepointsRule_TEXT_OK=DebugNonSafepoints\u304C\u660E\u793A\u7684\u306B\u6709\u52B9\u5316\u3055\u308C\u307E\u3057\u305F\u3002
509 DebugNonSafepointsRule_IMPLICIT_TEXT_OK=\u3053\u306E\u8A18\u9332\u306E\u4F5C\u6210\u306B\u4F7F\u7528\u3055\u308C\u305FJVM\u30D0\u30FC\u30B8\u30E7\u30F3\u3067\u3001DebugNonSafepoints\u304C\u6697\u9ED9\u7684\u306B\u6709\u52B9\u5316\u3055\u308C\u307E\u3057\u305F\u3002
510 DiscouragedGcOptionsRule_RULE_NAME=GC\u8A2D\u5B9A
511 DiscouragedGcOptionsRule_TEXT_OK=GC\u69CB\u6210\u306B\u554F\u984C\u306F\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002
512 DiscouragedVmOptionsRule_RULE_NAME=\u63A8\u5968\u3055\u308C\u306A\u3044VM\u30AA\u30D7\u30B7\u30E7\u30F3
513 DiscouragedVmOptionsRule_TEXT_OK=VM\u30AA\u30D7\u30B7\u30E7\u30F3\u306B\u554F\u984C\u306F\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002
514 DiscouragedVmOptionsRule_BOTH_EXPERIMENTAL_AND_IGNORE=\u5B9F\u9A13\u7684VM\u30AA\u30D7\u30B7\u30E7\u30F3\u304C\u6709\u52B9\u5316\u3055\u308C\u3066\u3044\u308BJVM\u3067\u8A18\u9332\u304C\u5B9F\u884C\u3055\u308C\u3001\u8A8D\u8B58\u3055\u308C\u306A\u3044VM\u30AA\u30D7\u30B7\u30E7\u30F3\u306F\u7121\u8996\u3055\u308C\u307E\u3057\u305F\u3002
515 PasswordsInArgsRule_JAVAARGS_TEXT_INFO=\u8A18\u9332\u5185\u306E\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u5F15\u6570\u306B\u30D1\u30B9\u30EF\u30FC\u30C9\u304C\u542B\u307E\u308C\u3066\u3044\u308B\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002
516 # {0} is a list of argument strings
517 PasswordsInArgsRule_JAVAARGS_TEXT_INFO_LONG=\u3053\u306E\u8A18\u9332\u5185\u3067\u6B21\u306E\u4E0D\u5BE9\u306A\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u5F15\u6570\u304C\u898B\u3064\u304B\u308A\u307E\u3057\u305F: {0}&lt;p&gt;\u30D1\u30B9\u30EF\u30FC\u30C9\u304C\u542B\u307E\u308C\u3066\u3044\u308B\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002\u30D1\u30B9\u30EF\u30FC\u30C9\u3092\u76F4\u63A5Java\u30D7\u30ED\u30BB\u30B9\u306E\u5F15\u6570\u3068\u3057\u3066\u4F7F\u7528\u3057\u306A\u3044\u5834\u5408\u3001\u901A\u5E38\u306F\u30D1\u30B9\u30EF\u30FC\u30C9\u3092\u30BD\u30D5\u30C8\u30A6\u30A7\u30A2\u306B\u63D0\u4F9B\u3059\u308B\u65B9\u6CD5\u304C\u4ED6\u306B\u3042\u308A\u307E\u3059\u3002\u30D1\u30B9\u30EF\u30FC\u30C9\u3092\u5F15\u6570\u3068\u3057\u3066\u4F7F\u7528\u3057\u7D9A\u3051\u308B\u304C\u3001\u30D1\u30B9\u30EF\u30FC\u30C9\u3092\u5171\u6709\u305B\u305A\u306B\u8A18\u9332\u3092\u5171\u6709\u3067\u304D\u308B\u3088\u3046\u306B\u3059\u308B\u5834\u5408\u306F\u3001&#39;&#39;JVM\u60C5\u5831&#39;&#39;\u30A4\u30D9\u30F3\u30C8\u3092\u7121\u52B9\u5316\u3057\u3066\u304F\u3060\u3055\u3044\u3002&#39;&#39;JVM\u60C5\u5831&#39;&#39;\u30A4\u30D9\u30F3\u30C8\u3092\u7121\u52B9\u5316\u3059\u308B\u3068\u3001\u30D5\u30E9\u30A4\u30C8\u30FB\u30EC\u30B3\u30FC\u30C0\u306E\u81EA\u52D5\u5206\u6790\u6A5F\u80FD\u304C\u5236\u9650\u3055\u308C\u308B\u5834\u5408\u304C\u3042\u308B\u3053\u3068\u306B\u6CE8\u610F\u3057\u3066\u304F\u3060\u3055\u3044\u3002
518 PasswordsInArgsRule_RULE_NAME=Java\u5F15\u6570\u306E\u30D1\u30B9\u30EF\u30FC\u30C9
519 PasswordsInArgsRule_TEXT_OK=\u8A18\u9332\u3067\u306F\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u5F15\u6570\u306B\u30D1\u30B9\u30EF\u30FC\u30C9\u304C\u542B\u307E\u308C\u3066\u3044\u308B\u3088\u3046\u306B\u898B\u3048\u307E\u305B\u3093\u3002
520 PasswordsInEnvironmentRuleFactory_RULE_NAME=\u74B0\u5883\u5909\u6570\u306E\u30D1\u30B9\u30EF\u30FC\u30C9
521 PasswordsInEnvironmentRuleFactory_TEXT_INFO=\u8A18\u9332\u5185\u306E\u74B0\u5883\u5909\u6570\u306B\u30D1\u30B9\u30EF\u30FC\u30C9\u304C\u542B\u307E\u308C\u3066\u3044\u308B\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002
522 # {0} is a list of environment variable names
523 PasswordsInEnvironmentRuleFactory_TEXT_INFO_LONG=\u3053\u306E\u8A18\u9332\u5185\u3067\u6B21\u306E\u4E0D\u5BE9\u306A\u74B0\u5883\u5909\u6570\u304C\u898B\u3064\u304B\u308A\u307E\u3057\u305F: {0}&lt;p&gt;\u3053\u308C\u306B\u306F\u30D1\u30B9\u30EF\u30FC\u30C9\u304C\u542B\u307E\u308C\u3066\u3044\u308B\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002\u74B0\u5883\u5909\u6570\u5185\u306B\u30D1\u30B9\u30EF\u30FC\u30C9\u3092\u305D\u306E\u307E\u307E\u4FDD\u6301\u3059\u308B\u304C\u3001\u30D1\u30B9\u30EF\u30FC\u30C9\u3092\u5171\u6709\u305B\u305A\u306B\u8A18\u9332\u3092\u5171\u6709\u3067\u304D\u308B\u3088\u3046\u306B\u3059\u308B\u5834\u5408\u306F\u3001&#39;&#39;\u521D\u671F\u74B0\u5883\u5909\u6570&#39;&#39;\u30A4\u30D9\u30F3\u30C8\u3092\u7121\u52B9\u5316\u3057\u3066\u304F\u3060\u3055\u3044\u3002
524 PasswordsInEnvironmentRuleFactory_TEXT_OK=\u8A18\u9332\u3067\u306F\u74B0\u5883\u5909\u6570\u306B\u30D1\u30B9\u30EF\u30FC\u30C9\u304C\u542B\u307E\u308C\u3066\u3044\u308B\u3088\u3046\u306B\u898B\u3048\u307E\u305B\u3093\u3002
525 PasswordsInSystemPropertiesRule_RULE_NAME=\u30B7\u30B9\u30C6\u30E0\u30FB\u30D7\u30ED\u30D1\u30C6\u30A3\u306E\u30D1\u30B9\u30EF\u30FC\u30C9
526 PasswordsInSystemPropertiesRule_TEXT_INFO=\u8A18\u9332\u5185\u306E\u30B7\u30B9\u30C6\u30E0\u30FB\u30D7\u30ED\u30D1\u30C6\u30A3\u306B\u30D1\u30B9\u30EF\u30FC\u30C9\u304C\u542B\u307E\u308C\u3066\u3044\u308B\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002
527 # {0} is a list of system property names
528 PasswordsInSystemPropertiesRule_TEXT_INFO_LONG=\u3053\u306E\u8A18\u9332\u5185\u3067\u6B21\u306E\u4E0D\u5BE9\u306A\u30B7\u30B9\u30C6\u30E0\u30FB\u30D7\u30ED\u30D1\u30C6\u30A3\u304C\u898B\u3064\u304B\u308A\u307E\u3057\u305F: {0}&lt;p&gt;\u3053\u308C\u306B\u306F\u30D1\u30B9\u30EF\u30FC\u30C9\u304C\u542B\u307E\u308C\u3066\u3044\u308B\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002\u30B7\u30B9\u30C6\u30E0\u30FB\u30D7\u30ED\u30D1\u30C6\u30A3\u5185\u306B\u30D1\u30B9\u30EF\u30FC\u30C9\u3092\u305D\u306E\u307E\u307E\u4FDD\u6301\u3059\u308B\u304C\u3001\u30D1\u30B9\u30EF\u30FC\u30C9\u3092\u5171\u6709\u305B\u305A\u306B\u8A18\u9332\u3092\u5171\u6709\u3067\u304D\u308B\u3088\u3046\u306B\u3059\u308B\u5834\u5408\u306F\u3001&#39;&#39;\u521D\u671F\u30B7\u30B9\u30C6\u30E0\u30FB\u30D7\u30ED\u30D1\u30C6\u30A3&#39;&#39;\u30A4\u30D9\u30F3\u30C8\u3092\u7121\u52B9\u5316\u3057\u3066\u304F\u3060\u3055\u3044\u3002
529 PasswordsInSystemPropertiesRule_TEXT_OK=\u8A18\u9332\u3067\u306F\u30B7\u30B9\u30C6\u30E0\u30FB\u30D7\u30ED\u30D1\u30C6\u30A3\u306B\u30D1\u30B9\u30EF\u30FC\u30C9\u304C\u542B\u307E\u308C\u3066\u3044\u308B\u3088\u3046\u306B\u898B\u3048\u307E\u305B\u3093\u3002
530 ReferenceStatisticsType_FINAL_REFERENCES=\u6700\u7D42\u53C2\u7167
531 ReferenceStatisticsType_PHANTOM_REFERENCES=\u30D5\u30A1\u30F3\u30C8\u30E0\u53C2\u7167
532 ReferenceStatisticsType_SOFT_REFERENCES=\u30BD\u30D5\u30C8\u53C2\u7167
533 ReferenceStatisticsType_WEAK_REFERENCES=\u5F31\u3044\u53C2\u7167
534 SerialGcOnMultiCpuRuleFactory_TEXT_INFO=\u30B7\u30EA\u30A2\u30EB\u30FB\u30B3\u30EC\u30AF\u30BF\u304C\u30DE\u30EB\u30C1\u30B3\u30A2\u30FB\u30DE\u30B7\u30F3\u3067\u4F7F\u7528\u3055\u308C\u307E\u3057\u305F\u3002
535 SerialGcOnMultiCpuRuleFactory_TEXT_INFO_LONG=JVM\u306F\u3001\u30DE\u30EB\u30C1\u30B3\u30A2\u30FB\u30DE\u30B7\u30F3\u3067\u5B9F\u884C\u3057\u305F\u5834\u5408\u3067\u3082\u30B7\u30EA\u30A2\u30EBGC\u3092\u4F7F\u7528\u3057\u307E\u3057\u305F\u3002Concurrent Mark Sweep\u3092\u4F7F\u7528\u3059\u308B\u3053\u3068\u3067\u3001G1\u307E\u305F\u306F\u30D1\u30E9\u30EC\u30EBGC\u304C\u304B\u308F\u308A\u306BGC\u30D1\u30D5\u30A9\u30FC\u30DE\u30F3\u30B9\u306E\u5411\u4E0A\u3092\u3082\u305F\u3089\u3059\u5834\u5408\u304C\u3042\u308A\u307E\u3059\u3002
536 SerialOldRuleFactory_TEXT_WARN_CMS=CMS\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30BF\u304C\u4F7F\u7528\u3055\u308C\u307E\u3057\u305F\u304C\u3001JVM\u306FSerial Old Collection\u3092\u884C\u3046\u305F\u3081\u306B\u623B\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3057\u305F\u3002
537 SerialOldRuleFactory_TEXT_WARN_CMS_LONG=\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u3067Concurrent Mark Sweep\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30BF\u304C\u4F7F\u7528\u3055\u308C\u307E\u3057\u305F\u304C\u3001JVM\u306F\u3001\u3055\u3089\u306B\u6642\u9593\u3092\u8981\u3059\u308BSerial Old Collection\u306B\u623B\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3057\u305F\u3002\u3053\u308C\u306F\u3001Concurrent Collector\u304C\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u4E2D\u306B\u767A\u751F\u3057\u305F\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u5272\u5F53\u3066\u3092\u4FDD\u6301\u3067\u304D\u306A\u304B\u3063\u305F\u305F\u3081\u3067\u3059\u3002\u3053\u306E\u30EA\u30B9\u30AF\u306F\u3001&lt;a href=&quot;https://docs.oracle.com/javase/8/docs/technotes/guides/vm/gctuning/cms.html&quot;&gt;-XX:CMSInitiatingOccupancyFraction&lt;/a&gt;\u306E\u5024\u3092\u4F4E\u304F\u3059\u308B\u3053\u3068\u3067\u6291\u5236\u3067\u304D\u307E\u3059\u3002
538 SerialOldRuleFactory_TEXT_WARN_G1=G1\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30BF\u304C\u4F7F\u7528\u3055\u308C\u307E\u3057\u305F\u304C\u3001JVM\u306FSerial Old Collection\u3092\u884C\u3046\u305F\u3081\u306B\u623B\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3057\u305F\u3002
539 SerialOldRuleFactory_TEXT_WARN_G1_LONG=JVM\u3067G1\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30BF\u304C\u4F7F\u7528\u3055\u308C\u307E\u3057\u305F\u304C\u3001\u3055\u3089\u306B\u6642\u9593\u3092\u8981\u3059\u308BSerial Old Collection\u306B\u623B\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3057\u305F\u3002\u3053\u308C\u306F\u3001G1\u30B3\u30EC\u30AF\u30BF\u304C\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u4E2D\u306B\u767A\u751F\u3057\u305F\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u5272\u5F53\u3066\u3092\u4FDD\u6301\u3067\u304D\u306A\u304B\u3063\u305F\u305F\u3081\u3067\u3059\u3002\u3053\u306E\u30EA\u30B9\u30AF\u306F\u3001&lt;a href=&quot;http://www.oracle.com/technetwork/articles/java/vmoptions-jsp-140102.html&quot;&gt;-XX:InitiatingHeapOccupancyPercent&lt;/a&gt;\u306E\u5024\u3092\u4F4E\u304F\u3059\u308B\u3053\u3068\u3067\u6291\u5236\u3067\u304D\u307E\u3059\u3002\u3053\u306E&lt;a href=&quot;http://www.oracle.com/technetwork/articles/java/g1gc-1984535.html&quot;&gt;G1\u30C1\u30E5\u30FC\u30CB\u30F3\u30B0\u306E\u8A18\u4E8B&lt;/a&gt;\u304C\u53C2\u8003\u306B\u306A\u308B\u5834\u5408\u304C\u3042\u308A\u307E\u3059\u3002
540 SocketReadRule_CONFIG_INFO_LIMIT=\u30BD\u30B1\u30C3\u30C8\u8AAD\u53D6\u308A\u671F\u9593\u60C5\u5831\u5236\u9650
541 SocketReadRule_CONFIG_INFO_LIMIT_LONG=\u60C5\u5831\u901A\u77E5\u3092\u30C8\u30EA\u30AC\u30FC\u3059\u308B\u5FC5\u8981\u306E\u3042\u308B\u6700\u77ED\u30BD\u30B1\u30C3\u30C8\u8AAD\u53D6\u308A\u671F\u9593
542 SocketReadRule_CONFIG_WARNING_LIMIT=\u30BD\u30B1\u30C3\u30C8\u8AAD\u53D6\u308A\u671F\u9593\u8B66\u544A\u5236\u9650
543 SocketReadRule_CONFIG_WARNING_LIMIT_LONG=\u8B66\u544A\u3092\u30C8\u30EA\u30AC\u30FC\u3059\u308B\u5FC5\u8981\u306E\u3042\u308B\u6700\u77ED\u30BD\u30B1\u30C3\u30C8\u8AAD\u53D6\u308A\u671F\u9593
544 SocketReadRuleFactory_RULE_NAME=\u30BD\u30B1\u30C3\u30C8\u8AAD\u53D6\u308A\u30D4\u30FC\u30AF\u671F\u9593
545 # {0} is a time period
546 SocketReadRuleFactory_TEXT_OK=\u3053\u306E\u8A18\u9332\u5185\u306B\u3001\u9577\u671F\u306E\u30BD\u30B1\u30C3\u30C8\u8AAD\u53D6\u308A\u4E00\u6642\u4F11\u6B62\u306F\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3067\u3057\u305F(\u6700\u9577\u306F{0}\u3067\u3057\u305F)\u3002
547 SocketReadRuleFactory_TEXT_NO_EVENTS=\u3053\u306E\u8A18\u9332\u306B\u306F\u30BD\u30B1\u30C3\u30C8\u8AAD\u53D6\u308A\u30A4\u30D9\u30F3\u30C8\u306F\u3042\u308A\u307E\u305B\u3093\u3002
548 SocketReadRuleFactory_TEXT_RMI_NOTE=\u4E00\u90E8\u306E\u30BD\u30B1\u30C3\u30C8\u8AAD\u53D6\u308A\u30D1\u30BF\u30FC\u30F3\u306F\u3001\u6B63\u5E38\u3068\u60F3\u5B9A\u3055\u308C\u308B\u9577\u671F\u9593\u8AAD\u53D6\u308A\u3092\u793A\u3059\u305F\u3081\u9664\u5916\u3055\u308C\u3066\u3044\u308B\u306E\u3067\u6CE8\u610F\u3057\u3066\u304F\u3060\u3055\u3044\u3002\u3053\u306E\u3088\u3046\u306A\u30D1\u30BF\u30FC\u30F3\u306B\u306FJMX RMI\u901A\u4FE1\u304A\u3088\u3073MQ series\u304C\u542B\u307E\u308C\u307E\u3059\u3002
549 # {0} is a time period
550 SocketReadRuleFactory_TEXT_WARN=\u3053\u306E\u8A18\u9332\u306B\u306F\u3001\u9577\u671F\u306E\u30BD\u30B1\u30C3\u30C8\u8AAD\u53D6\u308A\u4E00\u6642\u4F11\u6B62\u304C\u3042\u308A\u307E\u3059(\u6700\u9577\u306F{0}\u3067\u3059)\u3002
551 # {0} is a time period, {1} is a host name, {2} is a size in bytes
552 SocketReadRuleFactory_TEXT_WARN_LONG=\u8A18\u9332\u3055\u308C\u305F\u6700\u9577\u306E\u30BD\u30B1\u30C3\u30C8\u8AAD\u53D6\u308A\u306F\u3001{1}\u306E\u30DB\u30B9\u30C8\u304B\u3089\u306E{2}\u306E\u8AAD\u53D6\u308A\u306B{0}\u304B\u304B\u308A\u307E\u3057\u305F\u3002
553 SocketWriteRule_CONFIG_INFO_LIMIT=\u30BD\u30B1\u30C3\u30C8\u66F8\u8FBC\u307F\u671F\u9593\u60C5\u5831\u5236\u9650
554 SocketWriteRule_CONFIG_INFO_LIMIT_LONG=\u60C5\u5831\u901A\u77E5\u3092\u30C8\u30EA\u30AC\u30FC\u3059\u308B\u5FC5\u8981\u306E\u3042\u308B\u6700\u77ED\u30BD\u30B1\u30C3\u30C8\u66F8\u8FBC\u307F\u671F\u9593
555 SocketWriteRule_CONFIG_WARNING_LIMIT=\u30BD\u30B1\u30C3\u30C8\u66F8\u8FBC\u307F\u671F\u9593\u8B66\u544A\u5236\u9650
556 SocketWriteRule_CONFIG_WARNING_LIMIT_LONG=\u8B66\u544A\u3092\u30C8\u30EA\u30AC\u30FC\u3059\u308B\u5FC5\u8981\u306E\u3042\u308B\u6700\u77ED\u30BD\u30B1\u30C3\u30C8\u66F8\u8FBC\u307F\u671F\u9593
557 SocketWriteRuleFactory_RULE_NAME=\u30BD\u30B1\u30C3\u30C8\u66F8\u8FBC\u307F\u30D4\u30FC\u30AF\u671F\u9593
558 # {0} is a time period
559 SocketWriteRuleFactory_TEXT_OK=\u3053\u306E\u8A18\u9332\u5185\u306B\u3001\u9577\u671F\u306E\u30BD\u30B1\u30C3\u30C8\u66F8\u8FBC\u307F\u4E00\u6642\u4F11\u6B62\u306F\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3067\u3057\u305F(\u6700\u9577\u306F{0}\u3067\u3057\u305F)\u3002
560 SocketWriteRuleFactory_TEXT_NO_EVENTS=\u3053\u306E\u8A18\u9332\u306B\u306F\u30BD\u30B1\u30C3\u30C8\u66F8\u8FBC\u307F\u30A4\u30D9\u30F3\u30C8\u306F\u3042\u308A\u307E\u305B\u3093\u3002
561 SocketWriteRuleFactory_TEXT_RMI_NOTE=\u4E00\u90E8\u306E\u30BD\u30B1\u30C3\u30C8\u66F8\u8FBC\u307F\u30D1\u30BF\u30FC\u30F3\u306F\u3001\u6B63\u5E38\u3068\u60F3\u5B9A\u3055\u308C\u308B\u9577\u671F\u9593\u66F8\u8FBC\u307F\u3092\u793A\u3059\u305F\u3081\u9664\u5916\u3055\u308C\u3066\u3044\u308B\u306E\u3067\u6CE8\u610F\u3057\u3066\u304F\u3060\u3055\u3044\u3002\u3053\u306E\u3088\u3046\u306A\u30D1\u30BF\u30FC\u30F3\u306B\u306FJMX RMI\u901A\u4FE1\u304C\u542B\u307E\u308C\u307E\u3059\u3002
562 # {0} is a time period
563 SocketWriteRuleFactory_TEXT_WARN=\u3053\u306E\u8A18\u9332\u306B\u306F\u3001\u9577\u671F\u306E\u30BD\u30B1\u30C3\u30C8\u66F8\u8FBC\u307F\u4E00\u6642\u4F11\u6B62\u304C\u3042\u308A\u307E\u3059(\u6700\u9577\u306F{0}\u3067\u3059)\u3002
564 # {0} is a time period, {1} is a host name, {2} is a size in bytes
565 SocketWriteRuleFactory_TEXT_WARN_LONG=\u8A18\u9332\u3055\u308C\u305F\u6700\u9577\u306E\u30BD\u30B1\u30C3\u30C8\u66F8\u8FBC\u307F\u306F\u3001{1}\u306E\u30DB\u30B9\u30C8\u304B\u3089\u306E{2}\u306E\u66F8\u8FBC\u307F\u306B{0}\u304B\u304B\u308A\u307E\u3057\u305F\u3002
566 StackdepthSettingRule_RULE_NAME=Stackdepth\u8A2D\u5B9A
567 StackdepthSettingRule_TEXT_INFO=\u3053\u306E\u8A18\u9332\u3067\u306F\u4E00\u90E8\u306E\u30B9\u30BF\u30C3\u30AF\u30FB\u30C8\u30EC\u30FC\u30B9\u304C\u5207\u308A\u6368\u3066\u3089\u308C\u307E\u3057\u305F\u3002
568 # {0} is a number, {1} is an empty String or StackdepthSettingRule_TEXT_INFO_LONG_DEFAULT, {2} is a percentage, {3} is an HTML list of event type names
569 StackdepthSettingRule_TEXT_INFO_LONG=\u30D5\u30E9\u30A4\u30C8\u30FB\u30EC\u30B3\u30FC\u30C0\u306F\u3001{0}\u306B\u8A2D\u5B9A\u3055\u308C\u305F\u6700\u5927\u30B9\u30BF\u30C3\u30AF\u6DF1\u5EA6\u5024\u3092\u4E0A\u9650\u3068\u3059\u308B\u6DF1\u5EA6\u306E\u30C8\u30EC\u30FC\u30B9\u306E\u307F\u3092\u8A18\u9332\u3057\u307E\u3059\u3002\u3059\u3079\u3066\u306E\u30C8\u30EC\u30FC\u30B9\u306E{1}{2}\u304C\u3053\u306E\u30AA\u30D7\u30B7\u30E7\u30F3\u3092\u8D85\u3048\u305F\u305F\u3081\u3001\u5207\u308A\u6368\u3066\u3089\u308C\u307E\u3057\u305F\u3002\u8A73\u7D30\u306A\u30C8\u30EC\u30FC\u30B9\u304C\u5FC5\u8981\u306A\u5834\u5408\u306F\u3001&#39;&#39;-XX:FlightRecorderOptions=stackdepth=&amp;lt;value&amp;gt;&#39;&#39;\u5024\u3092\u5897\u3084\u3057\u3066\u304F\u3060\u3055\u3044\u3002&lt;p&gt;\u6B21\u306E\u30BF\u30A4\u30D7\u306E\u30A4\u30D9\u30F3\u30C8\u3067\u306F\u30B9\u30BF\u30C3\u30AF\u30FB\u30C8\u30EC\u30FC\u30B9\u304C\u5207\u308A\u6368\u3066\u3089\u308C\u3066\u3044\u307E\u3059:&lt;ul&gt;{3}&lt;/ul&gt;
570 StackdepthSettingRule_TEXT_INFO_LONG_DEFAULT=\u3053\u308C\u304C\u30C7\u30D5\u30A9\u30EB\u30C8\u306E\u6DF1\u5EA6\u3067\u3059\u3002
571 StackdepthSettingRule_TEXT_NA=\u30B9\u30BF\u30C3\u30AF\u30FB\u30C8\u30EC\u30FC\u30B9\u306E\u30A4\u30D9\u30F3\u30C8\u304C\u8A18\u9332\u3055\u308C\u307E\u305B\u3093\u3067\u3057\u305F\u3002
572 StackdepthSettingRule_TEXT_OK=\u3053\u306E\u8A18\u9332\u306B\u306F\u5207\u308A\u6368\u3066\u3089\u308C\u305F\u30B9\u30BF\u30C3\u30AF\u30FB\u30C8\u30EC\u30FC\u30B9\u306F\u3042\u308A\u307E\u305B\u3093\u3002
573 # {0} is an event type name, {1} is a percentage, this is a template that is reused inside &lt;li&gt; tags in the StackdepthSettingRule_TEXT_INFO_LONG {1} parameter
574 StackdepthSettingRule_TYPE_LIST_TEMPLATE={0} ({1}\u306E\u30C8\u30EC\u30FC\u30B9\u3092\u5207\u6368\u3066)
575 
576 StringDeduplicationRule_RULE_NAME=\u6587\u5B57\u5217\u306E\u91CD\u8907
577 StringDeduplicationRule_STRING_ARRAY_ALLOCATION_FRAMES=\u6587\u5B57\u5217\u5185\u90E8\u914D\u5217\u5272\u5F53\u3066\u30D5\u30EC\u30FC\u30E0
578 StringDeduplicationRule_STRING_ARRAY_ALLOCATION_FRAMES_DESC=\u6587\u5B57\u5217\u5185\u90E8\u306E\u6587\u5B57/\u30D0\u30A4\u30C8\u914D\u5217\u304C\u5272\u308A\u5F53\u3066\u3089\u308C\u308B\u30D5\u30EC\u30FC\u30E0\u306E\u30AB\u30F3\u30DE\u533A\u5207\u308A\u306E\u30EA\u30B9\u30C8\u3002
579 StringDeduplicationRule_STRING_ARRAY_LIVESET_RATIO_AND_HEAP_USAGE_LIMIT=\u30D2\u30FC\u30D7\u4F7F\u7528\u91CF\u304A\u3088\u3073\u6587\u5B57\u5217\u5185\u90E8\u914D\u5217\u306E\u30E9\u30A4\u30D6\u30FB\u30BB\u30C3\u30C8\u7387\u60C5\u5831\u5236\u9650
580 StringDeduplicationRule_STRING_ARRAY_LIVESET_RATIO_AND_HEAP_USAGE_LIMIT_DESC=\u30D2\u30FC\u30D7\u4F7F\u7528\u7387\u3001\u304A\u3088\u3073\u5408\u8A08\u30E9\u30A4\u30D6\u30FB\u30BB\u30C3\u30C8\u306B\u5BFE\u3059\u308B\u6587\u5B57\u5217\u5185\u90E8\u306E\u6587\u5B57/\u30D0\u30A4\u30C8\u914D\u5217\u306E\u6BD4\u7387\u304C\u3053\u306E\u5236\u9650\u3092\u8D8A\u3048\u308B\u3068\u3001\u60C5\u5831\u901A\u77E5\u304C\u30C8\u30EA\u30AC\u30FC\u3055\u308C\u307E\u3059\u3002
581 StringDeduplicationRule_STRING_ARRAY_ALLOCATION_RATIO_AND_HEAP_USAGE_LIMIT=\u30D2\u30FC\u30D7\u4F7F\u7528\u91CF\u304A\u3088\u3073\u6587\u5B57\u5217\u5185\u90E8\u914D\u5217\u306E\u5272\u5F53\u3066\u60C5\u5831\u5236\u9650
582 StringDeduplicationRule_STRING_ARRAY_ALLOCATION_RATIO_AND_HEAP_USAGE_LIMIT_DESC=\u30D2\u30FC\u30D7\u4F7F\u7528\u7387\u3001\u304A\u3088\u3073\u5408\u8A08\u5272\u5F53\u3066\u306B\u5BFE\u3059\u308B\u5272\u308A\u5F53\u3066\u3089\u308C\u305F\u6587\u5B57\u5217\u5185\u90E8\u306E\u6587\u5B57/\u30D0\u30A4\u30C8\u914D\u5217\u306E\u6BD4\u7387\u304C\u3053\u306E\u5236\u9650\u3092\u8D8A\u3048\u308B\u3068\u3001\u60C5\u5831\u901A\u77E5\u304C\u30C8\u30EA\u30AC\u30FC\u3055\u308C\u307E\u3059\u3002
583 StringDeduplicationRule_RESULT_USE_STRING_DEDUPLICATION_ENABLED=\u6587\u5B57\u5217\u306E\u91CD\u8907\u306F\u3059\u3067\u306B\u6709\u52B9\u5316\u3055\u308C\u3066\u3044\u307E\u3059\u3002
<a name="1" id="anc1"></a><span class="line-modified">584 StringDeduplicationRule_RESULT_GC_LONG=\u6587\u5B57\u5217\u306E\u91CD\u8907\u304C\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u308B\u306E\u306F\u3001G1\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30BF\u6216\u3044\u306FShenandoah\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30BF\u3092\u4F7F\u7528\u3057\u3066\u3044\u308B\u5834\u5408\u306E\u307F\u3067\u3059\u3002\u3053\u306E\u6A5F\u80FD\u3092\u4F7F\u7528\u3059\u308B\u306B\u306F\u3001&#39;-XX:+UseG1GC&#39;\u3092\u4F7F\u7528\u3057\u3066G1\u3092\u6709\u52B9\u5316\u3057\u3001\u53C8\u306F&#39;-XX:+UseShenandoahGC&#39;\u3068\u306BShenandoah\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30BF\u6709\u52B9\u306B\u3057\u3066\u307E\u3059\u3002</span>

585 StringDeduplicationRule_RESULT_DONT_RECOMMEND_STRING_DEDUPLICATION=\u6587\u5B57\u5217\u306E\u91CD\u8907\u3092\u6709\u52B9\u5316\u3057\u3066\u3082\u5927\u304D\u306A\u30E1\u30EA\u30C3\u30C8\u306F\u3042\u308A\u307E\u305B\u3093\u3002
586 StringDeduplicationRule_RESULT_RECOMMEND_STRING_DEDUPLICATION=\u6587\u5B57\u5217\u306E\u91CD\u8907\u3092\u6709\u52B9\u5316\u3059\u308B\u3068\u3001\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306B\u30E1\u30EA\u30C3\u30C8\u304C\u3042\u308B\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002
587 # {0} is an event type, # {1} is an event type
588 StringDeduplicationRule_RESULT_NO_MAX_HEAP_INFO=\u6700\u5927\u30D2\u30FC\u30D7\u30FB\u30B5\u30A4\u30BA\u306B\u95A2\u3059\u308B\u60C5\u5831\u304C\u3042\u308A\u307E\u305B\u3093\u3002\u3053\u306E\u30EB\u30FC\u30EB\u306E\u7CBE\u5EA6\u3092\u5411\u4E0A\u3059\u308B\u306B\u306F\u3001\u30A4\u30D9\u30F3\u30C8\u30FB\u30BF\u30A4\u30D7{0}\u307E\u305F\u306F{1}\u3092\u6709\u52B9\u5316\u3057\u3066\u304F\u3060\u3055\u3044\u3002
589 StringDeduplicationRule_RESULT_NO_ALLOC_ITEMS=\u6587\u5B57\u5217\u306E\u5185\u90E8\u914D\u5217\u306B\u5272\u5F53\u3066\u30A4\u30D9\u30F3\u30C8\u306F\u3042\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002\u30D5\u30EC\u30FC\u30E0\u30FB\u30D5\u30A3\u30EB\u30BF\u30FB\u30D7\u30EA\u30D5\u30A1\u30EC\u30F3\u30B9\u304C\u6B63\u3057\u304F\u5B9A\u7FA9\u3055\u308C\u3066\u3044\u306A\u3044\u304B\u3001\u5272\u5F53\u3066\u30A4\u30D9\u30F3\u30C8\u3067stackTrace\u5C5E\u6027\u304C\u6709\u52B9\u5316\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002
590 # {0} is a percentage
591 StringDeduplicationRule_RESULT_HEAP_USAGE=\u30D2\u30FC\u30D7\u306E\u7D04{0}%\u304C\u4F7F\u7528\u3055\u308C\u3066\u3044\u307E\u3059\u3002
592 # {0} is a percentage, {1} is either &#39;byte[]&#39; or &#39;char[]&#39;
593 StringDeduplicationRule_RESULT_STRING_ARRAY_LIVESET_RATIO=\u30E9\u30A4\u30D6\u30FB\u30BB\u30C3\u30C8\u306E\u7D04{0}%\u304C\u3001\u6587\u5B57\u5217\u306E\u5185\u90E8\u914D\u5217\u30BF\u30A4\u30D7(\u3053\u306EJDK\u30D0\u30FC\u30B8\u30E7\u30F3\u3067\u306F&#39;&#39;{1}&#39;&#39;)\u3067\u69CB\u6210\u3055\u308C\u3066\u3044\u307E\u3059\u3002
594 # {0} is a percentage, {1} is either &#39;byte[]&#39; or &#39;char[]&#39;
595 StringDeduplicationRule_RESULT_STRING_ARRAY_ALLOCATION_RATIO=\u3059\u3079\u3066\u306E\u5272\u5F53\u3066\u306E\u7D04{0}%\u304C\u3001\u6587\u5B57\u5217\u306E\u5185\u90E8\u914D\u5217(\u3053\u306EJDK\u30D0\u30FC\u30B8\u30E7\u30F3\u3067\u306F&#39;&#39;{1}&#39;&#39;)\u3067\u3057\u305F\u3002
<a name="2" id="anc2"></a><span class="line-modified">596 StringDeduplicationRule_RESULT_LONG_DESCRIPTION=\u6587\u5B57\u5217\u306E\u91CD\u8907\u304C\u3001JVM\u30D5\u30E9\u30B0 &#39;-XX:+UseStringDeduplication&#39; \u3092\u4F7F\u7528\u3057\u3066\u6709\u52B9\u5316\u3055\u308C\u3066\u3044\u307E\u3059\u3002JDK 8u20\u4EE5\u4E0A\u3067\u306F\u3001\u3053\u306E\u30D5\u30E9\u30B0\u3092G1\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30BF\u6216\u3044\u306FShenandoah\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30BF\u3068\u3068\u3082\u306B\u4F7F\u7528\u3067\u304D\u307E\u3059\u3002&lt;p&gt;\u3053\u308C\u306B\u3088\u308A\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306E\u30D1\u30D5\u30A9\u30FC\u30DE\u30F3\u30B9\u304C\u6539\u5584 \u308C\u308B\u304B\u3069\u3046\u304B\u3092\u691C\u8A3C\u3059\u308B\u306B\u306F\u3001\u6587\u5B57\u5217\u306E\u91CD\u8907\u304C\u3042\u308B\u5834\u5408\u3068\u306A\u3044\u5834\u5408\u306E\u4E21\u65B9\u3067\u30D5\u30E9\u30A4\u30C8\u8A18\u9332\u3092\u4F5C\u6210\u3057\u307E\u3059\u3002\u6587\u5B57\u5217\u306E\u91CD\u8907\u3092\u6709\u52B9\u306B\u3057\u3066\u5B9F\u884C\u3059\u308B\u5834\u5408\u3001JDK 8\u3067\u306F &#39;-XX:+PrintStringDeduplicationStatistics&#39; \u3092\u4F7F\u7528\u3057\u3066\u3001JDK 9\u3067\u306F &#39;-Xlog:stringdedup*=debug&#39; \u3092\u4F7F\u7528\u3057\u3066\u7D71\u8A08\u3082\u6709\u52B9\u5316\u3057\u3066\u304F\u3060\u3055\u3044\u3002\u6587\u5B57\u5217\u306E\u91CD\u8907\u304C\u6709\u52B9\u5316\u3055\u308C\u3066\u3044\u308B\u8A18\u9332\u3067\u306E\u30D2\u30FC\u30D7\u30FB\u30E9\u30A4\u30D6\u30FB\u30BB\u30C3\u30C8\u306E\u6E1B\u5C11\u304C\u3001\u6587\u5B57\u5217\u306E\u91CD\u8907\u30E1\u30BF\u30C7\u30FC\u30BF\u8868\u306E\u30B5\u30A4\u30BA\u3088\u308A\u5927\u304D\u3044\u304B\u3069\u3046\u304B\u3092\u78BA\u8A8D\u3057\u307E\u3059\u3002\u30E1\u30BF\u30C7\u30FC\u30BF\u8868\u306E\u30B5\u30A4\u30BA\u306F\u3001\u7D71\u8A08\u306E\u51FA\u529B\u306B&#39;\u8868/\u30E1\u30E2\u30EA\u30FC\u4F7F\u7528\u91CF: XX MB&#39;\u3068\u8868\u793A\u3055\u308C\u307E\u3059&lt;p&gt;\u6587\u5B57\u5217\u306E\u91CD\u8907\u306E\u8A73\u7D30\u306F\u3001Java\u30AA\u30D7\u30B7\u30E7\u30F3\u306E\u30C9\u30AD\u30E5\u30E1\u30F3\u30C8\u3001\u307E\u305F\u306F &lt;a href=&quot;https://openjdk.java.net/jeps/192&quot;&gt;JEP 192&lt;/a&gt; \u3067\u53C2\u7167\u3067\u304D\u307E\u3059\u3002</span>
597 SystemGcRule_CONFIG_WARNING_LIMIT=System.gc()\u7387\u5236\u9650
598 SystemGcRule_CONFIG_WARNING_LIMIT_LONG=System.gc()\u3068\u5408\u8A08\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u9593\u306E\u6BD4\u7387\u306E\u8B66\u544A\u5236\u9650
599 SystemGcRuleFactory_RULE_NAME=System.gc()\u306B\u3088\u3063\u3066\u5F15\u304D\u8D77\u3053\u3055\u308C\u305FGC
600 # {0} is a percentage
601 SystemGcRuleFactory_TEXT_INFO=\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u306E{0}\u304CSystem.gc()\u306B\u3088\u3063\u3066\u5F15\u304D\u8D77\u3053\u3055\u308C\u307E\u3057\u305F\u3002
602 SystemGcRuleFactory_TEXT_INFO_LONG=System.gc()\u3092\u547C\u3073\u51FA\u3059\u3068\u3001\u5FC5\u8981\u4EE5\u4E0A\u306E\u91CF\u306E\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u304C\u5F15\u304D\u8D77\u3053\u3055\u308C\u308B\u3053\u3068\u304C\u3042\u308B\u305F\u3081\u3001\u9069\u5207\u3067\u306A\u3044\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002\u660E\u793A\u7684\u306B\u547C\u3073\u51FA\u3055\u308C\u306A\u304F\u3066\u3082\u3001\u901A\u5E38\u306F\u3001\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30BF\u81EA\u8EAB\u304C\u3053\u308C\u3092\u9069\u5207\u306B\u51E6\u7406\u3057\u307E\u3059\u3002&lt;p&gt;\u3053\u308C\u3092\u4FEE\u6B63\u3059\u308B\u306B\u306F\u3001\u30B3\u30FC\u30C9\u5185\u306E\u4E0D\u8981\u306ASystem.gc()\u547C\u51FA\u3057\u3092\u524A\u9664\u3057\u307E\u3059\u3002\u30BD\u30FC\u30B9\u30FB\u30B3\u30FC\u30C9\u3092\u5909\u66F4\u3067\u304D\u306A\u3044\u30E9\u30A4\u30D6\u30E9\u30EA\u306B\u3088\u3063\u3066\u547C\u3073\u51FA\u3055\u308C\u308B\u5834\u5408\u306F\u3001\u304B\u308F\u308A\u306B\u3001\u30B3\u30DE\u30F3\u30C9\u884C\u30D5\u30E9\u30B0&#39;-XX:+DisableExplicitGC&#39;\u3092\u4F7F\u7528\u3067\u304D\u307E\u3059\u3002\u3053\u306E\u30D5\u30E9\u30B0\u306B\u3088\u308A\u3001JVM\u306F\u3059\u3079\u3066\u306ESystem.gc()\u547C\u51FA\u3057\u3092\u7121\u8996\u3057\u307E\u3059\u3002
603 SystemGcRuleFactory_TEXT_OK=System.gc()\u306B\u3088\u3063\u3066\u5F15\u304D\u8D77\u3053\u3055\u308C\u305F\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u304C\u3042\u308A\u307E\u305B\u3093\u3002
604 TlabAllocationRatioRuleFactory_RULE_NAME=TLAB\u5272\u5F53\u3066\u7387
605 # {0} is a percentage
606 TlabAllocationRatioRuleFactory_TEXT_INFO=\u30D7\u30ED\u30B0\u30E9\u30E0\u306F\u30E1\u30E2\u30EA\u30FC\u306E{0}\u3092TLAB\u5916\u306B\u5272\u308A\u5F53\u3066\u307E\u3057\u305F\u3002
607 TlabAllocationRatioRuleFactory_TEXT_RECOMMEND_LESS_ALLOCATION=\u30B9\u30EC\u30C3\u30C9\u30FB\u30ED\u30FC\u30AB\u30EB\u5272\u5F53\u3066\u30D0\u30C3\u30D5\u30A1(TLAB)\u5916\u3078\u306E\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306E\u5272\u5F53\u3066\u306F\u3001TLAB\u5185\u306E\u5272\u5F53\u3066\u3088\u308A\u3082\u8CA0\u8377\u304C\u304B\u304B\u308A\u307E\u3059\u3002\u3053\u308C\u306F\u3001\u500B\u5225\u306E\u5272\u5F53\u3066\u304C\u59A5\u5F53\u306ATLAB\u3092\u4E0A\u56DE\u308B\u3053\u3068\u304C\u610F\u56F3\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u306F\u8A31\u5BB9\u3067\u304D\u307E\u3059\u3002\u500B\u5225\u306E\u5272\u5F53\u3066\u30B5\u30A4\u30BA\u3092\u6E1B\u3089\u3059\u3053\u3068\u3067\u3001\u3053\u308C\u3092\u56DE\u907F\u3067\u304D\u308B\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002TLAB\u95A2\u9023\u306E\u3044\u304F\u3064\u304B\u306EJVM\u30D5\u30E9\u30B0\u3067\u8A66\u884C\u3059\u308B\u3053\u3068\u3082\u3067\u304D\u307E\u3059\u304C\u3001\u901A\u5E38\u306F\u3001JVM\u3067TLAB\u30B5\u30A4\u30BA\u3092\u81EA\u52D5\u7684\u306B\u7BA1\u7406\u3059\u308B\u3053\u3068\u3092\u304A\u85A6\u3081\u3057\u307E\u3059\u3002
608 TlabAllocationRatioRuleFactory_TEXT_INFO_ONLY_OUTSIDE=\u30D7\u30ED\u30B0\u30E9\u30E0\u306B\u3088\u308A\u3001TLAB\u5916\u306E\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306E\u307F\u304C\u5272\u308A\u5F53\u3066\u3089\u308C\u307E\u3057\u305F\u3002
609 TlabAllocationRatioRuleFactory_TEXT_INFO_ONLY_OUTSIDE_LONG=\u30D7\u30ED\u30B0\u30E9\u30E0\u306B\u3088\u308A\u3001\u30B9\u30EC\u30C3\u30C9\u30FB\u30ED\u30FC\u30AB\u30EB\u5272\u5F53\u3066\u30D0\u30C3\u30D5\u30A1(TLAB)\u5916\u306E\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306E\u307F\u304C\u5272\u308A\u5F53\u3066\u3089\u308C\u307E\u3057\u305F\u3002
610 TlabAllocationRatioRuleFactory_TEXT_OK_NO_OUTSIDE=TLAB\u5916\u306E\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306E\u5272\u5F53\u3066\u306F\u691C\u51FA\u3055\u308C\u307E\u305B\u3093\u3067\u3057\u305F\u3002
611 UnlockExperimentalVMOptionsRuleFactory_TEXT_INFO=\u5B9F\u9A13\u7684VM\u30AA\u30D7\u30B7\u30E7\u30F3\u304C\u6709\u52B9\u5316\u3055\u308C\u3066\u3044\u308BJVM\u3067\u8A18\u9332\u304C\u5B9F\u884C\u3055\u308C\u307E\u3057\u305F\u3002
612 UnlockExperimentalVMOptionsRuleFactory_TEXT_INFO_LONG=\u5B9F\u9A13\u7684VM\u30AA\u30D7\u30B7\u30E7\u30F3\u306E\u30B5\u30DD\u30FC\u30C8\u306F\u5B8C\u5168\u3067\u306F\u306A\u3044\u3053\u3068\u304B\u3089\u4FE1\u983C\u6027\u306B\u6B20\u3051\u308B\u53EF\u80FD\u6027\u304C\u3042\u308B\u305F\u3081\u3001\u672C\u756A\u74B0\u5883\u3067\u306F\u4F7F\u7528\u3057\u306A\u3044\u3067\u304F\u3060\u3055\u3044\u3002\u5B9F\u9A13\u7684\u30AA\u30D7\u30B7\u30E7\u30F3\u3092\u4F7F\u7528\u3059\u308B\u5FC5\u8981\u304C\u306A\u3044\u5834\u5408\u306F\u3001&#39;-XX:+UnlockExperimentalVMOptions&#39;\u30B3\u30DE\u30F3\u30C9\u884C\u30AA\u30D7\u30B7\u30E7\u30F3\u3092\u4F7F\u7528\u3057\u306A\u3044\u3067\u304F\u3060\u3055\u3044\u3002
613 VMOperations_RULE_NAME=VMOperation\u30D4\u30FC\u30AF\u671F\u9593
614 VMOperationRule_CONFIG_WARNING_LIMIT=\u30D6\u30ED\u30C3\u30AF\u3057\u3066\u3044\u308BVM\u64CD\u4F5C\u671F\u9593\u8B66\u544A\u5236\u9650
615 VMOperationRule_CONFIG_WARNING_LIMIT_LONG=\u8B66\u544A\u306E\u30C8\u30EA\u30AC\u30FC\u306B\u5FC5\u8981\u3068\u3055\u308C\u308B\u3001\u30D6\u30ED\u30C3\u30AF\u3057\u3066\u3044\u308BVM\u64CD\u4F5C\u306E\u6700\u5C0F\u671F\u9593
616 # {0} is a time period
617 VMOperationRuleFactory_TEXT_OK=\u904E\u5EA6\u306B\u9577\u671F\u306EVM\u64CD\u4F5C\u306F\u3053\u306E\u8A18\u9332\u5185\u3067\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3067\u3057\u305F(\u6700\u9577\u306F{0}\u3067\u3057\u305F)\u3002
618 # {0} is a time period
619 VMOperationRuleFactory_TEXT_WARN=\u9577\u671F\u306B\u7D99\u7D9A\u3057\u3066\u30D6\u30ED\u30C3\u30AF\u3057\u3066\u3044\u308BVM\u64CD\u4F5C\u304C\u8A18\u9332\u5185\u306B\u3042\u308A\u307E\u3059(\u6700\u9577\u306F{0}\u3067\u3057\u305F)\u3002
620 # {0} is a time period, {1} is a time stamp, {2} is a thread name, {3} is a time stamp
621 VMOperationRuleFactory_TEXT_WARN_LONG=\u9577\u671F\u306B\u7D99\u7D9A\u3057\u3066\u30D6\u30ED\u30C3\u30AF\u3057\u3066\u3044\u308BVM\u64CD\u4F5C\u304C\u8A18\u9332\u5185\u306B\u3042\u308A\u307E\u3059\u3002\u6700\u9577\u306E\u3082\u306E\u306F\u30BF\u30A4\u30D7{1}\u3067\u3001{0}\u306E\u9593\u7D9A\u304D\u307E\u3057\u305F\u3002\u3053\u308C\u306F\u30B9\u30EC\u30C3\u30C9&#39;&#39;{2}&#39;&#39;\u304B\u3089\u958B\u59CB\u3057\u3066\u3001{3}\u3067\u767A\u751F\u3057\u307E\u3057\u305F\u3002&lt;p&gt;VM\u64CD\u4F5C\u306FJVM\u5185\u90E8\u64CD\u4F5C\u3067\u3059\u3002\u540C\u671F\u7684\u306B\u5B9F\u884C\u3055\u308C\u308B(\u3064\u307E\u308A\u3001\u547C\u51FA\u3057\u4E2D\u30B9\u30EC\u30C3\u30C9\u3092\u30D6\u30ED\u30C3\u30AF\u3059\u308B)VM\u64CD\u4F5C\u3082\u3042\u308C\u3070\u3001\u3044\u308F\u3086\u308B\u30BB\u30FC\u30D5\u30DD\u30A4\u30F3\u30C8\u3067\u5B9F\u884C\u3055\u308C\u308B\u3053\u3068\u304C\u5FC5\u8981\u306A\u64CD\u4F5C\u3082\u3042\u308A\u307E\u3059\u3002\u30BB\u30FC\u30D5\u30DD\u30A4\u30F3\u30C8\u30FB\u30DD\u30FC\u30EA\u30F3\u30B0\u306F\u9023\u52D5\u7684\u306A\u4E00\u6642\u505C\u6B62\u30E1\u30AB\u30CB\u30BA\u30E0\u3067\u3001JVM\u3067\u306E\u30D0\u30A4\u30C8\u30FB\u30B3\u30FC\u30C9\u5B9F\u884C\u3092\u4E2D\u65AD\u3057\u307E\u3059\u3002\u30BB\u30FC\u30D5\u30DD\u30A4\u30F3\u30C8\u3067\u884C\u308F\u308C\u308BVM\u64CD\u4F5C\u306F\u52B9\u7387\u7684\u306B\u4E8B\u614B\u3092\u505C\u6B62\u3057\u307E\u3059\u3002\u3064\u307E\u308A\u3001\u305D\u306E\u30BB\u30FC\u30D5\u30DD\u30A4\u30F3\u30C8\u3067VM\u64CD\u4F5C\u3092\u5B9F\u884C\u3057\u3066\u3044\u308B\u9593\u306F\u3001\u3069\u306E\u30B9\u30EC\u30C3\u30C9\u3067\u3082Java\u30B3\u30FC\u30C9\u304C\u5B9F\u884C\u3055\u308C\u307E\u305B\u3093\u3002\u30BB\u30FC\u30D5\u30DD\u30A4\u30F3\u30C8\u3067\u5B9F\u884C\u4E2D\u306E\u9577\u671F\u306B\u7D99\u7D9A\u7684\u306AVM\u64CD\u4F5C\u306F\u3001\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306E\u5FDC\u7B54\u6027\u3092\u4F4E\u4E0B\u3055\u305B\u308B\u5834\u5408\u304C\u3042\u308A\u307E\u3059\u3002&lt;p&gt;\u3053\u306E\u3088\u3046\u306AVM\u64CD\u4F5C\u304C\u898B\u3064\u304B\u3063\u305F\u5834\u5408\u3001\u64CD\u4F5C\u306E\u30BF\u30A4\u30D7\u3068\u3001\u305D\u306E\u547C\u51FA\u3057\u5143\u30B9\u30EC\u30C3\u30C9\u306F\u3001\u305D\u306EVM\u64CD\u4F5C\u304C\u767A\u751F\u3057\u305F\u7406\u7531\u3092\u7406\u89E3\u3059\u308B\u305F\u3081\u306E\u91CD\u8981\u306A\u60C5\u5831\u6E90\u3068\u306A\u308A\u307E\u3059\u3002\u3088\u308A\u8A73\u3057\u3044\u60C5\u5831\u3092\u5F97\u308B\u306B\u306F\u3001\u6642\u9593\u7684\u306B\u3053\u306E\u30A4\u30D9\u30F3\u30C8\u306B\u4EA4\u5DEE\u3057\u3066\u3044\u308B\u547C\u51FA\u3057\u5143\u30B9\u30EC\u30C3\u30C9\u306B\u30A4\u30D9\u30F3\u30C8\u304C\u3042\u308B\u304B\u3069\u3046\u304B\u3092\u78BA\u8A8D\u3057\u307E\u3059\u3002\u305D\u306E\u3088\u3046\u306A\u30A4\u30D9\u30F3\u30C8\u306E\u30B9\u30BF\u30C3\u30AF\u30FB\u30C8\u30EC\u30FC\u30B9\u3092\u53C2\u7167\u3059\u308B\u3068\u3001\u539F\u56E0\u306E\u7279\u5B9A\u306B\u5F79\u7ACB\u3061\u307E\u3059\u3002&lt;/p&gt;&lt;p&gt;\u8A73\u7D30\u306F\u3001&lt;a href=&quot;http://openjdk.java.net/groups/hotspot/docs/RuntimeOverview.html&quot;&gt;\u30E9\u30F3\u30BF\u30A4\u30E0\u6982\u8981&lt;/a&gt;\u3092\u53C2\u7167\u3057\u3066\u304F\u3060\u3055\u3044\u3002&lt;/p&gt;
622 
<a name="3" id="anc3"></a><b style="font-size: large; color: red">--- EOF ---</b>
















































































</pre>
<input id="eof" value="3" type="hidden" />
</body>
</html>