<!DOCTYPE html>
<html>
  <head>
    <meta charset="utf-8" />
    <title>New core/org.openjdk.jmc.flightrecorder.rules.jdk/src/main/resources/org/openjdk/jmc/flightrecorder/rules/jdk/messages/internal/messages_zh_CN.properties</title>
    <link rel="stylesheet" href="../../../../../../../../../../../../../style.css" />
  </head>
  <body>
    <pre>
  1 #
  2 #  Copyright (c) 2018, 2019, Oracle and/or its affiliates. All rights reserved.
  3 #
  4 #  DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS FILE HEADER.
  5 #
  6 #  The contents of this file are subject to the terms of either the Universal Permissive License 
  7 #  v 1.0 as shown at http://oss.oracle.com/licenses/upl
  8 #   
  9 #  or the following license:
 10 #   
 11 #  Redistribution and use in source and binary forms, with or without modification, are permitted
 12 #  provided that the following conditions are met:
 13 #   
 14 #  1. Redistributions of source code must retain the above copyright notice, this list of conditions
 15 #  and the following disclaimer.
 16 #   
 17 #  2. Redistributions in binary form must reproduce the above copyright notice, this list of
 18 #  conditions and the following disclaimer in the documentation and/or other materials provided with
 19 #  the distribution.
 20 #   
 21 #  3. Neither the name of the copyright holder nor the names of its contributors may be used to
 22 #  endorse or promote products derived from this software without specific prior written permission.
 23 #
 24 #  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS &quot;AS IS&quot; AND ANY EXPRESS OR
 25 #  IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND
 26 #  FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR
 27 #  CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 28 #  DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
 29 #  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 30 #  WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY
 31 #  WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 32 #
 33 Preference_SHORT_RECORDING=\u77ED\u8BB0\u5F55\u9650\u5236
 34 Preference_SHORT_RECORDING_LONG=\u89C6\u4E3A\u5BF9\u89C4\u5219\u8FDB\u884C\u5904\u7406\u6709\u7528\u7684\u8BB0\u5F55\u7684\u6700\u5C0F\u957F\u5EA6\u3002
 35 
 36 AllocationByClassRule_RULE_NAME=\u5206\u914D\u7684\u7C7B
 37 # {0} is a class name
 38 AllocationByClassRule_TEXT_MESSAGE=\u5206\u914D\u6700\u591A\u7684\u7C7B\u53EF\u80FD\u662F &#39;&#39;{0}&#39;&#39;\u3002\u8FD9\u662F\u8BE5\u7C7B\u7684\u6700\u5E38\u7528\u5206\u914D\u8DEF\u5F84\uFF1A{1}
 39 AllocationByThreadRule_RULE_NAME=\u6267\u884C\u5206\u914D\u7684\u7EBF\u7A0B
 40 # {0} is a thread name
 41 AllocationByThreadRule_TEXT_MESSAGE=\u6267\u884C\u6700\u591A\u5206\u914D\u7684\u7EBF\u7A0B\u53EF\u80FD\u662F &#39;&#39;{0}&#39;&#39;\u3002\u8FD9\u662F\u8BE5\u7C7B\u7684\u6700\u5E38\u7528\u5206\u914D\u8DEF\u5F84\uFF1A{1}
 42 AllocationRuleFactory_TEXT_CLASS_INFO_LONG=\u5C1D\u8BD5\u51CF\u5C11\u5783\u573E\u6536\u96C6\u65F6\uFF0C\u9891\u7E41\u5206\u914D\u7684\u7C7B\u53EF\u80FD\u662F\u4E00\u4E2A\u6BD4\u8F83\u597D\u7684\u5165\u624B\u70B9\u3002\u8BF7\u67E5\u770B\u6700\u5E38\u5206\u914D\u7684\u7C7B\u7684\u805A\u96C6\u5806\u6808\u8DDF\u8E2A\uFF0C\u786E\u5B9A\u540C\u4E00\u4E2A\u8C03\u7528\u8DEF\u5F84\u662F\u5426\u521B\u5EFA\u4E86\u591A\u4E2A\u5B9E\u4F8B\u3002\u8BF7\u5C1D\u8BD5\u901A\u8FC7\u8C03\u7528\u6700\u5E38\u91C7\u7528\u7684\u8DEF\u5F84\uFF0C\u6765\u51CF\u5C11\u521B\u5EFA\u7684\u5B9E\u4F8B\u6570\u3002
 43 AllocationRuleFactory_TEXT_THREAD_INFO_LONG=\u540C\u4E00\u4E2A\u7EBF\u7A0B\u6267\u884C\u7684\u591A\u4E2A\u5206\u914D\u53EF\u80FD\u8868\u660E\u591A\u7EBF\u7A0B\u7A0B\u5E8F\u4E2D\u5B58\u5728\u95EE\u9898\u3002\u67E5\u770B\u805A\u96C6\u5806\u6808\u8DDF\u8E2A\u4EE5\u4E86\u89E3\u5177\u6709\u6700\u9AD8\u5206\u914D\u6BD4\u7387\u7684\u7EBF\u7A0B\u3002\u67E5\u770B\u662F\u5426\u53EF\u51CF\u5C11\u5206\u914D\u6BD4\u7387, \u6216\u8005\u5728\u6D3B\u52A8\u7EBF\u7A0B\u4E4B\u95F4\u8FDB\u884C\u5E73\u8861\u3002
 44 ApplicationHaltsRule_HALTS_INFO_LIMIT=\u5E94\u7528\u7A0B\u5E8F\u4E2D\u65AD\u4FE1\u606F\u9650\u5236
 45 ApplicationHaltsRule_HALTS_INFO_LIMIT_DESC=\u89E6\u53D1\u4FE1\u606F\u901A\u77E5\u6240\u9700\u7684\u65F6\u95F4\u7A97\u53E3\u5185\u5E94\u7528\u7A0B\u5E8F\u4E2D\u65AD\u4E0E\u6267\u884C\u65F6\u95F4\u4E4B\u95F4\u7684\u6BD4\u7387
 46 ApplicationHaltsRule_HALTS_WARNING_LIMIT=\u5E94\u7528\u7A0B\u5E8F\u4E2D\u65AD\u8B66\u544A\u9650\u5236
 47 ApplicationHaltsRule_HALTS_WARNING_LIMIT_DESC=\u89E6\u53D1\u8B66\u544A\u6240\u9700\u7684\u65F6\u95F4\u7A97\u53E3\u5185\u5E94\u7528\u7A0B\u5E8F\u4E2D\u65AD\u4E0E\u6267\u884C\u65F6\u95F4\u4E4B\u95F4\u7684\u6BD4\u7387
 48 ApplicationHaltsRule_HALTS_WINDOW_SIZE=\u5E94\u7528\u7A0B\u5E8F\u4E2D\u65AD\u65F6\u95F4\u7A97\u53E3\u5927\u5C0F
 49 ApplicationHaltsRule_HALTS_WINDOW_SIZE_DESC=\u8BC4\u4F30\u89C4\u5219\u65F6\u4F7F\u7528\u7684\u65F6\u95F4\u7A97\u53E3\u5927\u5C0F
 50 # {0} is a concatenated string of event type ids
 51 ApplicationHaltsRule_EXTRA_EVENT_TYPES=\u542F\u7528\u4EE5\u4E0B\u4E8B\u4EF6\u7C7B\u578B\u5C06\u63D0\u9AD8\u6B64\u89C4\u5219\u7684\u7CBE\u5EA6\uFF1A{0}\u3002
 52 ApplicationHaltsRule_RULE_NAME=\u5E94\u7528\u7A0B\u5E8F\u4E2D\u65AD
 53 ApplicationHaltsRule_RULE_TEXT=\u4E2D\u65AD\u5F71\u54CD\u4E86\u5E94\u7528\u7A0B\u5E8F\u6548\u7387\u3002
 54 # {0} is a percentage, {1} is a timespan, {2} is a timestamp, {3} is a percentage
 55 ApplicationHaltsRule_RULE_TEXT_LONG=\u5728\u4ECE {2} \u5F00\u59CB\u7684 {1} \u671F\u95F4\uFF0C\u5E94\u7528\u7A0B\u5E8F\u4E2D\u65AD\u4E0E\u6267\u884C\u65F6\u95F4\u4E4B\u95F4\u7684\u6700\u9AD8\u6BD4\u7387\u4E3A {0}%\u3002\u8BE5\u65F6\u95F4\u8303\u56F4\u5185 {3}% \u7684\u4E2D\u65AD\u662F\u7531\u4E8E GC \u4E4B\u5916\u7684\u5176\u4ED6\u539F\u56E0\u3002&lt;p&gt;\u6574\u4E2A\u8BB0\u5F55\u8FC7\u7A0B\u4E2D\u7684\u603B\u4E2D\u65AD\u6BD4\u7387\u4E3A {4}%\u3002\u4E2D\u65AD\u603B\u6570\u4E2D\u7684 {5}% \u662F\u7531\u4E8E GC \u4E4B\u5916\u7684\u5176\u4ED6\u539F\u56E0\u3002
 56 ApplicationHaltsRule_RULE_TEXT_RECOMMENDATION=\u5E94\u7528\u7A0B\u5E8F\u4E2D\u65AD\u901A\u5E38\u7531\u5783\u573E\u6536\u96C6\u5BFC\u81F4\uFF0C\u4F46\u662F\u4E5F\u53EF\u80FD\u662F\u7531\u8FC7\u91CF\u7EBF\u7A0B\u8F6C\u50A8\u6216\u5806\u8F6C\u50A8\u7B49\u5BFC\u81F4\u7684\u3002\u8BF7\u8C03\u67E5 VM \u64CD\u4F5C\u4FE1\u606F\u4EE5\u53CA\u53EF\u80FD\u7684\u5B89\u5168\u70B9\u7279\u5B9A\u4FE1\u606F\u3002
 57 ApplicationHaltsRule_RULE_TEXT_OK=\u4E2D\u65AD\u672A\u663E\u8457\u5F71\u54CD\u5E94\u7528\u7A0B\u5E8F\u6548\u7387\u3002
 58 
 59 AutoboxingRule_RULE_NAME=\u57FA\u5143\u5230\u5BF9\u8C61\u8F6C\u6362
 60 AutoboxingRule_AUTOBOXING_RATIO_INFO_LIMIT=\u57FA\u5143\u5230\u5BF9\u8C61\u8F6C\u6362\u5206\u914D\u6BD4\u7387\u4FE1\u606F\u9650\u5236
 61 AutoboxingRule_AUTOBOXING_RATIO_INFO_LIMIT_DESC=\u89E6\u53D1\u4FE1\u606F\u901A\u77E5\u6240\u9700\u7684\u57FA\u5143\u5230\u5BF9\u8C61\u8F6C\u6362\u5BFC\u81F4\u7684\u5206\u914D\u4E0E\u603B\u5206\u914D\u4E4B\u95F4\u7684\u6BD4\u7387\u3002
 62 AutoboxingRule_AUTOBOXING_RATIO_WARNING_LIMIT=\u57FA\u5143\u5230\u5BF9\u8C61\u8F6C\u6362\u5206\u914D\u6BD4\u7387\u8B66\u544A\u9650\u5236
 63 AutoboxingRule_AUTOBOXING_RATIO_WARNING_LIMIT_DESC=\u89E6\u53D1\u8B66\u544A\u6240\u9700\u7684\u57FA\u5143\u5230\u5BF9\u8C61\u8F6C\u6362\u5BFC\u81F4\u7684\u5206\u914D\u4E0E\u603B\u5206\u914D\u4E4B\u95F4\u7684\u6BD4\u7387\u3002
 64 AutoboxingRule_RESULT_NO_AUTOBOXING=\u4ECE\u57FA\u5143\u7C7B\u578B\u5230\u76F8\u5E94\u5BF9\u8C61\u7C7B\u578B\u7684\u8F6C\u6362\u672A\u5BFC\u81F4\u4EFB\u4F55\u5206\u914D\u3002
 65 # {0} is a type name
 66 AutoboxingRule_RESULT_MOST_AUTOBOXED_TYPE=\u57FA\u5143\u8F6C\u6362\u5230\u7684\u6700\u5E38\u89C1\u5BF9\u8C61\u7C7B\u578B\u4E3A &#39;&#39;{0}&#39;&#39;\u3002
 67 # {0} is a type name, {1} is a size in bytes, {2} is a method reference string
 68 AutoboxingRule_RESULT_MOST_AUTOBOXED_TYPE_LONG=\u57FA\u5143\u8F6C\u6362\u5230\u7684\u6700\u5E38\u89C1\u5BF9\u8C61\u7C7B\u578B\u4E3A &#39;&#39;{0}&#39;&#39;\uFF0C\u8FD9\u5C06\u5BFC\u81F4\u5206\u914D {1}\u3002\u6700\u5E38\u89C1\u8C03\u7528\u70B9\u4E3A &#39;&#39;{2}&#39;&#39;\u3002
 69 AutoboxingRule_RESULT_AUTOBOXING_RATIO={0}% \u7684\u603B\u5206\u914D ({1}) \u7531\u4ECE\u57FA\u5143\u7C7B\u578B\u5230\u5BF9\u8C61\u7C7B\u578B\u7684\u8F6C\u6362\u5BFC\u81F4\u3002
 70 AutoboxingRule_RESULT_LONG=\u4ECE\u57FA\u5143\u5230\u76F8\u5E94\u5BF9\u8C61\u7C7B\u578B\u7684\u8F6C\u6362\u65E2\u53EF\u4EE5\u663E\u5F0F\u6267\u884C\uFF0C\u4E5F\u53EF\u4EE5\u7531\u81EA\u52A8\u88C5\u7BB1\u5BFC\u81F4\u3002\u5982\u679C\u603B\u5206\u914D\u4E2D\u76F8\u5F53\u6570\u91CF\u7684\u5206\u914D\u7531\u6B64\u7C7B\u8F6C\u6362\u5BFC\u81F4\uFF0C\u8BF7\u8003\u8651\u66F4\u6539\u5E94\u7528\u7A0B\u5E8F\u6E90\u4EE3\u7801\u4EE5\u907F\u514D\u6B64\u884C\u4E3A\u3002\u67E5\u770B\u5206\u914D\u5806\u6808\u8DDF\u8E2A\u4EE5\u4E86\u89E3\u8981\u66F4\u6539\u7684\u4EE3\u7801\u90E8\u5206\u3002\u6B64\u89C4\u5219\u4E3A\u5177\u6709\u57FA\u5143\u5BF9\u5E94\u9879\u7684\u516B\u79CD\u5BF9\u8C61\u7C7B\u578B\u4E2D\u7684\u4EFB\u4F55\u5BF9\u8C61\u7C7B\u578B\u67E5\u627E\u5BF9 valueOf \u65B9\u6CD5\u7684\u8C03\u7528\u3002
 71 BiasedLockingRevocationRule_CONFIG_FILTERED_CLASSES=\u7B5B\u9009\u7684\u7C7B
 72 BiasedLockingRevocationRule_CONFIG_FILTERED_CLASSES_LONG=\u5C06\u4E0D\u62A5\u544A\u7684\u7C7B\u540D\u7684\u9017\u53F7\u5206\u9694\u5217\u8868
 73 BiasedLockingRevocationRule_CONFIG_WARNING_LIMIT=\u64A4\u6D88\u8B66\u544A\u9650\u5236
 74 BiasedLockingRevocationRule_CONFIG_WARNING_LIMIT_LONG=\u542F\u52A8\u8B66\u544A\u65F6\u7684\u64A4\u6D88\u6570
 75 BiasedLockingRevocationRule_NAME=\u5DF2\u504F\u7F6E\u9501\u5B9A\u64A4\u9500
 76 BiasedLockingRevocationRule_TEXT_OK=\u672A\u7981\u6B62\u4EFB\u4F55\u7C7B\u53C2\u4E0E\u504F\u7F6E\u9501\u5B9A
 77 BiasedLockingRevocationRule_TEXT_REVOKED_CLASSES_FOUND=\u627E\u5230\u5B8C\u5168\u64A4\u6D88\u7684\u7C7B\u3002
 78 BiasedLockingRevocationRule_TEXT_REVOKED_CLASSES_FOUND_LONG=\u5DF2\u7981\u6B62\u4EE5\u4E0B\u7C7B\u4F7F\u7528\u504F\u7F6E\u9501\u5B9A\uFF1A
 79 BiasedLockingRevocationRule_TEXT_REVOKE_LIMIT_CLASSES_FOUND=\u64A4\u6D88\u7C7B\u5B9E\u4F8B\u7684\u6B21\u6570\u8D85\u8FC7\u7528\u6237\u914D\u7F6E\u7684\u9650\u5236\u3002
 80 # {0} is the user configured revocation limit
 81 BiasedLockingRevocationRule_TEXT_REVOKE_LIMIT_CLASSES_FOUND_LONG=\u8C03\u7528\u4EE5\u4E0B\u7C7B\u5B9E\u4F8B\u7684\u6B21\u6570\u8D85\u8FC7\u7528\u6237\u4E3A\u6B64\u89C4\u5219\u914D\u7F6E\u7684\u9650\u5236\uFF08\u9650\u5236={0}\uFF0C\u4E0D\u5305\u62EC\u7981\u7528\u7684\u7C7B\uFF09\uFF1A
 82 # {0} is the classes that were filtered out from the result.
 83 BiasedLockingRevocationRule_TEXT_EPILOGUE=&lt;p&gt;\u504F\u7F6E\u9501\u5B9A\u662F JVM \u4F7F\u7528\u7684\u4E00\u79CD\u6280\u672F\uFF0C\u7528\u4E8E\u964D\u4F4E\u65E0\u4E89\u7528\u9501\u5B9A\u7684\u6210\u672C\u4EE5\u63A5\u8FD1\u65E0\u9501\u5B9A\u6027\u80FD\u3002\u7EBF\u7A0B\u53EF\u4EE5\u5C06\u9501\u5BF9\u8C61\u504F\u7F6E\u5230\u81EA\u8EAB\uFF0C\u4F7F\u540C\u4E00\u7EBF\u7A0B\u7684\u540E\u7EED\u9501\u5B9A\u6210\u672C\u975E\u5E38\u4F4E\u3002\u5982\u679C\u9501\u5F00\u59CB\u7531\u5176\u4ED6\u7EBF\u7A0B\u4F7F\u7528\uFF0C\u5219\u504F\u7F6E\u53EF\u4EE5\u64A4\u6D88\uFF0C\u91CD\u65B0\u504F\u7F6E\u5230\u53E6\u4E00\u7EBF\u7A0B\uFF0C\u4E5F\u53EF\u4EE5\u5728 JVM \u7684\u5176\u4F59\u8FD0\u884C\u65F6\u518D\u6B21\u4ECE\u504F\u7F6E\u64A4\u6D88\u3002&lt;/p&gt;&lt;p&gt;\u5177\u6709\u8BB8\u591A\u5DF2\u64A4\u6D88\u7684\u7C7B\u4E0D\u4E00\u5B9A\u662F\u95EE\u9898\uFF0C\u800C\u662F\u53EF\u4EE5\u4E3A\u4F18\u5316\u3001\u8C03\u6574\u548C\u8BBE\u8BA1\u6539\u8FDB\u63D0\u4F9B\u673A\u4F1A\u3002\u4F8B\u5982\uFF0C\u5982\u679C\u5728\u5E94\u7528\u7A0B\u5E8F\u542F\u52A8\u8FC7\u7A0B\u4E2D\u5B58\u5728\u8BB8\u591A\u4E89\u7528\uFF0C\u5219\u64A4\u6D88\u6210\u672C\u53EF\u80FD\u975E\u5E38\u5927\uFF0C\u60A8\u53EF\u80FD\u9700\u8981\u4F7F\u7528 &#39;&#39;-XX:BiasedLockingStartupDelay=&amp;lt;time in ms&amp;gt;&#39;&#39; \u6807\u8BB0\u5EF6\u8FDF\u504F\u7F6E\u9501\u5B9A\u7684\u542F\u7528\u3002\u5BF9\u4E8E\u4E25\u91CD\u4F9D\u8D56\u4E8E\u4E89\u7528\u9501\u5B9A\u4E14\u65E0\u6CD5\u91CD\u65B0\u8BBE\u8BA1\u7684\u5E94\u7528\u7A0B\u5E8F\uFF0C\u5B8C\u5168\u7981\u7528\u504F\u7F6E\u9501\u5B9A\u53EF\u80FD\u6709\u76CA (&#39;&#39;-XX:-UseBiasedLocking&#39;&#39;)\u3002\u5BF9\u4E8E\u57FA\u51C6\u6D4B\u8BD5\uFF0C\u60A8\u53EF\u80FD\u5E0C\u671B\u5C06 &#39;&#39;-XX:BiasedLockingStartupDelay&#39;&#39; \u8BBE\u7F6E\u4E3A\u96F6\u3002&lt;p&gt;&lt;p&gt;\u5DF2\u7B5B\u9009\u51FA\u4EE5\u4E0B\u7C7B\uFF1A{0}&lt;/p&gt;
 84 BiasedLockingRevocationPauseRule_CONFIG_WARNING_LIMIT=\u5DF2\u504F\u7F6E\u9501\u5B9A\u8B66\u544A\u9650\u5236\u65F6\u95F4
 85 BiasedLockingRevocationPauseRule_CONFIG_WARNING_LIMIT_LONG=\u89E6\u53D1\u8B66\u544A\u6240\u9700\u7684\u64A4\u6D88\u5DF2\u504F\u7F6E\u9501\u5B9A\u6240\u7528\u7684\u603B\u65F6\u95F4
 86 BiasedLockingRevocationPauseRule_RULE_NAME=\u5DF2\u504F\u7F6E\u9501\u5B9A\u64A4\u6D88\u6682\u505C
 87 BiasedLockingRevocationPauseRule_TEXT_INFO_LONG=\u4E3A\u907F\u514D\u6B64\u95EE\u9898\uFF0C\u8BF7\u7981\u7528\u5DF2\u504F\u7F6E\u9501\u5B9A (&#39;-XX:-UseBiasedLocking&#39;) \u6216\u8005\uFF08\u5982\u679C\u8FD9\u79CD\u60C5\u51B5\u53D1\u751F\u5728\u542F\u52A8\u671F\u95F4\uFF09\u5EF6\u8FDF\u5DF2\u504F\u7F6E\u9501\u5B9A\u7684\u4F7F\u7528 (&#39;-XX:BiasedLockingStartupDelay&#39;)\u3002
 88 # {0} is a time period
 89 BiasedLockingRevocationPauseRule_TEXT_MESSAGE=\u64A4\u6D88\u5DF2\u504F\u7F6E\u9501\u5B9A\u6240\u7528\u7684\u603B\u65F6\u95F4\u4E3A {0}\u3002
 90 BiasedLockingRevocationPauseRule_TEXT_OK=\u672A\u627E\u5230\u4EFB\u4F55\u5DF2\u504F\u7F6E\u9501\u5B9A\u7684\u64A4\u6D88\u3002
 91 BufferLostRuleFactory_CONFIG_WARN_LIMIT=\u7F13\u51B2\u533A\u635F\u5931\u9650\u5236
 92 BufferLostRuleFactory_CONFIG_WARN_LIMIT_LONG=\u89E6\u53D1\u8B66\u544A\u6240\u9700\u7684\u4E22\u5931\u7F13\u51B2\u533A\u4E8B\u4EF6\u6570
 93 BufferLostRuleFactory_RULE_NAME=\u4E22\u5931\u7684\u98DE\u884C\u8BB0\u5F55\u5668\u7F13\u51B2\u533A
 94 BufferLostRuleFactory_RULE_TEXT_OK=\u8BB0\u5F55\u671F\u95F4\u6CA1\u6709\u4E22\u5931\u4EFB\u4F55\u98DE\u884C\u8BB0\u5F55\u5668\u7F13\u51B2\u533A\u3002
 95 # {0} is a number, {1} is a size in bytes
 96 BufferLostRuleFactory_TEXT_INFO=\u4E22\u5931\u4E86\u603B\u5927\u5C0F\u4E3A {1} \u7684 {0} \u4E2A\u98DE\u884C\u8BB0\u5F55\u5668\u4E8B\u4EF6\u7F13\u51B2\u533A\u3002
 97 # {0} is a number, {1} is a size in bytes, {2} is a time stamp
 98 BufferLostRuleFactory_TEXT_INFO_LONG=\u4E22\u5931\u4E86 {0} \u4E2A\u98DE\u884C\u8BB0\u5F55\u5668\u4E8B\u4EF6\u7F13\u51B2\u533A\u3002\u4E22\u5931\u6570\u636E\u7684\u603B\u5927\u5C0F\u4E3A {1}, \u9996\u6B21\u4E22\u5931\u7F13\u51B2\u533A\u53D1\u751F\u4E8E {2}\u3002\u5F53\u98DE\u884C\u8BB0\u5F55\u5668\u4E0A\u5B58\u5728\u5F02\u5E38\u9AD8\u7684\u538B\u529B\u65F6, \u5C06\u5220\u9664\u5177\u6709\u4E8B\u4EF6\u7684\u7F13\u51B2\u533A\u3002\u901A\u8FC7\u51CF\u5C11\u8BB0\u5F55\u7684\u4E8B\u4EF6\u6570\u6765\u907F\u514D\u6B64\u95EE\u9898, \u7279\u522B\u662F\u5BF9\u4E8E\u5177\u6709\u9AD8\u4E8B\u4EF6\u901F\u7387\u548C/\u6216\u5927\u578B\u6709\u6548\u8D1F\u8F7D\u7684\u4E8B\u4EF6\u7C7B\u578B\u3002
 99 ClassLeakingRule_CONFIG_WARNING_LIMIT=\u8B66\u544A\u9650\u5236
100 ClassLeakingRule_CONFIG_WARNING_LIMIT_LONG=\u53D1\u51FA\u8B66\u544A\u6240\u9700\u7684\u7C7B\u52A0\u8F7D\u6570\u3002
101 ClassLeakingRule_NAME=\u7C7B\u6CC4\u6F0F
102 ClassLeakingRule_TEXT_OK=\u65E0\u5177\u6709\u76F8\u540C\u540D\u79F0\u7684\u7C7B\u7684\u52A0\u8F7D\u6B21\u6570\u8D85\u8FC7\u9650\u5236\u3002
103 # {0} is the class, {1} is the number of time it was loaded
104 ClassLeakingRule_TEXT_WARN=\u7C7B\u7684\u52A0\u8F7D\u6B21\u6570\u4E0E\u5378\u8F7D\u6B21\u6570\u4E4B\u95F4\u7684\u5DEE\u5F02\u8D85\u8FC7\u4E86\u7528\u6237\u6307\u5B9A\u7684\u9650\u5236\u3002\u52A0\u8F7D\u6B21\u6570\u6700\u591A\uFF1A{0} ({1})
105 # {0} is the number of classes exceeding the limit
106 ClassLeakingRule_TEXT_WARN_LONG=\u4E00\u4E9B\u7C7B\u5DF2\u52A0\u8F7D\u591A\u6B21\uFF0C\u5E76\u4E14\u67D0\u4E2A\u7C7B\u7684\u52A0\u8F7D\u6B21\u6570\u4E0E\u5378\u8F7D\u6B21\u6570\u4E4B\u95F4\u7684\u5DEE\u5F02\u8D85\u8FC7\u4E86\u7528\u6237\u6307\u5B9A\u7684\u9650\u5236\u3002\u8FD9\u79CD\u60C5\u51B5\u672C\u8EAB\u4E0D\u4E00\u5B9A\u662F\u95EE\u9898\uFF0C\u4F46\u662F\u8BF7\u68C0\u67E5\u4EE5\u786E\u5B9A\u60A8\u662F\u5426\u671F\u671B\u591A\u6B21\u52A0\u8F7D\u8FD9\u4E9B\u7C7B\uFF0C\u4ECE\u800C\u786E\u4FDD\u6CA1\u6709\u7C7B\u52A0\u8F7D\u5668\u6CC4\u6F0F\u3002&lt;p&gt;\u524D {0} \u4E2A\u52A0\u8F7D\u7C7B\uFF1A&lt;/p&gt;
107 ClassLoadingRule_CONFIG_DURATION_LIMIT=\u7C7B\u52A0\u8F7D\u6301\u7EED\u65F6\u95F4\u9650\u5236
108 ClassLoadingRule_CONFIG_DURATION_LIMIT_LONG=\u89E6\u53D1\u8B66\u544A\u6240\u9700\u7684\u6700\u77ED\u7C7B\u52A0\u8F7D\u6301\u7EED\u65F6\u95F4
109 ClassLoadingRule_CONFIG_RATIO_LIMIT=\u7C7B\u52A0\u8F7D\u6BD4\u7387\u9650\u5236
110 ClassLoadingRule_CONFIG_RATIO_LIMIT_LONG=\u7C7B\u52A0\u8F7D\u7528\u65F6\u4E0E\u8BB0\u5F55\u7684\u603B\u6301\u7EED\u65F6\u95F4\u4E4B\u95F4\u7684\u6700\u5C0F\u6BD4\u7387
111 ClassLoadingRuleFactory_RULE_NAME=\u7C7B\u52A0\u8F7D\u538B\u529B
112 ClassLoadingRuleFactory_RULE_TEXT_OK=\u5728\u6B64\u8BB0\u5F55\u671F\u95F4\u6CA1\u6709\u82B1\u8D39\u8FC7\u591A\u65F6\u95F4\u6765\u52A0\u8F7D\u65B0\u7C7B\u3002
113 ClassLoadingRuleFactory_TEXT_INFO=\u5728\u6B64\u8BB0\u5F55\u671F\u95F4\u82B1\u8D39\u4E86 {0} \u52A0\u8F7D {1} \u4E2A\u65B0\u7C7B\u3002
114 ClassLoadingRuleFactory_TEXT_INFO_LONG=\u5728\u6B64\u8BB0\u5F55\u671F\u95F4\u82B1\u8D39\u4E86 {0} \u52A0\u8F7D {1} \u4E2A\u65B0\u7C7B\u3002\u6700\u957F\u7684\u7C7B\u52A0\u8F7D\u4E8B\u4EF6\u82B1\u8D39\u4E86 {2}\u3002&lt;p&gt;\u5982\u679C\u5728\u5E94\u7528\u7A0B\u5E8F\u7684\u542F\u52A8\u9636\u6BB5\u8FDB\u884C\u4E86\u8BB0\u5F55\uFF0C\u5219\u9884\u671F\u4F1A\u6709\u8FD9\u79CD\u60C5\u51B5\u3002\u5982\u679C\u4E0D\u662F\uFF0C\u5219\u6700\u597D\u68C0\u67E5\u4E3A\u4EC0\u4E48\u52A0\u8F7D\u8FD9\u4E9B\u7C7B\u3002
115 CodeCacheRuleFactory_DEFAULT_LONG_DESCRIPTION=\u5982\u679C\u4EE3\u7801\u9AD8\u901F\u7F13\u5B58\u5DF2\u6EE1\uFF0CJVM \u5C06\u505C\u6B62\u7F16\u8BD1\u65B0\u65B9\u6CD5\uFF0C\u8FD9\u610F\u5473\u7740\u60A8\u7684\u4EE3\u7801\u8FD0\u884C\u901F\u5EA6\u5C06\u4F4E\u4E8E\u6240\u9700\u901F\u5EA6\u3002\u8981\u907F\u514D\u6B64\u95EE\u9898\uFF0C\u8BF7\u589E\u52A0\u4EE3\u7801\u9AD8\u901F\u7F13\u5B58\u7684\u5927\u5C0F (&#39;-XX:ReservedCodeCacheSize&#39;) \u6216\u8005\u589E\u52A0\u7F16\u8BD1\u9608\u503C (&#39;-XX:CompileThreshold&#39;)\u3002
116 CodeCacheRuleFactory_JDK8_TEXT_WARN=\u5728\u8BB0\u5F55\u671F\u95F4\uFF0C\u4EE3\u7801\u9AD8\u901F\u7F13\u5B58\u5927\u7EA6 {0} \u7A7A\u95F2\u3002\u8FD9\u53EF\u80FD\u4F1A\u6210\u4E3A\u95EE\u9898\u3002
117 CodeCacheRuleFactory_RULE_NAME=\u4EE3\u7801\u9AD8\u901F\u7F13\u5B58
118 CodeCacheRuleFactory_BLOG_REFERENCE=\u6709\u5173\u4EE3\u7801\u9AD8\u901F\u7F13\u5B58\u7684\u66F4\u8BE6\u7EC6\u8BA8\u8BBA\uFF0C\u8BF7\u53C2\u9605&lt;a href=&quot;https://blogs.oracle.com/poonam/why-do-i-get-message-codecache-is-full-compiler-has-been-disabled&quot;&gt;\u6B64\u535A\u5BA2\u5E16\u5B50&lt;/a&gt;\u3002
119 CodeCacheRuleFactory_SIZE_INFO_LIMIT=\u4EE3\u7801\u9AD8\u901F\u7F13\u5B58\u5360\u7528\u4FE1\u606F\u9650\u5236
120 CodeCacheRuleFactory_SIZE_INFO_LIMIT_DESC=\u5982\u679C\u5360\u7528\u8D85\u8FC7\u4E86\u6B64\u9650\u5236, \u5219\u89C4\u5219\u5C06\u8FD4\u56DE\u4FE1\u606F\u7ED3\u679C
121 CodeCacheRuleFactory_SIZE_WARN_LIMIT=\u4EE3\u7801\u9AD8\u901F\u7F13\u5B58\u5360\u7528\u8B66\u544A\u9650\u5236
122 CodeCacheRuleFactory_SIZE_WARN_LIMIT_DESC=\u5982\u679C\u5360\u7528\u8D85\u8FC7\u4E86\u6B64\u9650\u5236, \u5219\u89C4\u5219\u5C06\u8FD4\u56DE\u8B66\u544A\u7ED3\u679C
123 CodeCacheRuleFactory_TEXT_OK=\u8BB0\u5F55\u4E2D\u672A\u68C0\u6D4B\u5230\u4EE3\u7801\u9AD8\u901F\u7F13\u5B58\u7684\u95EE\u9898\u3002
124 CodeCacheRuleFactory_TEXT_WARN=\u6B64\u8BB0\u5F55\u671F\u95F4\u586B\u5145\u4E86\u4EE3\u7801\u9AD8\u901F\u7F13\u5B58\u3002
125 CodeCacheRuleFactory_TEXT_WARN_LONG=\u5982\u679C\u60A8\u7684\u5E94\u7528\u7A0B\u5E8F\u4E2D\u5177\u6709\u5927\u91CF\u4EE3\u7801\u6216\u8005\u5982\u679C\u4EE3\u7801\u9AD8\u901F\u7F13\u5B58\u592A\u5C0F\uFF0C\u5219\u53EF\u80FD\u4F1A\u53D1\u751F\u8FD9\u79CD\u60C5\u51B5\u3002\u5982\u679C\u4EE3\u7801\u9AD8\u901F\u7F13\u5B58\u5DF2\u6EE1\uFF0CJVM \u5C06\u505C\u6B62\u7F16\u8BD1\u65B0\u65B9\u6CD5\uFF0C\u8FD9\u610F\u5473\u7740\u60A8\u7684\u4EE3\u7801\u8FD0\u884C\u901F\u5EA6\u5C06\u4F4E\u4E8E\u6240\u9700\u901F\u5EA6\u3002\u8BF7\u4F7F\u7528 &#39;-XX:ReservedCodeCacheSize&#39; \u589E\u52A0\u4EE3\u7801\u9AD8\u901F\u7F13\u5B58\u7684\u5927\u5C0F\uFF0C\u4F8B\u5982 &#39;-XX:ReservedCodeCacheSize=128M&#39;\u3002
126 CodeCacheRuleFactory_WARN_LONG_DESCRIPTION=\u8FD9\u5BFC\u81F4\u66F4\u9891\u7E41\u5730\u6E05\u9664\u4EE3\u7801\u9AD8\u901F\u7F13\u5B58, \u5360\u7528\u8D8A\u9AD8\u4F1A\u5BFC\u81F4\u6E05\u9664\u8D8A\u9891\u7E41\u3002
127 CodeCacheRuleFactory_WARN_SEGMENTED_HEAP_SHORT_DESCRIPTION={0} \u4E2A\u4EE3\u7801\u5806\u5728\u8BB0\u5F55\u671F\u95F4\u7684\u5360\u7528\u8D85\u8FC7\u4E86 50%\u3002
128 CodeCacheRuleFactory_WARN_SEGMENTED_HEAPS_SHORT_DESCRIPTION={0} \u4E2A\u4EE3\u7801\u5806\u5728\u8BB0\u5F55\u671F\u95F4\u7684\u5360\u7528\u8D85\u8FC7\u4E86 50%\u3002
129 CompareCpuRule_RULE_NAME=\u4E89\u7528 CPU \u5360\u7528\u7387
130 CompareCpuRule_TEXT_INFO_LONG=\u5982\u679C\u5728\u540C\u4E00\u8BA1\u7B97\u673A\u4E0A\u5B58\u5728\u5176\u4ED6\u8FDB\u7A0B\u4F7F\u7528 CPU \u6216\u5176\u4ED6\u8D44\u6E90\uFF0C\u5219\u53EF\u80FD\u4F1A\u5F71\u54CD\u5E94\u7528\u7A0B\u5E8F\u6027\u80FD\u3002\u8981\u5206\u522B\u8FDB\u884C\u6982\u8981\u5206\u6790\u6216\u8005\u83B7\u5F97\u66F4\u9AD8\u7684\u541E\u5410\u91CF\uFF0C\u8BF7\u5173\u95ED\u8BA1\u7B97\u673A\u4E0A\u8FD0\u884C\u7684\u5176\u4ED6\u8D44\u6E90\u5BC6\u96C6\u578B\u8FDB\u7A0B\u3002
131 CompareCpuRule_TEXT_TOO_FEW_SAMPLES=\u6CA1\u6709\u8DB3\u591F\u7684\u6837\u672C\u53EF\u7528\u4E8E\u8BA1\u7B97\u7ED3\u679C\u3002
132 # {0} is a time period, {1} is a time stamp, {2} is a percentage
133 CompareCpuRule_TEXT_MESSAGE=\u5728\u4ECE {1} \u5F00\u59CB\u7684 {0} \u671F\u95F4, \u5176\u4ED6\u8FDB\u7A0B\u5BFC\u81F4\u7684\u5E73\u5747 CPU \u8D1F\u8F7D\u4E3A {2}\u3002
134 CompareCpuRule_INFO_LIMIT=\u4E89\u7528 CPU \u5360\u7528\u7387\u9650\u5236
135 CompareCpuRule_INFO_LIMIT_LONG=\u89E6\u53D1\u4FE1\u606F\u901A\u77E5\u65F6\u5176\u4ED6\u8FDB\u7A0B\u9700\u4F7F\u7528\u7684 CPU \u91CF
136 CompareCpuRule_WARNING_LIMIT=\u4E89\u7528 CPU \u5360\u7528\u7387\u8B66\u544A\u9650\u5236
137 CompareCpuRule_WARNING_LIMIT_LONG=\u89E6\u53D1\u8B66\u544A\u65F6\u5176\u4ED6\u8FDB\u7A0B\u9700\u4F7F\u7528\u7684 CPU \u91CF
138 CompressedOopsRuleFactory_RULE_NAME=\u538B\u7F29 Oops
139 CompressedOopsRuleFactory_TEXT_INFO=Java \u5806\u5927\u5C0F\u4F4E\u4E8E 32 GB, \u5E76\u4E14\u5DF2\u7981\u7528\u538B\u7F29 Oops\u3002
140 CompressedOopsRuleFactory_TEXT_INFO_LONG=\u5728\u5806\u5927\u5C0F\u4F4E\u4E8E 32 GB \u65F6\uFF0C\u5982\u679C\u4E0D\u4F7F\u7528\u538B\u7F29\u7684\u666E\u901A\u5BF9\u8C61\u6307\u9488\uFF0C\u5219\u4F1A\u6D6A\u8D39\u5185\u5B58\u5E76\u5BFC\u81F4\u4E0D\u5FC5\u8981\u7684\u9AD8\u901F\u7F13\u5B58\u538B\u529B\u3002\u4F7F\u7528 JVM \u53C2\u6570 &#39;-XX:+UseCompressedOops&#39; \u6765\u542F\u7528\u6B64\u529F\u80FD\u3002
141 CompressedOopsRuleFactory_TEXT_OK=\u538B\u7F29 Oops \u7684\u8BBE\u7F6E\u6B63\u5E38\u3002
142 ConcurrentFailedRuleFactory_TEXT_WARN=\u7279\u5B9A\u5783\u573E\u6536\u96C6\u671F\u95F4\u51FA\u73B0\u4E86\u5E76\u884C\u6A21\u5F0F\u5931\u8D25\u3002
143 ConcurrentFailedRuleFactory_TEXT_WARN_LONG=\u5E76\u884C\u6A21\u5F0F\u5931\u8D25\u610F\u5473\u7740\u5783\u573E\u6536\u96C6\u5668\u65E0\u6CD5\u6EE1\u8DB3 Java \u7A0B\u5E8F\u7684\u9700\u6C42\u3002\u8BF7\u5C1D\u8BD5\u964D\u4F4E &lt;a href=&quot;http://www.oracle.com/technetwork/articles/java/vmoptions-jsp-140102.html&quot;&gt;-XX:InitiatingHeapOccupancyPercent&lt;/a&gt; \u7684\u503C\u3002
144 ContextSwitchRule_AGGR_MAX_BLOCKS=\u6700\u5927\u963B\u6B62\u6570
145 ContextSwitchRule_CONFIG_WARNING_LIMIT=\u4E0A\u4E0B\u6587\u5207\u6362\u7387\u8B66\u544A\u9650\u5236
146 ContextSwitchRule_CONFIG_WARNING_LIMIT_LONG=\u89E6\u53D1\u8B66\u544A\u6240\u9700\u7684\u4E0A\u4E0B\u6587\u5207\u6362\u7387 (\u5207\u6362\u6570/\u79D2)
147 ContextSwitchRuleFactory_RULE_NAME=\u4E0A\u4E0B\u6587\u5207\u6362
148 ContextSwitchRuleFactory_TEXT_INFO=\u7A0B\u5E8F\u5728\u8BB0\u5F55\u671F\u95F4\u5BFC\u81F4\u4E86\u591A\u4E2A\u4E0A\u4E0B\u6587\u5207\u6362\u3002
149 ContextSwitchRuleFactory_TEXT_INFO_LONG=\u7A0B\u5E8F\u4E0A\u4E0B\u6587\u591A\u6B21\u5207\u6362, \u8BB8\u591A\u7EBF\u7A0B\u5728\u7B49\u5F85\u76F8\u540C\u7684\u76D1\u89C6\u5668\u3002\u8BF7\u8003\u8651\u51CF\u5C11\u4F7F\u7528\u7684\u7EBF\u7A0B\u6570, \u6216\u8005\u5C1D\u8BD5\u901A\u8FC7\u5176\u4ED6\u65B9\u6CD5\u51CF\u5C11\u9501\u4E89\u7528\u3002
150 ContextSwitchRuleFactory_TEXT_OK=\u8BB0\u5F55\u671F\u95F4, \u7A0B\u5E8F\u6CA1\u6709\u5BFC\u81F4\u8FC7\u591A\u4E0A\u4E0B\u6587\u5207\u6362\u3002
151 DMSIncidentRule_AGGR_INCIDENTS_COUNT=DMS \u610F\u5916\u4E8B\u4EF6
152 DMSIncidentRule_AGGR_INCIDENTS_COUNT_DESC=DMS \u610F\u5916\u4E8B\u4EF6\u6570\u91CF
153 DMSIncidentRule_CONFIG_WARNING_LIMIT=DMS \u610F\u5916\u4E8B\u4EF6\u8B66\u544A\u9650\u5236
154 DMSIncidentRule_CONFIG_WARNING_LIMIT_LONG=\u89E6\u53D1\u8B66\u544A\u6240\u9700\u7684 DMS \u610F\u5916\u4E8B\u4EF6\u6570
155 DMSIncidentRuleFactory_RULE_NAME=DMS \u610F\u5916\u4E8B\u4EF6
156 DMSIncidentRuleFactory_TEXT_OK=\u8BB0\u5F55\u4E2D\u6CA1\u6709\u62A5\u544A DMS \u610F\u5916\u4E8B\u4EF6\u3002
157 DMSIncidentRuleFactory_TEXT_WARN=\u62A5\u544A\u4E86 DMS \u610F\u5916\u4E8B\u4EF6\u3002
158 # {0} is a number
159 DMSIncidentRuleFactory_TEXT_WARN_LONG=\u62A5\u544A\u4E86 {0} \u4E2A DMS (\u52A8\u6001\u76D1\u89C6\u670D\u52A1) \u610F\u5916\u4E8B\u4EF6\u3002
160 DeprecatedGcRuleFactory_TEXT_WARN_PERMGEN_LONG=\u7531\u4E8E Java \u7528\u6237\u65E0\u9700\u9884\u5148\u5F97\u77E5\u9700\u8981\u4E3A\u7C7B\u5143\u6570\u636E\u7B49\u4FDD\u7559\u591A\u5C11\u5185\u5B58, JDK 8 \u4E2D\u5220\u9664\u4E86 PermGen\u3002\u5982\u540C\u5728 JRockit \u548C J9 JVM \u4E2D\u4E00\u6837, \u73B0\u5728\u7C7B\u5143\u6570\u636E\u4F7F\u7528\u672C\u5730\u5185\u5B58, \u5B83\u4F1A\u6839\u636E\u9700\u8981\u52A8\u6001\u589E\u957F\u3002java.lang.OutOfMemoryError \u7684\u7B49\u4EF7\u9879: \u5F15\u53D1 PermGen \u8981\u96BE\u5F97\u591A\u3002\u8981\u5F71\u54CD\u4F55\u65F6\u5F00\u59CB\u5C1D\u8BD5\u56DE\u6536\u5143\u7A7A\u95F4\u5185\u5B58, \u8BF7\u67E5\u770B &lt;a href=&quot;https://docs.oracle.com/javase/8/docs/technotes/tools/unix/java.html&quot;&gt;MaxMetaspaceSize flag&lt;/a&gt;\u3002
161 DumpReason_RULE_NAME=\u5F02\u5E38\u8F6C\u50A8\u539F\u56E0
162 DumpReasonRule_TEXT_OK=\u7531\u4E8E\u5F02\u5E38\u539F\u56E0\uFF0C\u672A\u8F6C\u50A8\u6B64\u8BB0\u5F55\u3002
163 DumpReasonRule_TEXT_INFO=\u7531\u4E8E\u5F02\u5E38\u539F\u56E0\uFF0C\u5DF2\u8F6C\u50A8\u6B64\u8BB0\u5F55\u3002
164 DumpReasonRule_TEXT_LONG_CRASH=\u7531\u4E8E JVM \u5D29\u6E83\uFF0C\u5DF2\u8F6C\u50A8\u8BB0\u5F55\u3002\u8BB0\u5F55\u7ED3\u5C3E\u53EF\u80FD\u7F3A\u5C11\u4E00\u4E9B\u4E8B\u4EF6\u3002
165 DumpReasonRule_TEXT_LONG_OOM=\u7531\u4E8E\u5185\u5B58\u4E0D\u8DB3\uFF0C\u5DF2\u8F6C\u50A8\u8BB0\u5F55\u3002\u8BB0\u5F55\u7ED3\u5C3E\u53EF\u80FD\u7F3A\u5C11\u4E00\u4E9B\u4E8B\u4EF6\u3002
166 DumpReasonRule_TEXT_LONG_COREDUMP=\u5DF2\u4ECE\u4EE3\u7801\u8F6C\u50A8\u4E2D\u63D0\u53D6\u8BB0\u5F55\u3002
167 DumpReasonRule_TEXT_INFO_UNKNOWN=\u7531\u4E8E\u672A\u77E5\uFF08\u53EF\u80FD\u4E0D\u662F\u5F02\u5E38\uFF09\u539F\u56E0\uFF0C\u5DF2\u8F6C\u50A8\u6B64\u8BB0\u5F55\u3002
168 DumpReasonRule_TEXT_LONG_UNKNOWN=\u7531\u4E8E\u4EE5\u4E0B\u539F\u56E0\uFF0C\u5DF2\u8F6C\u50A8\u8BB0\u5F55\uFF1A{0}\u3002
169 DumpReasonRule_CRASH_SCORE=\u5D29\u6E83\u5F97\u5206
170 DumpReasonRule_CRASH_SCORE_LONG=\u7531\u4E8E\u5D29\u6E83\u800C\u8F6C\u50A8\u7684\u8BB0\u5F55\u7684\u5F97\u5206
171 DumpReasonRule_OOM_SCORE=OOM \u5F97\u5206
172 DumpReasonRule_OOM_SCORE_LONG=\u7531\u4E8E\u5185\u5B58\u4E0D\u8DB3\u800C\u8F6C\u50A8\u7684\u8BB0\u5F55\u7684\u5F97\u5206
173 DumpReasonRule_COREDUMP_SCORE=\u6838\u5FC3\u8F6C\u50A8\u5F97\u5206
174 DumpReasonRule_COREDUMP_SCORE_LONG=\u4ECE\u6838\u5FC3\u8F6C\u50A8\u63D0\u53D6\u7684\u8BB0\u5F55\u7684\u5F97\u5206
175 DuplicateFlagsRuleFactory_RULE_NAME=\u91CD\u590D\u7684\u6807\u8BB0
176 DuplicateFlagsRuleFactory_TEXT_OK=\u547D\u4EE4\u884C\u4E0A\u6CA1\u6709\u91CD\u590D\u7684 JVM \u6807\u8BB0\u3002
177 DuplicateFlagsRuleFactory_TEXT_WARN_SINGULAR=\u4E00\u4E2A JVM \u6807\u8BB0\u91CD\u590D\u3002
178 # {0} is a number
179 DuplicateFlagsRuleFactory_TEXT_WARN={0} \u4E2A JVM \u6807\u8BB0\u91CD\u590D\u3002
180 # {0} is an HTML list of duplicated JVM flags
181 DuplicateFlagsRuleFactory_TEXT_WARN_LONG=\u5728\u542F\u52A8\u5E94\u7528\u7A0B\u5E8F\u65F6\u4F7F\u7528\u591A\u4E2A\u811A\u672C\u5C42\u53EF\u80FD\u4F1A\u5BFC\u81F4\u91CD\u590D\u7684 JVM \u6807\u8BB0\u3002\u51FA\u73B0\u91CD\u590D\u7684\u6807\u8BB0\u4F1A\u5F88\u5371\u9669, \u56E0\u4E3A\u5176\u4E2D\u67D0\u4E2A\u811A\u672C\u4E2D\u7684\u6807\u8BB0\u53EF\u80FD\u65E0\u6CD5\u83B7\u5F97\u9884\u671F\u7684\u6548\u679C\u3002\u5BF9\u4E8E\u4E0E\u5B89\u5168\u76F8\u5173\u7684\u7CFB\u7EDF\u5C5E\u6027, \u8FD9\u5C24\u4E3A\u5371\u9669\u3002\u8BF7\u5C1D\u8BD5\u67E5\u627E\u5B9A\u4E49\u4E86\u6807\u8BB0\u7684\u6240\u6709\u4F4D\u7F6E\u5E76\u4EC5\u4FDD\u7559\u4E00\u4E2A\u3002\u4EE5\u4E0B\u6807\u8BB0\u91CD\u590D: {0}
182 ErrorRule_CONFIG_INFO_LIMIT=\u9519\u8BEF\u7387\u4FE1\u606F\u9650\u5236
183 ErrorRule_CONFIG_INFO_LIMIT_LONG=\u89E6\u53D1\u4FE1\u606F\u901A\u77E5\u6240\u9700\u7684\u6BCF\u5206\u949F\u9519\u8BEF\u4E8B\u4EF6\u6570
184 ErrorRule_CONFIG_WARN_LIMIT=\u9519\u8BEF\u7387\u8B66\u544A\u9650\u5236
185 ErrorRule_CONFIG_WARN_LIMIT_LONG=\u89E6\u53D1\u8B66\u544A\u6240\u9700\u7684\u6BCF\u5206\u949F\u9519\u8BEF\u4E8B\u4EF6\u6570
186 ErrorRule_CONFIG_EXCLUDED_ERRORS=\u6392\u9664\u7684\u9519\u8BEF\u7C7B
187 ErrorRule_CONFIG_EXCLUDED_ERRORS_LONG=\u63CF\u8FF0\u6392\u9664\u54EA\u4E9B\u9519\u8BEF\u7C7B\u7684\u6B63\u5219\u8868\u8FBE\u5F0F, \u4F8B\u5982 (com.sun.el.parser.ELParser\\$LookaheadSuccess|java.lang.NoSuchMethodError)
188 ErrorRule_CONFIG_WINDOW_SIZE=\u6ED1\u52A8\u7A97\u53E3\u5927\u5C0F
189 ErrorRule_CONFIG_WINDOW_SIZE_LONG=\u6ED1\u52A8\u7A97\u53E3\u7684\u5927\u5C0F\uFF0C\u8BE5\u7A97\u53E3\u7528\u4E8E\u67E5\u627E\u6BCF\u5206\u949F\u5177\u6709\u8BB8\u591A\u9519\u8BEF\u7684\u671F\u95F4\u3002
190 ErrorRule_RULE_NAME=\u5F15\u53D1\u7684\u9519\u8BEF
191 ErrorRule_TEXT_OK=\u7A0B\u5E8F\u672A\u751F\u6210\u4EFB\u4F55\u9519\u8BEF\u3002
192 # {0} is a number, {1} is a time range
193 ErrorRule_TEXT_WARN=\u7A0B\u5E8F\u5728 {1} \u671F\u95F4\u5E73\u5747\u6BCF\u5206\u949F\u751F\u6210 {0} \u4E2A\u9519\u8BEF\u3002
194 # {0} is a number, {1} is a time range, {2} is a number, {3} is an error class name, {4} is a number
195 ErrorRule_TEXT_WARN_LONG=\u7A0B\u5E8F\u5728 {1} \u671F\u95F4\u5E73\u5747\u6BCF\u5206\u949F\u751F\u6210 {0} \u4E2A\u9519\u8BEF\uFF0C\u603B\u5171\u5F15\u53D1\u4E86 {2} \u4E2A\u9519\u8BEF\u3002&lt;p&gt;\u6700\u5E38\u89C1\u7684\u9519\u8BEF\u4E3A &#39;&#39;{3}&#39;&#39;\uFF0C\u8BE5\u9519\u8BEF\u5F15\u53D1\u4E86 {4} \u6B21\u3002&lt;p&gt;\u8BF7\u8C03\u67E5\u5F15\u53D1\u7684\u9519\u8BEF\u4EE5\u786E\u5B9A\u662F\u5426\u53EF\u4EE5\u907F\u514D\u8FD9\u4E9B\u9519\u8BEF\u3002\u9519\u8BEF\u8868\u793A\u4EE3\u7801\u6267\u884C\u65F6\u9047\u5230\u4E86\u95EE\u9898\uFF0C\u6C38\u8FDC\u4E0D\u5E94\u8BE5\u7528\u4E8E\u6D41\u63A7\u5236\u3002
196 # {0} is a regexp exclude string, {1} is a number
197 ErrorRule_TEXT_WARN_EXCLUDED_INFO=\u4F7F\u7528\u4EE5\u4E0B\u6B63\u5219\u8868\u8FBE\u5F0F\u4ECE\u6B64\u89C4\u5219\u4E2D\u6392\u9664 {1} \u4E2A\u9519\u8BEF\uFF1A&#39;&#39;{0}&#39;&#39;\u3002
198 ExceptionRule_CONFIG_INFO_LIMIT=\u5F02\u5E38\u9519\u8BEF\u7387\u4FE1\u606F\u9650\u5236
199 ExceptionRule_CONFIG_INFO_LIMIT_LONG=\u89E6\u53D1\u4FE1\u606F\u901A\u77E5\u6240\u9700\u7684\u6BCF\u79D2\u5F15\u53D1\u7684\u5F02\u5E38\u9519\u8BEF\u6570
200 ExceptionRule_CONFIG_WARN_LIMIT=\u5F02\u5E38\u9519\u8BEF\u7387\u8B66\u544A\u9650\u5236
201 ExceptionRule_CONFIG_WARN_LIMIT_LONG=\u89E6\u53D1\u8B66\u544A\u6240\u9700\u7684\u6BCF\u79D2\u5F15\u53D1\u7684\u5F02\u5E38\u9519\u8BEF\u6570
202 ExceptionRule_RULE_NAME=\u5F15\u53D1\u7684\u5F02\u5E38\u9519\u8BEF
203 ExceptionRule_TEXT_INFO_LONG=\u5F15\u53D1\u5F02\u5E38\u9519\u8BEF\u6BD4\u666E\u901A\u4EE3\u7801\u6267\u884C\u6210\u672C\u9AD8\uFF0C\u8FD9\u610F\u5473\u7740\u5B83\u4EEC\u5E94\u4EC5\u7528\u4E8E\u5F02\u5E38\u60C5\u51B5\u3002\u8BF7\u8C03\u67E5\u5F15\u53D1\u7684\u5F02\u5E38\u9519\u8BEF\u4EE5\u786E\u5B9A\u662F\u5426\u53EF\u4EE5\u901A\u8FC7\u975E\u5F02\u5E38\u63A7\u5236\u6D41\u907F\u514D\u8FD9\u4E9B\u5F02\u5E38\u9519\u8BEF\u4E2D\u7684\u4EFB\u4F55\u4E00\u4E2A\u3002
204 # {0} is a time period, {1} is a time stamp, {2} is a number
205 ExceptionRule_TEXT_MESSAGE=\u5728\u4ECE {1} \u5F00\u59CB\u7684 {0} \u671F\u95F4\uFF0C\u7A0B\u5E8F\u6BCF\u79D2\u751F\u6210 {2} \u4E2A\u5F02\u5E38\u9519\u8BEF\u3002
206 FatalErrorRule_RULE_NAME=\u81F4\u547D\u9519\u8BEF
207 FatalErrorRule_TEXT_OK=JVM \u6B63\u5E38\u5173\u95ED\u3002
208 FatalErrorRule_TEXT_INFO=JVM \u7531\u4E8E\u6CA1\u6709\u5269\u4F59\u975E\u5B88\u62A4\u7A0B\u5E8F Java \u7EBF\u7A0B\u800C\u5173\u95ED\u3002
209 FatalErrorRule_TEXT_WARN=JVM \u7531\u4E8E\u81F4\u547D\u9519\u8BEF\u800C\u5173\u95ED\u3002\u8FD9\u8868\u793A\u7A0B\u5E8F\u4EE5\u5F02\u5E38\u65B9\u5F0F\u7EC8\u6B62\uFF0C\u5E94\u5BF9\u5176\u8FDB\u884C\u8C03\u67E5\u3002
210 FasttimeRule_TEXT_WARN=\u6B64\u98DE\u884C\u8BB0\u5F55\u4F7F\u7528\u5B58\u5728\u590F\u4EE4\u65F6\u8F6C\u6362 Bug \u7684 JVM \u751F\u6210\u3002
211 FasttimeRule_TEXT_WARN_LONG=\u6B64\u8BB0\u5F55\u4E2D\u7684\u65F6\u95F4\u6233\u4E0D\u53EF\u9760\uFF0C\u53EF\u80FD\u65E0\u6CD5\u6B63\u786E\u4EE3\u8868\u5B9E\u9645\u6570\u636E\uFF0C\u6216\u8005\u53EF\u80FD\u4F1A\u5BFC\u81F4 JMC \u51FA\u95EE\u9898\u3002\u5347\u7EA7\u5230 Java 7u60 \u6216\u66F4\u9AD8\u7248\u672C\u53EF\u89E3\u51B3\u6B64\u95EE\u9898\u3002
212 FewSampledThreadsRule_AGGR_SAMPLES_PER_THREAD=\u6BCF\u4E2A\u7EBF\u7A0B\u7684\u6837\u672C\u6570
213 FewSampledThreadsRule_AGGR_SAMPLES_PER_THREAD_DESC=\u6BCF\u4E2A\u7EBF\u7A0B\u7684\u6837\u672C\u6570
214 # {0} is a percentage, {1} a time period, {2} a timestamp.
215 FewSampledThreadsRule_APPLICATION_IDLE=\u5E94\u7528\u7A0B\u5E8F\u4F3C\u4E4E\u7A7A\u95F2\u3002\u5728 {2} \u5F00\u59CB\u7684 {1} \u65F6\u95F4\u7A97\u53E3\u671F\u95F4\uFF0C\u6700\u5927\u5E73\u5747 JVM CPU \u5360\u7528\u7387\u4E3A {0}%\u3002
216 FewSampledThreadsRule_APPLICATION_IDLE_LONG=\u8FD9\u53EF\u80FD\u662F\u7531\u5E94\u7528\u7A0B\u5E8F\u7B49\u5F85\u65F6\u95F4\u5BFC\u81F4\u7684\uFF0C\u8BF7\u67E5\u770B\u5176\u4ED6\u89C4\u5219\u7684\u4FE1\u606F\uFF0C\u6216\u8005\u53EF\u80FD\u662F\u5E94\u7528\u7A0B\u5E8F\u672A\u6267\u884C\u4EFB\u4F55\u64CD\u4F5C\u3002
217 FewSampledThreadsRule_CPU_WINDOW_SIZE=CPU \u7A97\u53E3\u5927\u5C0F
218 FewSampledThreadsRule_CPU_WINDOW_SIZE_LONG=\u8BA1\u7B97 CPU \u5360\u7528\u7387\u65F6\u4F7F\u7528\u7684\u6ED1\u52A8\u7A97\u53E3\u5927\u5C0F\u3002
219 FewSampledThreadsRule_MIN_CPU_RATIO=\u6700\u5C0F CPU \u4F7F\u7528\u6BD4\u7387
220 FewSampledThreadsRule_MIN_CPU_RATIO_LONG=\u5C06\u6B64\u5E94\u7528\u7A0B\u5E8F\u89C6\u4E3A\u4E0D\u7A7A\u95F2\u7684\u6700\u5C0F CPU \u4F7F\u7528\u6BD4\u7387\u3002
221 FewSampledThreadsRule_MIN_SAMPLE_COUNT=\u6700\u5C0F\u6837\u672C\u603B\u6570
222 FewSampledThreadsRule_MIN_SAMPLE_COUNT_LONG=\u6B64\u89C4\u5219\u9002\u7528\u7684\u8BB0\u5F55\u4E2D\u7684\u6700\u5C0F\u6837\u672C\u6570\u3002
223 FewSampledThreadsRule_MIN_SAMPLE_COUNT_PER_THREAD=\u6BCF\u4E2A\u7EBF\u7A0B\u7684\u6700\u5C0F\u6837\u672C\u8BA1\u6570
224 FewSampledThreadsRule_MIN_SAMPLE_COUNT_PER_THREAD_LONG=\u5C06\u7EBF\u7A0B\u89C6\u4E3A\u5DF2\u91C7\u6837\u7684\u7EBF\u7A0B\u4E2D\u7684\u6700\u5C0F\u6837\u672C\u6570\u3002
225 FewSampledThreadsRule_SAMPLED_THREADS_RATIO_WARNING_LIMIT=\u91C7\u6837\u7EBF\u7A0B\u6BD4\u7387\u9650\u5236
226 FewSampledThreadsRule_SAMPLED_THREADS_RATIO_WARNING_LIMIT_LONG=\u89E6\u53D1\u8B66\u544A\u6240\u9700\u7684\u91C7\u6837\u7EBF\u7A0B\u6570\u4E0E\u786C\u4EF6\u7EBF\u7A0B\u6570\u4E4B\u95F4\u7684\u6BD4\u7387\u3002
227 FewSampledThreadsRule_TEXT_OK=\u91C7\u6837\u7EBF\u7A0B\u91CF\u6CA1\u6709\u4EFB\u4F55\u95EE\u9898\u3002
228 FewSampledThreadsRule_TEXT_OK_LONG=\u91C7\u6837\u7684\u7EBF\u7A0B\u6570\u591A\u4E8E\u786C\u4EF6\u7EBF\u7A0B\u6570\u3002\u8FD9\u8868\u793A\u5E94\u7528\u7A0B\u5E8F\u5BF9\u4E8E\u53EF\u7528\u786C\u4EF6\u5177\u6709\u8DB3\u591F\u7684\u5E76\u884C\u5EA6\u3002
229 # {0} and {1} are numbers
230 FewSampledThreadsRule_TEXT_NOT_ENOUGH_SAMPLES=\u8BB0\u5F55\u4E2D\u4EC5\u6709 {0} \u4E2A\u65B9\u6CD5\u6982\u8981\u5206\u6790\u6837\u672C\u3002\u6B64\u89C4\u5219\u9700\u8981\u81F3\u5C11 {1} \u4E2A\u6837\u672C\u624D\u6709\u6548\u3002
231 FewSampledThreadsRule_RULE_NAME=\u5E76\u884C\u7EBF\u7A0B
232 FewSampledThreadsRule_TEXT_INFO=\u91C7\u6837\u7EBF\u7A0B\u6570\u8981\u5C11\u4E8E\u786C\u4EF6\u7EBF\u7A0B\uFF08\u6838\u5FC3\uFF09\u603B\u6570\u3002
233 # {0} is a count, {1} is a count, {2} is a count
234 FewSampledThreadsRule_TEXT_INFO_LONG=\u627E\u5230 {1} \u4E2A\u5177\u6709\u81F3\u5C11 {0} \u4E2A\u65B9\u6CD5\u6837\u672C\u7684\u7EBF\u7A0B\uFF0C\u4F46\u8BA1\u7B97\u673A\u6709 {2} \u4E2A\u786C\u4EF6\u7EBF\u7A0B\uFF08\u6838\u5FC3\uFF09\u3002\u5E94\u7528\u7A0B\u5E8F\u53EF\u80FD\u4F1A\u53D7\u76CA\u4E8E\u8F83\u9AD8\u7EA7\u522B\u7684\u5E76\u884C\u5EA6\u3002\u8FD9\u8FD8\u53EF\u80FD\u662F\u7531\u4E8E\u7EBF\u7A0B\u6267\u884C\u4E86\u8FD0\u884C Java \u4EE3\u7801\u4E4B\u5916\u7684\u64CD\u4F5C\u6240\u5BFC\u81F4\uFF0C\u4F8B\u5982\uFF0C\u8FD0\u884C\u672C\u5730\u4EE3\u7801\u6216\u8005\u5728 JVM \u5185\u90E8\u82B1\u8D39\u65F6\u95F4\u3002
235 FileReadRule_CONFIG_WARNING_LIMIT=\u6587\u4EF6\u8BFB\u53D6\u6301\u7EED\u65F6\u95F4\u8B66\u544A\u9650\u5236
236 FileReadRule_CONFIG_WARNING_LIMIT_LONG=\u89E6\u53D1\u8B66\u544A\u6240\u9700\u7684\u6700\u77ED\u6587\u4EF6\u8BFB\u53D6\u6301\u7EED\u65F6\u95F4
237 FileReadRuleFactory_RULE_NAME=\u6587\u4EF6\u8BFB\u53D6\u5CF0\u503C\u6301\u7EED\u65F6\u95F4
238 # {0} is a time period
239 FileReadRuleFactory_TEXT_OK=\u5728\u6B64\u8BB0\u5F55\u4E2D\u672A\u627E\u5230\u957F\u65F6\u95F4\u7684\u6587\u4EF6\u8BFB\u53D6\u6682\u505C\uFF08\u6700\u957F\u4E3A {0}\uFF09\u3002
240 FileReadRuleFactory_TEXT_NO_EVENTS=\u6B64\u8BB0\u5F55\u4E2D\u6CA1\u6709\u4EFB\u4F55\u6587\u4EF6\u8BFB\u53D6\u4E8B\u4EF6\u3002
241 # {0} is a time period
242 FileReadRuleFactory_TEXT_WARN=\u6B64\u8BB0\u5F55\u4E2D\u6709\u957F\u65F6\u95F4\u7684\u6587\u4EF6\u8BFB\u53D6\u6682\u505C\uFF08\u6700\u957F\u4E3A {0}\uFF09\u3002
243 # {0} is a time period, {1} is a time stamp, {2} is a size in bytes
244 FileReadRuleFactory_TEXT_WARN_LONG=\u4ECE {1} \u8D77\uFF0C\u6700\u957F\u7684\u8BB0\u5F55\u6587\u4EF6\u8BFB\u53D6\u82B1\u8D39\u4E86 {0} \u6765\u8BFB\u53D6 {2}\u3002
245 FileWriteRule_CONFIG_WARNING_LIMIT=\u6587\u4EF6\u5199\u5165\u6301\u7EED\u65F6\u95F4\u8B66\u544A\u9650\u5236
246 FileWriteRule_CONFIG_WARNING_LIMIT_LONG=\u89E6\u53D1\u8B66\u544A\u6240\u9700\u7684\u6700\u77ED\u6587\u4EF6\u5199\u5165\u6301\u7EED\u65F6\u95F4
247 FileWriteRuleFactory_RULE_NAME=\u6587\u4EF6\u5199\u5165\u5CF0\u503C\u6301\u7EED\u65F6\u95F4
248 # {0} is a time period
249 FileWriteRuleFactory_TEXT_OK=\u5728\u6B64\u8BB0\u5F55\u4E2D\u672A\u627E\u5230\u957F\u65F6\u95F4\u7684\u6587\u4EF6\u5199\u5165\u6682\u505C\uFF08\u6700\u957F\u4E3A {0}\uFF09\u3002
250 FileWriteRuleFactory_TEXT_NO_EVENTS=\u6B64\u8BB0\u5F55\u4E2D\u6CA1\u6709\u4EFB\u4F55\u6587\u4EF6\u5199\u5165\u4E8B\u4EF6\u3002
251 # {0} is a time period
252 FileWriteRuleFactory_TEXT_WARN=\u6B64\u8BB0\u5F55\u4E2D\u6709\u957F\u65F6\u95F4\u7684\u6587\u4EF6\u5199\u5165\u6682\u505C\uFF08\u6700\u957F\u4E3A {0}\uFF09\u3002
253 # {0} is a time period, {1} is a time stamp, {2} is a size in bytes
254 FileWriteRuleFactory_TEXT_WARN_LONG=\u4ECE {1} \u8D77\uFF0C\u6700\u957F\u7684\u8BB0\u5F55\u6587\u4EF6\u5199\u5165\u82B1\u8D39\u4E86 {0} \u6765\u5199\u5165 {2}\u3002
255 FlightRecordingSupportRule_RULE_NAME=\u98DE\u884C\u8BB0\u5F55\u652F\u6301
256 FlightRecordingSupportRule_TEXT_OK=\u6B64\u8BB0\u5F55\u4F7F\u7528\u7684 JVM \u7248\u672C\u5B8C\u5168\u652F\u6301\u98DE\u884C\u8BB0\u5F55\u5668\u3002
257 FlightRecordingSupportRule_EA_TEXT_WARN_SHORT=\u8BB0\u5F55\u6765\u81EA Early Access \u5DE5\u4F5C\u7248\u672C\u3002
258 FlightRecordingSupportRule_EA_TEXT_WARN_LONG=\u6B64\u8BB0\u5F55\u6765\u81EA JRE ({0}) \u7684 Early Access \u5DE5\u4F5C\u7248\u672C\u3002\u4E0D\u652F\u6301\u81EA\u52A8\u5206\u6790, \u5C1D\u8BD5\u5206\u6790\u8BB0\u5F55\u65F6\u53EF\u80FD\u4F1A\u51FA\u73B0\u9519\u8BEF\u3002
259 FlightRecordingSupportRule_NO_JVM_VERSION_EVENTS_TEXT=\u672A\u8BB0\u5F55\u5E26\u6709 JVM \u7248\u672C\u4FE1\u606F\u7684 VM \u4FE1\u606F\u4E8B\u4EF6\u3002\u8BF7\u542F\u7528 JVM \u4FE1\u606F\u4E8B\u4EF6\u4EE5\u4F7F\u7528\u6B64\u89C4\u5219\u3002
260 FlightRecordingSupportRule_UNSUPPORTED_TEXT_WARN_SHORT=\u8BB0\u5F55\u6765\u81EA\u4E0D\u652F\u6301\u7684 JRE \u7248\u672C\u3002
261 FlightRecordingSupportRule_UNSUPPORTED_TEXT_WARN_LONG=\u5728 HotSpot \u5B8C\u5168\u652F\u6301 JDK \u98DE\u884C\u8BB0\u5F55\u5668\u4E4B\u524D\uFF0C\u6B64\u8BB0\u5F55\u6765\u81EA JRE \u7248\u672C\u4E3A {0} \u7684\u8FD0\u884C\u65F6\u30027u40 \u4E4B\u524D\u7684\u7248\u672C\u4EC5\u90E8\u5206\u652F\u6301\u98DE\u884C\u8BB0\u5F55\u3002\u4E0D\u652F\u6301\u81EA\u52A8\u5206\u6790\uFF0C\u5C1D\u8BD5\u5206\u6790\u6B64\u8BB0\u5F55\u65F6\u53EF\u80FD\u4F1A\u51FA\u73B0\u9519\u8BEF\u3002
262 
263 FullGcRule_RULE_NAME=G1/CMS \u5B8C\u5168\u6536\u96C6
264 FullGcRule_OTHER_COLLECTOR_IN_USE=\u6B64\u89C4\u5219\u4EC5\u5BF9 CMS \u548C G1 \u5783\u573E\u6536\u96C6\u5668\u6709\u6548\uFF0C\u6CA1\u6709\u4E3A\u6B64 JVM \u68C0\u6D4B\u5230\u5176\u4E2D\u4EFB\u4E00\u5783\u573E\u6536\u96C6\u5668\u3002
265 FullGcRule_FULL_GC_OCCURRED_TITLE=\u68C0\u6D4B\u5230\u5B8C\u6574 GC\u3002
266 FullGcRule_FULL_GC_OCCURRED_DESC=\u6B64\u8BB0\u5F55\u8FC7\u7A0B\u4E2D\u81F3\u5C11\u8FDB\u884C\u4E86\u4E00\u6B21\u5B8C\u6574\u7684\u505C\u6B62\u4E00\u5207 (Stop-The-World) \u7684\u5783\u573E\u6536\u96C6\u3002\u5BF9\u4E8E CMS \u548C G1 \u6536\u96C6\u5668\uFF0C\u5B8C\u6574 GC \u4E8B\u4EF6\u662F\u5F3A\u8D1F\u6027\u80FD\u6307\u793A\u5668\u3002\u53EF\u4EE5\u4F7F\u7528\u53EF\u4F18\u5316\u7684 GC \u53C2\u6570\u6765\u5141\u8BB8\u6536\u96C6\u5668\u5728\u5E76\u884C\u6A21\u5F0F\u4E0B\u64CD\u4F5C\uFF0C\u907F\u514D\u505C\u6B62\u4E00\u5207 (Stop-The-World) \u7684\u6682\u505C\u5E76\u63D0\u9AD8 GC \u548C\u5E94\u7528\u7A0B\u5E8F\u6027\u80FD\u3002
267 FullGcRule_NO_FULL_GC_OCCURRED=\u672A\u68C0\u6D4B\u5230\u505C\u6B62\u4E00\u5207 (Stop-the-World) \u7684\u5B8C\u6574 GC \u4E8B\u4EF6\u3002
268 
269 GcFreedRatioRule_RULE_NAME=GC \u91CA\u653E\u6BD4\u7387
270 GcFreedRatioRule_GC_FREED_RATIO_INFO_LIMIT=\u6BCF\u79D2\u91CA\u653E\u5185\u5B58\u76F8\u6BD4\u4E8E\u6D3B\u52A8\u96C6\u5927\u5C0F\u4FE1\u606F\u9650\u5236
271 GcFreedRatioRule_GC_FREED_RATIO_INFO_LIMIT_DESC=\u89E6\u53D1\u4FE1\u606F\u901A\u77E5\u6240\u9700\u7684\u5783\u573E\u6536\u96C6\u6BCF\u79D2\u91CA\u653E\u5185\u5B58\u91CF\u4E0E\u6D3B\u52A8\u96C6\u4E4B\u95F4\u7684\u6BD4\u7387\u3002
272 GcFreedRatioRule_WINDOW_SIZE=\u65F6\u95F4\u7A97\u53E3\u5927\u5C0F
273 GcFreedRatioRule_WINDOW_SIZE_DESC=\u8BC4\u4F30\u89C4\u5219\u65F6\u8981\u4F7F\u7528\u7684\u65F6\u95F4\u7A97\u53E3\u5927\u5C0F\u3002
274 GcFreedRatioRule_FEW_GCS_LIMIT=\u5783\u573E\u6536\u96C6\u9650\u5236\u592A\u5C11
275 GcFreedRatioRule_FEW_GCS_LIMIT_DESC=\u4F7F\u89C4\u5219\u8BA1\u7B97\u6709\u610F\u4E49\u7684\u5783\u573E\u6536\u96C6\u6700\u5C0F\u6570\u91CF\u3002
276 # {0} is a count, # {1} is a count
277 GcFreedRatioRule_RESULT_FEW_GCS=\u4EC5\u627E\u5230 {0} \u4E2A\u5806\u6982\u8981\u4E8B\u4EF6\uFF0C\u6B64\u89C4\u5219\u9700\u8981\u81F3\u5C11 {1} \u4E2A\u4E8B\u4EF6\u624D\u80FD\u8BA1\u7B97\u76F8\u5173\u7ED3\u679C\u3002\u8FD9\u53EF\u80FD\u8868\u793A\u8BB0\u5F55\u8FC7\u7A0B\u4E2D\u53EA\u8FDB\u884C\u4E86\u51E0\u6B21\u5783\u573E\u6536\u96C6\u3002\u5177\u6709\u8F83\u5C11\u5783\u573E\u6536\u96C6\u901A\u5E38\u662F\u4E2A\u597D\u7684\u4FE1\u53F7\u3002
278 GcFreedRatioRule_RESULT_OK=\u8FD9\u53EF\u80FD\u662F\u5408\u7406\u7684\u6570\u91CF\u3002
279 GcFreedRatioRule_RESULT_NOT_OK=\u8FD9\u53EF\u80FD\u8FC7\u591A\u3002
280 # {0} is a number
281 GcFreedRatioRule_RESULT_SHORT_DESCRIPTION=\u5783\u573E\u6536\u96C6\u6BCF\u79D2\u91CA\u653E\u7684\u5185\u5B58\u4E0E\u6D3B\u52A8\u96C6\u4E4B\u95F4\u7684\u6BD4\u7387\u4E3A {0}\u3002
282 # {0} is a memory amount, {1} is a timespan, {2} is a timestamp, {3} is a number, {4} is a memory amount
283 GcFreedRatioRule_RESULT_LONG_DESCRIPTION=\u5728\u4ECE {2} \u5F00\u59CB\u7684 {1} \u671F\u95F4\u4E2D\uFF0C\u5783\u573E\u6536\u96C6\u6BCF\u79D2\u91CA\u653E {0}\u3002\u8FD9\u662F\u5E73\u5747\u6D3B\u52A8\u96C6\uFF08\u4E3A {4}\uFF09\u7684 {3} \u500D\u3002
284 GcFreedRatioRule_RESULT_MORE_INFO=\u5982\u679C\u5783\u573E\u6536\u96C6\u5668\u53EF\u4EE5\u91CA\u653E\u5927\u91CF\u5185\u5B58\uFF0C\u53EF\u80FD\u662F\u56E0\u4E3A\u5E94\u7528\u7A0B\u5E8F\u5206\u914D\u4E86\u5927\u91CF\u77ED\u671F\u5B58\u5728\u7684\u5BF9\u8C61\u3002\u8981\u51CF\u5C11\u5206\u914D\u6BD4\u7387\uFF0C\u8BF7\u8C03\u67E5\u5206\u914D\u5806\u6808\u8DDF\u8E2A\u4EE5\u786E\u5B9A\u5BFC\u81F4\u6700\u591A\u5206\u914D\u7684\u4EE3\u7801\u8DEF\u5F84\u3002
285 
286 GcPauseRatioRule_INFO_LIMIT=GC \u6682\u505C\u6BD4\u7387\u4FE1\u606F\u9650\u5236
287 GcPauseRatioRule_INFO_LIMIT_DESC=\u89E6\u53D1\u4FE1\u606F\u901A\u77E5\u6240\u9700\u7684\u65F6\u95F4\u7A97\u53E3\u5185 GC \u6682\u505C\u4E0E\u6267\u884C\u65F6\u95F4\u4E4B\u95F4\u7684\u6BD4\u7387
288 GcPauseRatioRule_WARNING_LIMIT=GC \u6682\u505C\u6BD4\u7387\u8B66\u544A\u9650\u5236
289 GcPauseRatioRule_WARNING_LIMIT_DESC=\u89E6\u53D1\u8B66\u544A\u6240\u9700\u7684\u65F6\u95F4\u7A97\u53E3\u5185 GC \u6682\u505C\u4E0E\u6267\u884C\u65F6\u95F4\u4E4B\u95F4\u7684\u6BD4\u7387
290 GcPauseRatioRule_WINDOW_SIZE=GC \u6682\u505C\u65F6\u95F4\u7A97\u53E3\u5927\u5C0F
291 GcPauseRatioRule_WINDOW_SIZE_DESC=\u8BC4\u4F30\u89C4\u5219\u65F6\u4F7F\u7528\u7684\u65F6\u95F4\u7A97\u53E3\u5927\u5C0F
292 GcPauseRatioRule_RULE_NAME=GC \u6682\u505C
293 GcPauseRatioRule_RULE_TEXT=GC \u6682\u505C\u5F71\u54CD\u4E86\u5E94\u7528\u7A0B\u5E8F\u6548\u7387\u3002
294 # {0} is a percentage, {1} is a timespan, {2} is a timestamp, {3} is a percentage
295 GcPauseRatioRule_RULE_TEXT_LONG=\u5728\u4ECE {2} \u5F00\u59CB\u7684 {1} \u671F\u95F4\uFF0C\u5783\u573E\u6536\u96C6\u6682\u505C\u4E0E\u6267\u884C\u65F6\u95F4\u4E4B\u95F4\u7684\u6700\u9AD8\u6BD4\u7387\u4E3A {0}%\u3002\u6574\u4E2A\u8BB0\u5F55\u7684\u5783\u573E\u6536\u96C6\u6682\u505C\u6BD4\u7387\u4E3A {3}%\u3002
296 GcPauseRatioRule_RULE_TEXT_RECOMMENDATION=\u901A\u8FC7\u589E\u52A0\u5806\u5927\u5C0F\u6216\u8005\u5C1D\u8BD5\u51CF\u5C11\u5206\u914D\uFF0C\u53EF\u4EE5\u51CF\u5C11\u6682\u505C\u65F6\u95F4\u3002
297 GcPauseRatioRule_RULE_TEXT_OK=GC \u6682\u505C\u672A\u663E\u8457\u5F71\u54CD\u5E94\u7528\u7A0B\u5E8F\u6548\u7387\u3002
298 
299 GcLockerRule_CONFIG_WARNING_LIMIT=GC \u9501\u5B9A\u5668\u6BD4\u7387\u9650\u5236
300 GcLockerRule_CONFIG_WARNING_LIMIT_LONG=GC \u9501\u5B9A\u5668\u5BFC\u81F4\u7684\u5783\u573E\u6536\u96C6\u6570\u4E0E\u5783\u573E\u6536\u96C6\u603B\u6570\u4E4B\u95F4\u7684\u8B66\u544A\u9650\u5236\u6BD4\u7387
301 GcLockerRule_TEXT_NA=\u627E\u4E0D\u5230 GC \u4FE1\u606F\u4E8B\u4EF6\u3002
302 GcLockerRuleFactory_RULE_NAME=GC \u9501\u5B9A\u5668\u5BFC\u81F4\u7684 GC
303 # {0} is a percentage
304 GcLockerRuleFactory_TEXT_INFO=GC \u9501\u5B9A\u5668\u5BFC\u81F4\u4E86 {0} \u7684\u5783\u573E\u6536\u96C6\u3002
305 GcLockerRuleFactory_TEXT_INFO_LONG=GC \u9501\u5B9A\u5668\u5BFC\u81F4\u7684\u5783\u573E\u6536\u96C6\u6307\u793A\u8FD0\u884C\u65F6\u8FD0\u884C\u4E86\u5927\u91CF JNI \u4EE3\u7801\u3002\u8981\u907F\u514D\u8FD9\u4E2A\u95EE\u9898, \u8BF7\u51CF\u5C11\u5728 JNI \u4E2D\u82B1\u8D39\u7684\u65F6\u95F4\u3002
306 GcLockerRuleFactory_TEXT_OK=GC \u9501\u5B9A\u5668\u672A\u5BFC\u81F4\u4EFB\u4F55\u5783\u573E\u6536\u96C6\u3002
307 GcStallRule_RULE_NAME=GC \u505C\u6EDE
308 GcStallRule_TEXT_OK=\u672A\u68C0\u6D4B\u5230\u5783\u573E\u6536\u96C6\u5668\u65E0\u6CD5\u6EE1\u8DB3\u5DE5\u4F5C\u8D1F\u8F7D\u7684\u6307\u793A\u3002
309 General_CONFIG_CLASS_LIMIT=\u7C7B\u9650\u5236
310 General_CONFIG_CLASS_LIMIT_LONG=\u8D85\u8FC7\u8981\u62A5\u544A\u7684\u8B66\u544A\u9650\u5236\u7684\u6700\u5927\u7C7B\u6570\u3002
311 General_NO_STACK_TRACE_AVAILABLE=&lt;p&gt;&amp;lt;\u65E0\u53EF\u7528\u5806\u6808\u8DDF\u8E2A&amp;gt;&lt;/p&gt;
312 General_RULE_REQUIRES_EVENTS_FROM_ONE_OF_MANY=\u6B64\u89C4\u5219\u8981\u6C42\u6765\u81EA\u4EE5\u4E0B\u4E00\u79CD\u4E8B\u4EF6\u7C7B\u578B\u7684\u4E8B\u4EF6\u53EF\u7528\uFF1A{0}\u3002
313 General_TEXT_COULD_NOT_DETERMINE_JAVA_VERSION=\u65E0\u6CD5\u786E\u5B9A Java \u7248\u672C\u3002
314 General_UNKNOWN_ADDRESS=&lt;\u672A\u77E5\u5730\u5740&gt;
315 General_UNKNOWN_FILE_NAME=&lt;\u672A\u77E5\u6587\u4EF6&gt;
316 HeapContentRule_AGGR_CLASS_SCORE=\u7C7B\u5F97\u5206
317 HeapContentRuleFactory_RULE_NAME=\u5806\u5185\u5BB9
318 HeapContentRuleFactory_TEXT_INFO=\u4EC5\u5C11\u6570\u51E0\u4E2A\u7C7B\u4F7F\u7528\u4E86\u5927\u90E8\u5206\u5806\u3002
319 HeapContentRuleFactory_TEXT_INFO_LONG=\u5982\u679C\u9700\u8981\u51CF\u5C11\u5806\u4F7F\u7528\u91CF\uFF0C\u8FD9\u662F\u4E00\u4E2A\u5F88\u597D\u7684\u5165\u624B\u70B9\u3002
320 HeapContentRuleFactory_TEXT_OK=\u5806\u5185\u5BB9\u4E2D\u672A\u53D1\u73B0\u95EE\u9898\u3002
321 HeapInspectionGcRuleFactory_RULE_NAME=\u5806\u68C0\u6D4B\u5BFC\u81F4\u7684 GC
322 # {0} is a number
323 HeapInspectionGcRuleFactory_TEXT_INFO=JVM \u6267\u884C\u4E86 {0} \u5806\u68C0\u6D4B\u5783\u573E\u6536\u96C6\u3002
324 HeapInspectionGcRuleFactory_TEXT_INFO_LONG=\u6267\u884C\u5806\u68C0\u6D4B\u5783\u573E\u6536\u96C6\u53EF\u80FD\u4F1A\u5B58\u5728\u95EE\u9898, \u56E0\u4E3A\u5B83\u4EEC\u901A\u5E38\u9700\u8981\u5F88\u591A\u65F6\u95F4\u3002
325 HeapInspectionGcRuleFactory_TEXT_INFO_LONG_JFR=\u8FD9\u4E9B\u68C0\u6D4B\u4E2D\u7684\u4E00\u90E8\u5206\u7531\u201C\u5BF9\u8C61\u8BA1\u6570\u201DJFR \u4E8B\u4EF6\u5BFC\u81F4\u3002\u5BF9\u4E8E\u542F\u7528\u4E86\u8BE5\u4E8B\u4EF6\u7684\u6BCF\u4E2A\u8BB0\u5F55\uFF0C\u5B83\u5728\u5F00\u59CB\u548C\u7ED3\u675F\u65F6\u89E6\u53D1\u5B8C\u6574\u5783\u573E\u6536\u96C6\u3002\u5982\u679C\u8BB0\u5F55\u4EC5\u6309\u9700\u751F\u6210\u6216\u8005\u4E0D\u662F\u5F88\u9891\u7E41\u751F\u6210\uFF0C\u5219\u8FD9\u4E9B\u5783\u573E\u6536\u96C6\u901A\u5E38\u4E0D\u662F\u95EE\u9898\uFF0C\u56E0\u4E3A\u5BFC\u81F4\u7684\u6682\u505C\u4E0D\u662F\u6B63\u5E38\u5E94\u7528\u7A0B\u5E8F\u884C\u4E3A\u7684\u4E00\u90E8\u5206\u3002\u5982\u679C\u7ECF\u5E38\u6536\u96C6\u8BB0\u5F55\uFF08\u4F8B\u5982\u901A\u8FC7\u81EA\u52A8\u811A\u672C\uFF09\uFF0C\u6216\u8005\u5982\u679C\u5E94\u7528\u7A0B\u5E8F\u5BF9\u6682\u505C\u654F\u611F\uFF0C\u5219\u53EF\u80FD\u4F1A\u53D8\u4E3A\u95EE\u9898\u3002\u5728\u8FD9\u79CD\u60C5\u51B5\u4E0B\uFF0C\u53EF\u4EE5\u8003\u8651\u7981\u7528\u201C\u5BF9\u8C61\u8BA1\u6570\u201D\u4E8B\u4EF6\u3002
326 HeapInspectionGcRuleFactory_TEXT_OK=JVM \u672A\u6267\u884C\u4EFB\u4F55\u5806\u68C0\u6D4B GC\u3002
327 HeapInspectionGcRuleFactory_TEXT_OK_LONG=JVM \u672A\u6267\u884C\u4EFB\u4F55\u5806\u68C0\u6D4B GC\u3002\u8FD9\u975E\u5E38\u597D\uFF0C\u56E0\u4E3A\u8FD9\u4E9B\u64CD\u4F5C\u901A\u5E38\u9700\u8981\u5F88\u591A\u65F6\u95F4\u3002
328 HeapInspectionRule_CONFIG_WARNING_LIMIT=\u5806\u68C0\u6D4B GC \u9650\u5236
329 HeapInspectionRule_CONFIG_WARNING_LIMIT_LONG=\u5806\u68C0\u6D4B\u5783\u573E\u6536\u96C6\u6570\u4E0E\u5783\u573E\u6536\u96C6\u603B\u6570\u4E4B\u95F4\u7684\u8B66\u544A\u9650\u5236\u6BD4\u7387
330 HighGcRuleFactory_RULE_NAME=GC \u538B\u529B
331 # {0} is a time period, {1} is a time stamp, {2} is a percentage
332 HighGcRuleFactory_TEXT_INFO=\u5728\u5F00\u59CB\u4E8E {1} \u7684 {0} \u671F\u95F4, JVM \u6682\u505C\u4E86 {2} \u65F6\u95F4\u3002
333 HighGcRuleFactory_TEXT_INFO_LONG=\u901A\u8FC7\u589E\u52A0\u5806\u5927\u5C0F\u6216\u8005\u5C1D\u8BD5\u51CF\u5C11\u5206\u914D, \u53EF\u4EE5\u51CF\u5C11\u6267\u884C\u5783\u573E\u6536\u96C6\u6240\u7528\u7684\u65F6\u95F4\u3002
334 HighGcRuleFactory_TEXT_OK=\u8FD0\u884C\u65F6\u6CA1\u6709\u82B1\u5F88\u591A\u65F6\u95F4\u6765\u6267\u884C\u5783\u573E\u6536\u96C6\u3002
335 HighJvmCpuRule_AGGR_MAX_ENDTIME=\u6700\u5927\u7ED3\u675F\u65F6\u95F4
336 HighJvmCpuRule_AGGR_MIN_ENDTIME=\u6700\u5C0F\u7ED3\u675F\u65F6\u95F4
337 HighJvmCpuRule_CONFIG_CPU_INFO_LIMIT=JVM CPU \u5360\u7528\u7387\u4FE1\u606F\u9650\u5236
338 HighJvmCpuRule_CONFIG_CPU_INFO_LIMIT_LONG=\u89E6\u53D1\u4FE1\u606F\u901A\u77E5\u65F6 JVM \u9700\u4F7F\u7528\u7684 CPU \u91CF
339 HighJvmCpuRule_CONFIG_MIN_CPU_LIMIT_LONG=\u89E6\u53D1\u8B66\u544A\u6240\u9700\u7684\u6700\u77ED CPU \u8D1F\u8F7D\u65F6\u6BB5
340 HighJvmCpuRule_CONFIG_MIN_CPULOAD=\u6700\u77ED CPU \u8D1F\u8F7D\u65F6\u6BB5
341 HighJvmCpuRule_CONFIG_SAMPLE_LIMIT=\u7F3A\u5C11\u6837\u672C\u9650\u5236
342 HighJvmCpuRule_CONFIG_SAMPLE_LIMIT_LONG=\u89E6\u53D1\u8B66\u544A\u6240\u9700\u7684\u6700\u5C11\u7F3A\u5C11\u6837\u672C\u6570
343 HighJvmCpuRule_FEW_SAMPLES=\u6B64\u8BB0\u5F55\u5305\u542B\u5C11\u91CF\u6982\u8981\u5206\u6790\u6837\u672C\uFF08\u5373\u4F7F CPU \u8D1F\u8F7D\u5F88\u9AD8\uFF09\u3002
344 HighJvmCpuRule_FEW_SAMPLES_LONG=\u56E0\u6B64, \u6982\u8981\u5206\u6790\u6570\u636E\u53EF\u80FD\u4E0D\u76F8\u5173\u3002\u8FD9\u53EF\u80FD\u662F\u56E0\u4E3A\u5E94\u7528\u7A0B\u5E8F\u8FD0\u884C\u4E86\u5927\u91CF JNI \u4EE3\u7801, \u6216\u8005 JVM \u82B1\u8D39\u4E86\u592A\u591A\u65F6\u95F4\u5728 GC, \u7C7B\u52A0\u8F7D, JIT \u7F16\u8BD1\u7B49\u64CD\u4F5C\u4E0A\u3002
345 HighJvmCpuRule_LONG_CPU_LOAD_PERIOD=\u6B64\u8BB0\u5F55\u5305\u542B &#39;CPU \u8D1F\u8F7D&#39; \u4E8B\u4EF6\u7684\u9AD8\u91C7\u6837\u65F6\u6BB5\u3002
346 # {0} is a time period
347 HighJvmCpuRule_LONG_CPU_LOAD_PERIOD_LONG=&#39;&#39;CPU \u8D1F\u8F7D&#39;&#39; \u4E8B\u4EF6\u7684\u91C7\u6837\u65F6\u6BB5\u8BBE\u7F6E\u4E3A {0}, \u8FD9\u5BF9\u4E8E\u4E0E CPU \u8D1F\u8F7D\u76F8\u5173\u7684\u89C4\u5219\u6B63\u5E38\u8FD0\u884C\u800C\u8A00\u592A\u9AD8\u3002
348 HighJvmCpuRule_RULE_NAME=\u9AD8 JVM CPU \u8D1F\u8F7D
349 HighJvmCpuRule_TEXT_OK=JVM \u4F3C\u4E4E\u4E0D\u5BFC\u81F4\u5927\u91CF CPU \u8D1F\u8F7D\u3002
350 HighJvmCpuRule_TEXT_WARN=JVM \u4EA7\u751F\u4E86\u5927\u91CF CPU \u8D1F\u8F7D\u3002
351 HotMethodsRuleFactory_NOT_ENOUGH_SAMPLES=\u65E0\u6CD5\u63D0\u53D6\u8DB3\u591F\u7684\u6267\u884C\u6837\u672C\u6765\u8BA1\u7B97\u5F97\u5206\u3002\u8BF7\u5C1D\u8BD5\u589E\u52A0\u5E94\u7528\u7A0B\u5E8F\u4E0A\u7684\u8D1F\u8F7D, \u7F29\u77ED\u91C7\u6837\u65F6\u6BB5\u6216\u8005\u5EF6\u957F\u8BB0\u5F55\u65F6\u95F4\u6765\u751F\u6210\u66F4\u591A\u6837\u672C\u3002
352 # {0} is a method name, {1} is a percentage, {2} is a duration of time
353 HotMethodsRuleFactory_TEXT_INFO=\u6700\u591A\u91C7\u6837\u7684\u65B9\u6CD5\u662F {0}\uFF0C\u5728\u8BB0\u5F55\u7684 {2} \u7A97\u53E3\u671F\u95F4\u5360\u53EF\u80FD\u6837\u672C\u7684 {1}\u3002
354 # {0} is a list of method names with a percentage and a timespan, {1} is the hottest stack trace
355 HotMethodsRuleFactory_TEXT_INFO_LONG=\u4EE5\u4E0B\u65B9\u6CD5\u662F\u5B9E\u73B0\u4EE3\u7801\u4F18\u5316\u7684\u6700\u53D7\u5173\u6CE8\u7684\u5019\u9009\u9879\uFF1A{0}&lt;p&gt;\u8FD9\u4E9B\u65B9\u6CD5\u662F\u5728\u5176\u7279\u5B9A\u8BB0\u5F55\u7A97\u53E3\u671F\u95F4\u6700\u591A\u91C7\u6837\u7684\u65B9\u6CD5\u3002\u4E3A\u6BCF\u79CD\u65B9\u6CD5\u663E\u793A\u7684\u767E\u5206\u6BD4\u8868\u793A\u5728\u8BE5\u7A97\u53E3\u671F\u95F4\u4E0E\u6700\u5927\u53EF\u80FD\u6837\u672C\u6570\u76F8\u6BD4\u5728\u591A\u5C11\u6267\u884C\u6837\u672C\u4E2D\u770B\u5230\u4E86\u8BE5\u65B9\u6CD5\u3002&lt;p&gt;\u6700\u5E38\u89C1\u5806\u6808\u8DDF\u8E2A\u4E3A\uFF1A{1}
356 HotMethodsRuleFactory_TEXT_OK=\u65E0\u6CD5\u68C0\u6D4B\u5230\u4EFB\u4F55\u7279\u522B\u9002\u5408\u8FDB\u884C\u4F18\u5316\u7684\u65B9\u6CD5\u3002
357 IgnoreUnrecognizedVMOptionsRuleFactory_TEXT_INFO=JVM \u5FFD\u7565\u4E86\u65E0\u6CD5\u8BC6\u522B\u7684 VM \u9009\u9879\u3002
358 IgnoreUnrecognizedVMOptionsRuleFactory_TEXT_INFO_LONG=\u5728\u5DF2\u5FFD\u7565\u65E0\u6CD5\u8BC6\u522B\u7684 VM \u9009\u9879\u7684 JVM \u4E0A\u6267\u884C\u4E86\u8BB0\u5F55\uFF0C\u8FD9\u610F\u5473\u7740\u4E0D\u68C0\u67E5\u662F\u5426\u5B58\u5728\u65E0\u6548 VM \u6807\u8BB0\u3002\u8FD9\u610F\u5473\u7740\u53EF\u80FD\u5B58\u5728\u67D0\u79CD\u60A8\u8BA4\u4E3A\u5DF2\u914D\u7F6E\u4F46\u5E76\u672A\u914D\u7F6E\u7684 VM \u884C\u4E3A\u3002\u8FD9\u53EF\u80FD\u662F\u56E0\u4E3A\u8FD0\u884C\u7684 VM \u4E0D\u652F\u6301\u8BE5\u884C\u4E3A\uFF0C\u6216\u8005\u56E0\u4E3A\u9009\u9879\u62FC\u5199\u9519\u8BEF\u3002\u9664\u975E\u5FC5\u8981\uFF0C\u8BF7\u907F\u514D\u4F7F\u7528 &#39;-XX:+IgnoreUnrecognizedVMOptions&#39; \u547D\u4EE4\u884C\u9009\u9879\u3002
359 # {0} is an object type with a field name, {1} is a number, {2} is another object type with a field name
360 IncreasingLiveSetRule_LOADED_CLASSES_PERCENT=\u52A0\u8F7D\u7684\u7C7B
361 IncreasingLiveSetRule_LOADED_CLASSES_PERCENT_DESC=\u6307\u793A\u542F\u52A8\u9636\u6BB5\u5DF2\u5B8C\u6210\u7684\u5DF2\u52A0\u8F7D\u7C7B\u767E\u5206\u6BD4\u3002\u8BE5\u89C4\u5219\u5FFD\u7565\u5728\u52A0\u8F7D\u4E86\u6B64\u6570\u91CF\u7684\u7C7B\u4E4B\u524D\u8FDB\u884C\u7684\u5206\u914D\u3002
362 IncreasingLiveSetRule_TEXT_INFO_BALANCED=\u4E0D\u5B58\u5728\u4F3C\u4E4E\u6CC4\u6F0F\u591A\u4E8E\u4EFB\u4F55\u5176\u4ED6\u7C7B\u7684\u7279\u5B9A\u7C7B\u3002
363 IncreasingLiveSetRule_TEXT_INFO_LONG=\u5728\u542F\u7528\u201C\u8DDF\u8E2A GC \u6839\u8DEF\u5F84\u201D\u9009\u9879\u7684\u60C5\u51B5\u4E0B\u6267\u884C\u8F6C\u50A8\uFF0C\u4EE5\u4FBF\u53EF\u4EE5\u5BF9\u6F5C\u5728\u5185\u5B58\u6CC4\u6F0F\u8FDB\u884C\u66F4\u8BE6\u7EC6\u7684\u5206\u6790\u3002
364 # {0} is a timestamp
365 IncreasingLiveSetRule_TEXT_INFO_NO_CANDIDATES=\u627E\u4E0D\u5230\u4EFB\u4F55\u6CC4\u6F0F\u5019\u9009\u9879\u3002\u8FD9\u53EF\u80FD\u662F\u56E0\u4E3A\u6240\u6709\u6F5C\u5728\u5019\u9009\u9879\u90FD\u4F4E\u4E8E\u914D\u7F6E\u7684\u9608\u503C\u3002\u8FD9\u8FD8\u53EF\u80FD\u662F\u7531\u4E8E\u5728 {0}\uFF08\u6B64\u65F6\u89C4\u5219\u5047\u5B9A\u5E94\u7528\u7A0B\u5E8F\u5C06\u4E0D\u518D\u5206\u914D\u5927\u7684\u957F\u671F\u5B58\u5728\u7684\u5BF9\u8C61\uFF09\u540E\u51FA\u73B0\u957F\u671F\u5B58\u5728\u7684\u5206\u914D\u800C\u5BFC\u81F4\u7684\u8BEF\u62A5\u3002
366 IncreasingLiveSetRule_TEXT_INFO_UNBALANCED=\u5B58\u5728\u4F3C\u4E4E\u6CC4\u6F0F\u591A\u4E8E\u5176\u4ED6\u7C7B\u7684\u4E00\u4E9B\u7C7B\u3002
367 IncreasingLiveSetRule_TEXT_OK=\u672A\u68C0\u6D4B\u5230\u5185\u5B58\u6CC4\u6F0F\u3002
368 IncreasingLiveSetRule_RELEVANCE_THRESHOLD=\u6CC4\u6F0F\u5019\u9009\u9879\u76F8\u5173\u6027\u9608\u503C
369 IncreasingLiveSetRule_RELEVANCE_THRESHOLD_DESC=\u8BA1\u7B97\u7684\u76F8\u5173\u6027\u9608\u503C\uFF0C\u786E\u5B9A\u6D3B\u52A8\u5BF9\u8C61\u662F\u5426\u89C6\u4E3A\u5185\u5B58\u6CC4\u6F0F\u65F6\u4F7F\u7528\u8BE5\u9608\u503C\u3002
370 IncreasingLiveSetRule_CANDIDATE_REFERRED_BY=\u5019\u9009\u9879\u7531\u6B64\u94FE\u5F15\u7528\u3002
371 IncreasingLiveSetRule_ELLIPSIS=...
372 # {0} is a number
373 IncreasingLiveSetRule_LEAK_CANDIDATES=\u5BF9\u5F15\u7528\u6811\u7684\u5206\u6790\u627E\u5230 {0} \u4E2A\u6CC4\u6F0F\u5019\u9009\u9879\u3002
374 IncreasingLiveSetRuleFactory_RULE_NAME=\u5806\u6D3B\u52A8\u96C6\u8D8B\u52BF
375 # {0} is a number denoted in Mebibytes per second
376 IncreasingLiveSetRuleFactory_TEXT_INFO=\u5728\u8BB0\u5F55\u671F\u95F4\uFF0C\u5806\u4E0A\u7684\u6D3B\u52A8\u96C6\u4F3C\u4E4E\u5728\u589E\u957F\uFF0C\u901F\u5EA6\u4E3A\u5927\u7EA6\u6BCF\u79D2 {0}\u3002
377 IncreasingLiveSetRuleFactory_TEXT_INFO_LONG=\u5982\u679C JVM \u6700\u8FD1\u5DF2\u542F\u52A8\uFF0C\u8FD9\u53EF\u80FD\u662F\u7531\u4E8E\u5E94\u7528\u7A0B\u5E8F\u4E2D\u7684\u5185\u5B58\u6CC4\u6F0F\u5BFC\u81F4\uFF0C\u6216\u8005\u8FD9\u53EF\u80FD\u662F\u77ED\u8BB0\u5F55\u7684 Artifact\u3002\u5728 JVM \u542F\u52A8\u540E\uFF0C\u8BB0\u5F55\u5F00\u59CB {0}\u3002\u901A\u8FC7\u4F7F\u7528\u201C\u65E7\u5BF9\u8C61\u6837\u672C\u201D\u4E8B\u4EF6\uFF08\u5982\u679C\u53EF\u7528\uFF09\uFF0C\u53EF\u4EE5\u6536\u96C6\u66F4\u591A\u4FE1\u606F\u3002
378 IncreasingMetaspaceLiveSetRuleFactory_RULE_NAME=\u5143\u7A7A\u95F4\u6D3B\u52A8\u96C6\u8D8B\u52BF
379 IncreasingMetaspaceLiveSetRuleFactory_TEXT_INFO=\u5728\u8BB0\u5F55\u671F\u95F4\uFF0C\u5143\u7A7A\u95F4\u4E2D\u7684\u7C7B\u6570\u636E\u4F3C\u4E4E\u5728\u6301\u7EED\u589E\u957F\u3002
380 IncreasingMetaspaceLiveSetRuleFactory_TEXT_INFO_LONG=\u6B64\u884C\u4E3A\u53EF\u80FD\u8868\u660E\u5143\u7A7A\u95F4\u4E2D\u5B58\u5728\u5185\u5B58\u6CC4\u6F0F\uFF0C\u8FD9\u53EF\u80FD\u662F\u7531\u4E8E\u5E94\u7528\u7A0B\u5E8F\u672A\u6309\u7167\u8981\u6C42\u5378\u8F7D\u7C7B\u3002
381 IncreasingMetaspaceLiveSetRuleFactory_TEXT_OK=\u5728\u8BB0\u5F55\u671F\u95F4, \u7C7B\u6570\u636E\u4F3C\u4E4E\u6CA1\u6709\u589E\u957F\u3002
382 JavaBlocking_RULE_NAME=Java \u963B\u6B62
383 JavaBlockingRule_AGGR_BALANCE_BY_INSTANCE=\u6309\u5B9E\u4F8B
384 JavaBlockingRule_AGGR_BALANCE_BY_THREAD=\u6309\u7EBF\u7A0B
385 JavaBlockingRule_CONFIG_EXCLUDED_THREADS=Java \u963B\u6B62\u5DF2\u6392\u9664\u7EBF\u7A0B\u540D\u79F0
386 JavaBlockingRule_CONFIG_EXCLUDED_THREADS_LONG=\u63CF\u8FF0\u6392\u9664\u54EA\u4E9B\u7EBF\u7A0B\u540D\u79F0\u7684\u6B63\u5219\u8868\u8FBE\u5F0F\uFF0C\u4F8B\u5982 &#39;(.*weblogic\\.socket\\.Muxer.*|MyExcludedThreadName)&#39;
387 # {0} is a regexp exclude string
388 JavaBlockingRule_TEXT_EXCLUDED_THREADS=\u4F7F\u7528\u4EE5\u4E0B\u6B63\u5219\u8868\u8FBE\u5F0F\u4ECE\u6B64\u89C4\u5219\u4E2D\u6392\u9664\u7EBF\u7A0B\uFF1A&#39;&#39;{0}&#39;&#39;
389 # {0} is a time period
390 JavaBlockingRule_TEXT_INFO=\u5E94\u7528\u7A0B\u5E8F\u4E2D\u7684\u7EBF\u7A0B\u5728\u9501\u5B9A\u4E0A\u88AB\u963B\u6B62, \u603B\u65F6\u95F4\u4E3A {0}\u3002
391 JavaBlockingRule_TEXT_MESSAGE=\u672A\u53D1\u73B0\u6709\u5173\u9501\u4E89\u7528\u7684\u5927\u91CF\u95EE\u9898\u3002
392 # {0} is a class name, {1} is a number
393 JavaBlockingRule_TEXT_MOST_BLOCKED_CLASS=\u6700\u5E38\u7528\u7684\u76D1\u89C6\u5668\u7C7B\u4E3A &#39;&#39;{0}&#39;&#39;\uFF0C\u5176\u88AB\u963B\u6B62 {1} \u6B21\u3002
394 # {0} is a thread name, {1} is a number
395 JavaBlockingRule_TEXT_MOST_BLOCKED_THREAD=\u6700\u5E38\u7528\u7684\u7EBF\u7A0B\u4E3A &#39;&#39;{0}&#39;&#39;\uFF0C\u5176\u88AB\u963B\u6B62 {1} \u6B21\u3002
396 JavaBlockingRule_TEXT_OK=\u672A\u53D1\u73B0\u6709\u5173\u9501\u4E89\u7528\u7684\u95EE\u9898\u3002
397 LongGcPauseRuleFactory_RULE_NAME=GC \u6682\u505C\u5CF0\u503C\u6301\u7EED\u65F6\u95F4
398 # {0} is a time period
399 LongGcPauseRuleFactory_TEXT_INFO=\u6700\u957F\u7684 GC \u6682\u505C\u4E3A {0}\u3002
400 LongGcPauseRuleFactory_TEXT_INFO_G1=\u60A8\u53EF\u80FD\u5E0C\u671B\u4F7F\u7528\u4E3A\u51CF\u5C11\u5783\u573E\u6536\u96C6\u5668\u6682\u505C\u800C\u6784\u5EFA\u7684 G1 \u5783\u573E\u6536\u96C6\u5668\u3002\u8981\u542F\u7528 G1\uFF0C\u8BF7\u5C06 &#39;-XX:+UseG1GC&#39; \u6DFB\u52A0\u5230\u547D\u4EE4\u884C\u3002
401 # {0} is a size in bytes, {1} is a size in bytes
402 LongGcPauseRuleFactory_TEXT_INFO_MX=\u5E94\u7528\u7A0B\u5E8F\u4F7F\u7528 {0} \u7684\u6D3B\u52A8\u96C6\u548C {1} \u7684\u5806\u5927\u5C0F\u8FD0\u884C\u3002\u964D\u4F4E\u5806\u5927\u5C0F\u53EF\u80FD\u4F1A\u51CF\u5C11\u5783\u573E\u6536\u96C6\u6682\u505C\u65F6\u95F4\u3002
403 LongGcPauseRuleFactory_TEXT_INFO_REFERENCES=\u5904\u7406\u5F15\u7528\u5BF9\u8C61\u662F\u5783\u573E\u6536\u96C6\u5668\u6682\u505C\u7684\u4E00\u4E2A\u91CD\u8981\u90E8\u5206\u3002\u901A\u8FC7\u51CF\u5C11\u5F15\u7528\u6570\u91CF\u6216\u8005\u4F7F\u7528 &#39;-XX:+ParallelRefProcEnabled&#39; \u542F\u7528\u5E76\u884C\u5F15\u7528\u5904\u7406\u53EF\u4EE5\u51CF\u5C11\u6B64\u9879\u3002
404 LongGcPauseRuleFactory_TEXT_OK=\u5E94\u7528\u7A0B\u5E8F\u672A\u5BFC\u81F4\u4EFB\u4F55\u957F GC \u6682\u505C\u65F6\u95F4\u3002
405 LongGcPauseRule_CONFIG_INFO_LIMIT=GC \u6682\u505C\u8B66\u544A\u9650\u5236
406 LongGcPauseRule_CONFIG_INFO_LIMIT_LONG=\u89E6\u53D1\u8B66\u544A\u6240\u9700\u7684 GC \u6682\u505C\u65F6\u95F4
407 LowOnPhysicalMemoryFactory_RULE_NAME=\u7A7A\u95F2\u7269\u7406\u5185\u5B58
408 # {0} is a percentage
409 LowOnPhysicalMemoryFactory_TEXT_INFO=\u6700\u5927\u5DF2\u7528\u5185\u5B58\u91CF\u4E3A\u53EF\u7528\u7269\u7406\u5185\u5B58\u7684 {0}\u3002
410 # {0} is a size in bytes, {1} is a percentage, {2} is a size in bytes
411 LowOnPhysicalMemoryFactory_TEXT_INFO_LONG=\u6700\u5927\u5DF2\u7528\u5185\u5B58\u91CF\u4E3A {0}\u3002\u8FD9\u662F {2} \u53EF\u7528\u7269\u7406\u5185\u5B58\u7684 {1}\u3002\u53EA\u6709\u5C11\u91CF\u7A7A\u95F2\u5185\u5B58\u53EF\u80FD\u4F1A\u5BFC\u81F4\u4EA4\u6362\uFF0C\u5176\u6210\u672C\u975E\u5E38\u9AD8\u6602\u3002\u8981\u907F\u514D\u8FD9\u79CD\u60C5\u51B5\uFF0C\u8BF7\u51CF\u5C11\u5185\u5B58\u4F7F\u7528\u91CF\u6216\u8005\u589E\u52A0\u53EF\u7528\u5185\u5B58\u91CF\u3002
412 LowOnPhysicalMemoryFactory_TEXT_OK=\u5728\u6B64\u8BB0\u5F55\u671F\u95F4, \u7CFB\u7EDF\u5E76\u672A\u51FA\u73B0\u7269\u7406\u5185\u5B58\u4E0D\u8DB3\u7684\u60C5\u51B5\u3002
413 ManagementAgentRule_TEXT_INFO=\u7BA1\u7406\u4EE3\u7406\u8BBE\u7F6E\uFF08\u7AEF\u53E3\u3001\u9A8C\u8BC1\u548C/\u6216 SSL\uFF09\u5728\u8FD0\u884C\u65F6\u671F\u95F4\u5DF2\u66F4\u6539
414 ManagementAgentRule_TEXT_INFO_LONG=\u7BA1\u7406\u4EE3\u7406\u8BBE\u7F6E\uFF08\u7AEF\u53E3\u3001\u9A8C\u8BC1\u548C/\u6216 SSL\uFF09\u5728\u8FD0\u884C\u65F6\u671F\u95F4\u5DF2\u66F4\u6539\uFF0C\u8FD9\u4F3C\u4E4E\u6CA1\u6709\u4EFB\u4F55\u6548\u679C\uFF0C\u4E0D\u8FC7\u5BF9\u4E8E\u8C03\u67E5\u4F1A\u6709\u7528\u3002
415 ManagmentAgentRuleFactory_RULE_NAME=\u4E0D\u5EFA\u8BAE\u7684\u7BA1\u7406\u4EE3\u7406\u8BBE\u7F6E
416 ManagmentAgentRuleFactory_TEXT_INFO_SSL_DISABLED=\u4E0D\u5B89\u5168\u7684\u7BA1\u7406\u4EE3\u7406\u8BBE\u7F6E: \u5DF2\u7981\u7528 SSL\u3002
417 ManagmentAgentRuleFactory_TEXT_INFO_SSL_DISABLED_LONG=\u8FD0\u884C\u65F6\u7BA1\u7406\u4EE3\u7406\u8BBE\u7F6E\u4E0D\u5B89\u5168\u3002\u5DF2\u7981\u7528 SSL/TLS\u3002\u7531\u4E8E\u8FD9\u4F1A\u5BFC\u81F4\u6D41\u91CF\u4E0D\u5B89\u5168, \u5EFA\u8BAE\u4E0D\u8981\u8FD9\u6837\u8BBE\u7F6E\u751F\u4EA7\u7CFB\u7EDF\u3002
418 ManagmentAgentRuleFactory_TEXT_OK=\u7BA1\u7406\u4EE3\u7406\u8BBE\u7F6E\u4E2D\u672A\u53D1\u73B0\u95EE\u9898\u3002
419 ManagmentAgentRuleFactory_TEXT_WARN_AUTH_DISABLED=\u4E0D\u5B89\u5168\u7684\u7BA1\u7406\u4EE3\u7406\u8BBE\u7F6E: \u5DF2\u7981\u7528\u53E3\u4EE4\u9A8C\u8BC1\u3002
420 ManagmentAgentRuleFactory_TEXT_WARN_AUTH_DISABLED_LONG=\u8FD0\u884C\u65F6\u7BA1\u7406\u4EE3\u7406\u8BBE\u7F6E\u4E0D\u5B89\u5168\u3002\u5DF2\u7981\u7528\u53E3\u4EE4\u9A8C\u8BC1\u3002\u5982\u679C\u8FDC\u7A0B\u7528\u6237\u77E5\u9053 (\u6216\u8005\u731C\u51FA) \u7AEF\u53E3\u53F7\u548C\u4E3B\u673A\u540D, \u5219\u5C06\u80FD\u591F\u76D1\u89C6\u548C\u63A7\u5236 Java \u5E94\u7528\u7A0B\u5E8F\u53CA\u5E73\u53F0\u3002\u5BF9\u4E8E\u751F\u4EA7\u7CFB\u7EDF, \u5F3A\u70C8\u5EFA\u8BAE\u4E0D\u8981\u8FD9\u6837\u8BBE\u7F6E\u3002
421 ManagmentAgentRuleFactory_TEXT_WARN_BOTH_DISABLED=\u4E0D\u5B89\u5168\u7684\u7BA1\u7406\u4EE3\u7406\u8BBE\u7F6E: \u53E3\u4EE4\u9A8C\u8BC1\u548C SSL \u5747\u5DF2\u7981\u7528\u3002
422 ManagmentAgentRuleFactory_TEXT_WARN_BOTH_DISABLED_LONG=\u8FD0\u884C\u65F6\u7BA1\u7406\u4EE3\u7406\u8BBE\u7F6E\u4E0D\u5B89\u5168\u3002\u5BC6\u7801\u9A8C\u8BC1\u548C SSL \u5747\u5DF2\u7981\u7528\u3002\u5982\u679C\u8FDC\u7A0B\u7528\u6237\u77E5\u9053\uFF08\u6216\u8005\u731C\u51FA\uFF09\u7AEF\u53E3\u53F7\u548C\u4E3B\u673A\u540D\uFF0C\u5219\u5C06\u80FD\u591F\u76D1\u89C6\u548C\u63A7\u5236 Java \u5E94\u7528\u7A0B\u5E8F\u53CA\u5E73\u53F0\u3002\u5BF9\u4E8E\u751F\u4EA7\u7CFB\u7EDF\uFF0C\u5F3A\u70C8\u5EFA\u8BAE\u4E0D\u8981\u8FD9\u6837\u8BBE\u7F6E\u3002
423 ManagmentAgentRuleFactory_TEXT_WARN_CONFIGURE_GUIDE=\u6709\u5173\u5982\u4F55\u914D\u7F6E\u7BA1\u7406\u4EE3\u7406\u7684\u8BE6\u7EC6\u4FE1\u606F\uFF0C\u8BF7\u53C2\u9605 &lt;a href=&quot;https://docs.oracle.com/javase/8/docs/technotes/guides/management/agent.html&quot;&gt;Java Monitoring and Management Guide&lt;/a&gt;\u3002
424 ManyRunningProcessesRule_RULE_NAME=\u4E89\u7528\u8FDB\u7A0B
425 # {0} is a number, {1} is a time stamp
426 ManyRunningProcessesRule_TEXT_INFO=\u751F\u6210\u6B64\u98DE\u884C\u8BB0\u5F55\u65F6\uFF0C{0} \u4E2A\u8FDB\u7A0B\u6B63\u5728\u8FD0\u884C\u3002
427 # {0} is a number, {1} is a time stamp
428 ManyRunningProcessesRule_TEXT_INFO_LONG=\u5728 {1}\uFF0C\u5171 {0} \u4E2A\u5176\u4ED6\u8FDB\u7A0B\u6B63\u5728\u751F\u6210\u6B64\u98DE\u884C\u8BB0\u5F55\u7684\u4E3B\u673A\u4E0A\u8FD0\u884C\u3002
429 ManyRunningProcessesRule_TEXT_RECOMMENDATION=\u5982\u679C\u8FD9\u662F\u670D\u52A1\u5668\u73AF\u5883\uFF0C\u5219\u53EA\u5728\u8BE5\u8BA1\u7B97\u673A\u4E0A\u8FD0\u884C\u5176\u4ED6\u5173\u952E\u8FDB\u7A0B\u53EF\u80FD\u4F1A\u66F4\u597D\u3002
430 ManyRunningProcessesRule_INFO_LIMIT=\u4E89\u7528\u8FDB\u7A0B\u9650\u5236
431 ManyRunningProcessesRule_INFO_LIMIT_LONG=\u89E6\u53D1\u4FE1\u606F\u901A\u77E5\u9700\u8981\u540C\u65F6\u8FD0\u884C\u7684\u8FDB\u7A0B\u6570
432 MetaspaceOomRuleFactory_RULE_NAME=\u5143\u7A7A\u95F4\u5185\u5B58\u4E0D\u8DB3
433 MetaspaceOomRuleFactory_TEXT_OK=\u6B64\u8BB0\u5F55\u671F\u95F4\u5143\u7A7A\u95F4\u672A\u8017\u5C3D\u3002
434 # {0} is a number
435 MetaspaceOomRuleFactory_TEXT_WARN=\u6B64\u8BB0\u5F55\u4E2D\u5B58\u5728 {0} &#39;&#39;\u5143\u7A7A\u95F4\u5185\u5B58\u4E0D\u8DB3&#39;&#39; \u4E8B\u4EF6\u3002
436 MetaspaceOomRuleFactory_TEXT_WARN_LONG=\u589E\u52A0\u6216\u5220\u9664 &#39;-XX:MaxMetaSpaceSize&#39; \u6807\u8BB0\u6216\u8005\u8C03\u67E5\u4E3A\u4EC0\u4E48\u7C7B\u6CA1\u6709\u6B63\u786E\u5378\u8F7D\u3002
437 MethodProfilingDataProvider_AGGR_AGGR_TOP_FRAME_QUOTA=\u9876\u90E8\u5E27\u9650\u989D
438 MethodProfilingDataProvider_AGGR_AGGR_TOP_FRAME_QUOTA_DESC=\u9876\u90E8\u5E27\u4E0E\u91C7\u6837\u603B\u6570\u4E4B\u95F4\u7684\u9650\u989D
439 MethodProfilingDataProvider_AGGR_MAX_ENDTIME=\u6700\u5927\u7ED3\u675F\u65F6\u95F4
440 MethodProfilingDataProvider_AGGR_MIN_ENDTIME=\u6700\u5C0F\u7ED3\u675F\u65F6\u95F4
441 MethodProfilingDataProvider_AGGR_TOP_FRAME_BALANCE=\u9876\u90E8\u5E27\u4F59\u989D
442 MethodProfilingDataProvider_AGGR_TOP_FRAME_BALANCE_DESC=\u5806\u6808\u8DDF\u8E2A\u9876\u90E8\u5E27\u4E4B\u95F4\u7684\u76F8\u5BF9\u4F59\u989D
443 MethodProfilingRule_RULE_NAME=\u65B9\u6CD5\u6982\u8981\u5206\u6790
444 MethodProfilingRule_WINDOW_SIZE=\u65B9\u6CD5\u6982\u8981\u5206\u6790\u7A97\u53E3\u5927\u5C0F
445 MethodProfilingRule_WINDOW_SIZE_DESC=\u5728\u6B64\u8BB0\u5F55\u4E2D\u7528\u4E8E\u8BC4\u4F30\u65B9\u6CD5\u6982\u8981\u5206\u6790\u6837\u672C\u7684\u6ED1\u52A8\u7A97\u53E3\u7684\u5927\u5C0F\u3002\u5982\u679C\u6B64\u89C4\u5219\u7684\u8BC4\u4F30\u7528\u65F6\u8FC7\u957F, \u8BF7\u8003\u8651\u589E\u52A0\u8BE5\u53C2\u6570\u3002\u8BF7\u6CE8\u610F, \u589E\u52A0\u7A97\u53E3\u5927\u5C0F\u53EF\u80FD\u4F1A\u51CF\u5C11\u89C4\u5219\u7684\u7CBE\u5EA6\u3002
446 MethodProfilingRule_EXCLUDED_PACKAGES=\u8981\u4ECE\u5806\u6808\u8DDF\u8E2A\u4E2D\u6392\u9664\u7684\u5305
447 MethodProfilingRule_EXCLUDED_PACKAGES_DESC=\u904D\u5386\u5806\u6808\u8DDF\u8E2A\u65F6\u8981\u6392\u9664\u7684\u5305\u3002\u5220\u9664\u4E0E\u6A21\u5F0F\u5339\u914D\u7684\u6240\u6709\u5E27\uFF0C\u76F4\u5230\u8FBE\u5230\u4E0D\u5C5E\u4E8E\u4EFB\u4E00\u9879\u7684\u7B2C\u4E00\u4E2A\u5E27\u3002\u6539\u4E3A\u5C06\u9047\u5230\u7684\u7B2C\u4E00\u4E2A\u5E27\u89C6\u4E3A\u70ED\u5E27\u3002
448 # {0} is a number, {1} is a number
449 NumberOfGcThreadsRuleFactory_TEXT_INFO=\u8FD0\u884C\u65F6\u5728\u6709 {1} \u4E2A CPU \u6838\u5FC3\u7684\u8BA1\u7B97\u673A\u4E0A\u4F7F\u7528\u4E86 {0} \u4E2A GC \u7EBF\u7A0B\u3002
450 NumberOfGcThreadsRuleFactory_TEXT_INFO_LONG=\u4F7F\u7528\u8D85\u8FC7\u53EF\u7528\u6838\u5FC3\u6570\u7684 GC \u7EBF\u7A0B\u6570\u5E76\u975E\u6700\u4F73\u8BBE\u7F6E\u3002\u5220\u9664 &#39;-XX:ParallelGCThreads&#39; \u6807\u8BB0\u5C06\u5141\u8BB8 JVM \u81EA\u52A8\u8BBE\u7F6E GC \u7EBF\u7A0B\u6570\u3002
451 ObjectStatisticsDataProvider_AGGR_LIVE_SIZE_INCREASE=\u5B9E\u65F6\u5927\u5C0F\u589E\u957F
452 ObjectStatisticsDataProvider_AGGR_LIVE_SIZE_INCREASE_DESC=\u7B2C\u4E00\u6B21\u5783\u573E\u6536\u96C6\u4E4B\u540E\u4E0E\u6700\u540E\u4E00\u6B21\u5783\u573E\u6536\u96C6\u4E4B\u540E\u7684\u603B\u8BA1\u5927\u5C0F\u4E4B\u5DEE
453 OptionsCheckRule_CONFIG_ACCEPTED_OPTIONS=\u63A5\u53D7\u7684\u9009\u9879
454 OptionsCheckRule_CONFIG_ACCEPTED_OPTIONS_LONG=\u89C4\u5219\u5C06\u4E0D\u68C0\u67E5\u6B64\u9017\u53F7\u5206\u9694\u5217\u8868\u4E2D\u7684 -XX\uFF08\u672A\u9A8C\u8BC1\uFF09JVM \u9009\u9879\u540D\u79F0
455 OptionsCheckRule_RULE_NAME=\u547D\u4EE4\u884C\u9009\u9879\u68C0\u67E5
456 # {0} is a Java version string
457 OptionsCheckRule_TEXT_DEPRECATED=\u5728 Java {0} \u4E2D\u5E9F\u5F03\u3002
458 # {0} is a Java version string, {1} is a Java version string
459 OptionsCheckRule_TEXT_DEPRECATED_IGNORED=\u5728 Java {0} \u4E2D\u5E9F\u5F03\u5E76\u5728 Java {1} \u4E2D\u5FFD\u7565\u3002
460 # {0} is a Java version string, {1} is a Java version string, {2} is a Java version string
461 OptionsCheckRule_TEXT_DEPRECATED_IGNORED_REMOVED=\u5728 Java {0} \u4E2D\u5E9F\u5F03, \u5728 Java {1} \u4E2D\u5FFD\u7565\u5E76\u5728 Java {2} \u4E2D\u5220\u9664\u3002
462 # {0} is a Java version string, {1} is a Java version string
463 OptionsCheckRule_TEXT_DEPRECATED_REMOVED=\u5728 Java {0} \u4E2D\u5E9F\u5F03\u5E76\u5728 Java {1} \u4E2D\u5220\u9664\u3002
464 OptionsCheckRule_TEXT_DEPRECATED_WARNING=\u5E94\u907F\u514D\u4F7F\u7528\u5DF2\u5E9F\u5F03\u7684\u9009\u9879\u6807\u8BB0\u3002\u5728\u4E00\u4E9B\u60C5\u51B5\u4E0B\u5B83\u4EEC\u4F1A\u542F\u7528\u65E7\u4EE3\u7801, \u5728\u53E6\u4E00\u4E9B\u60C5\u51B5\u4E0B\u5B83\u4EEC\u5219\u4F1A\u88AB\u5B8C\u5168\u5FFD\u7565\u3002\u8FD9\u4E9B\u6807\u8BB0\u901A\u5E38\u4F1A\u5728\u4EE5\u540E\u7684 Java \u53D1\u884C\u7248\u4E2D\u5220\u9664\u3002
465 # {0} is a Java version string
466 OptionsCheckRule_TEXT_IGNORED=\u5728 Java {0} \u4E2D\u5FFD\u7565\u3002
467 # {0} is a Java version string, {1} is a Java version string
468 OptionsCheckRule_TEXT_IGNORED_REMOVED=\u5728 Java {0} \u4E2D\u5FFD\u7565\u5E76\u5728 Java {1} \u4E2D\u5220\u9664\u3002
469 OptionsCheckRule_TEXT_NA=\u672A\u8BB0\u5F55\u4EFB\u4F55\u5E26\u6709 JVM \u53C2\u6570\u7684\u4E8B\u4EF6\u3002
470 OptionsCheckRule_TEXT_OK=\u672A\u68C0\u6D4B\u5230\u4EFB\u4F55\u975E\u6B63\u5F0F\u6307\u5B9A, \u5DF2\u5E9F\u5F03\u6216\u975E\u5EFA\u8BAE\u7684\u9009\u9879\u6807\u8BB0\u3002
471 OptionsCheckRule_TEXT_UNDOC_DEPR_NOTREC=\u68C0\u6D4B\u5230\u975E\u6B63\u5F0F\u6307\u5B9A\u3001\u5DF2\u5E9F\u5F03\u548C\u975E\u5EFA\u8BAE\u7684\u9009\u9879\u6807\u8BB0\u3002
472 OptionsCheckRule_TEXT_UNDOC_DEPR=\u68C0\u6D4B\u5230\u975E\u6B63\u5F0F\u6307\u5B9A\u548C\u5DF2\u5E9F\u5F03\u7684\u9009\u9879\u6807\u8BB0\u3002
473 OptionsCheckRule_TEXT_UNDOC_NOTREC=\u68C0\u6D4B\u5230\u975E\u6B63\u5F0F\u6307\u5B9A\u548C\u975E\u5EFA\u8BAE\u7684\u9009\u9879\u6807\u8BB0\u3002
474 OptionsCheckRule_TEXT_DEPR_NOTREC=\u68C0\u6D4B\u5230\u5DF2\u5E9F\u5F03\u548C\u975E\u5EFA\u8BAE\u7684\u9009\u9879\u6807\u8BB0\u3002
475 OptionsCheckRule_TEXT_UNDOC=\u68C0\u6D4B\u5230\u975E\u6B63\u5F0F\u6307\u5B9A\u7684\u9009\u9879\u6807\u8BB0\u3002
476 OptionsCheckRule_TEXT_DEPR=\u68C0\u6D4B\u5230\u5DF2\u5E9F\u5F03\u7684\u9009\u9879\u6807\u8BB0\u3002
477 OptionsCheckRule_TEXT_NOTREC=\u68C0\u6D4B\u5230\u975E\u5EFA\u8BAE\u7684\u9009\u9879\u6807\u8BB0\u3002
478 OptionsCheckRule_TEXT_GENERAL_PROBLEM=\u68C0\u6D4B\u5230\u9009\u9879\u6807\u8BB0\u95EE\u9898\u3002
479 OptionsCheckRule_TEXT_OPTION_DEPRECATED=\u5DF2\u7ECF\u6216\u5C06\u8981\u5E9F\u5F03\u4EE5\u4E0B\u9009\u9879\u6807\u8BB0\u3002
480 OptionsCheckRule_TEXT_OPTION_NOT_DOCUMENTED=\u672A\u6B63\u5F0F\u6307\u5B9A\u4EE5\u4E0B\u9009\u9879\u6807\u8BB0\u3002
481 OptionsCheckRule_TEXT_OPTION_NOT_RECOMMENDED=\u672A\u5EFA\u8BAE\u4EE5\u4E0B\u9009\u9879\u6807\u8BB0\u3002
482 OptionsCheckRule_TEXT_OPTIONS_DEPRECATED=\u5DF2\u7ECF\u6216\u5C06\u8981\u5E9F\u5F03\u4EE5\u4E0B\u9009\u9879\u6807\u8BB0\u3002
483 OptionsCheckRule_TEXT_OPTIONS_NOT_DOCUMENTED=\u672A\u6B63\u5F0F\u6307\u5B9A\u4EE5\u4E0B\u9009\u9879\u6807\u8BB0\u3002
484 OptionsCheckRule_TEXT_OPTIONS_NOT_RECOMMENDED=\u672A\u5EFA\u8BAE\u4EE5\u4E0B\u9009\u9879\u6807\u8BB0\u3002
485 # {0} is a Java version string
486 OptionsCheckRule_TEXT_REMOVED=\u5728 Java {0} \u4E2D\u5220\u9664\u3002
487 OptionsCheckRule_TEXT_UNDOCUMENTED_WARNING=\u672A\u6B63\u5F0F\u6307\u5B9A\u7684\u6807\u8BB0\u53EF\u80FD\u5F71\u54CD JVM, \u5176\u6548\u679C\u53EF\u80FD\u4E0D\u4F1A\u5373\u65F6\u663E\u793A\u51FA\u6765, \u8FD9\u4E9B\u6807\u8BB0\u4E5F\u53EF\u80FD\u4F1A\u5728\u672A\u6765\u7684\u53D1\u884C\u7248\u4E2D\u4E0D\u7ECF\u8B66\u544A\u5220\u9664\u3002
488 OptionsCheckRule_TEXT_USE_MAXRAMFRACTION=\u6539\u7528 MaxRAMFraction
489 OverAggressiveRecordingSettingRuleFactory_RULE_NAME=\u4E0D\u5EFA\u8BAE\u7684\u8BB0\u5F55\u8BBE\u7F6E
490 OverAggressiveRecordingSettingRuleFactory_RULE_TEXT_OK=\u8BB0\u5F55\u8BBE\u7F6E\u4E2D\u672A\u53D1\u73B0\u95EE\u9898\u3002
491 OverAggressiveRecordingSettingRuleFactory_TEXT_INFO=\u4EE5\u4E0B\u4E8B\u4EF6\u7C7B\u578B\u6CA1\u6709\u9608\u503C: {0}\u3002
492 # {0} is a list of event type names
493 OverAggressiveRecordingSettingRuleFactory_TEXT_INFO_LONG=\u6CA1\u6709\u9608\u503C\u7684\u4E8B\u4EF6\u7C7B\u578B\u4F1A\u5BFC\u81F4\u751F\u6210\u5927\u91CF\u7684\u4E8B\u4EF6, \u53EF\u80FD\u4F1A\u8F6C\u6362\u4E3A\u8F83\u9AD8\u7684\u5F00\u9500\u3002\u5982\u679C\u8FD9\u5E76\u975E\u9884\u671F, \u8BF7\u68C0\u67E5\u6A21\u677F\u4E2D\u7684\u8BBE\u7F6E\u4EE5\u83B7\u5F97\u66F4\u591A\u8BB0\u5F55\u3002
494 ParGcFewThreadsRuleFactory_TEXT_INFO=JVM \u5728\u8FD0\u884C\u7684\u65F6\u5019\u4F7F\u7528\u5E76\u884C GC\uFF0C\u4F46\u53EA\u6709\u4E00\u4E2A GC \u7EBF\u7A0B\u3002
495 ParGcFewThreadsRuleFactory_TEXT_INFO_LONG=JVM \u5728\u8FD0\u884C\u7684\u65F6\u5019\u4F7F\u7528\u5E76\u884C GC\uFF0C\u4F46\u53EA\u6709\u4E00\u4E2A GC \u7EBF\u7A0B\u3002\u8FD9\u5E76\u975E\u6700\u4F18\u3002\u8981\u66F4\u6539 GC \u7EBF\u7A0B\u6570\uFF0C\u8BF7\u4F7F\u7528\u547D\u4EE4\u884C\u6807\u8BB0 &lt;a href=&quot;https://docs.oracle.com/javase/8/docs/technotes/guides/vm/gctuning/parallel.html&quot;&gt;-XX:ParallelGCThreads=X&lt;/a&gt;\u3002\u5728\u4E0D\u4F7F\u7528 &#39;-XX:ParallelGCThreads&#39; \u6807\u8BB0\u7684\u60C5\u51B5\u4E0B\u8FD0\u884C\u65F6\uFF0CJVM \u5C06\u81EA\u52A8\u4F7F\u7528\u5408\u9002\u6570\u91CF\u7684 GC \u7EBF\u7A0B\u3002
496 ParallelOnSingleCpuRuleFactory_TEXT_INFO=\u8FD0\u884C\u65F6\u5728\u5355\u6838\u8BA1\u7B97\u673A\u4E0A\u4F7F\u7528\u4E86\u5E76\u884C GC\u3002
497 ParallelOnSingleCpuRuleFactory_TEXT_INFO_LONG=\u8FD0\u884C\u65F6\u5728\u5355\u6838\u8BA1\u7B97\u673A\u4E0A\u4F7F\u7528\u4E86\u5E76\u884C GC\u3002\u8FD9\u5E76\u975E\u6700\u4F18\u3002\u8BF7\u6539\u4E3A\u4F7F\u7528&lt;a href=&quot;https://docs.oracle.com/javase/8/docs/technotes/guides/vm/gctuning/collectors.html&quot;&gt;\u4E32\u884C\u6536\u96C6\u5668&lt;/a&gt;\uFF0C\u6B64\u6536\u96C6\u5668\u9488\u5BF9\u5355\u6838\u8BA1\u7B97\u673A\u8FDB\u884C\u4E86\u4F18\u5316\u3002
498 VerifyNoneRule_WLS_TEXT_INFO=\u5E94\u7528\u7A0B\u5E8F\u6B63\u5728\u7981\u7528\u5B57\u8282\u7801\u9A8C\u8BC1\u7684\u60C5\u51B5\u4E0B\u8FD0\u884C WebLogic Server\u3002
499 VerifyNoneRule_WLS_TEXT_INFO_LONG=\u5E94\u7528\u7A0B\u5E8F\u6B63\u5728\u7981\u7528\u5B57\u8282\u7801\u9A8C\u8BC1\u7684\u60C5\u51B5\u4E0B\u8FD0\u884C WebLogic Server\u3002\u867D\u7136\u901A\u5E38\u4E0D\u5EFA\u8BAE\uFF0C\u4F46\u662F\u5BF9\u4E8E WLS \u89C6\u4E3A\u6B63\u5E38\u3002
500 VerifyNoneRule_TEXT_INFO=\u5E94\u7528\u7A0B\u5E8F\u6B63\u5728\u7981\u7528\u5B57\u8282\u7801\u9A8C\u8BC1\u7684\u60C5\u51B5\u4E0B\u8FD0\u884C\u3002
501 VerifyNoneRule_TEXT_INFO_LONG=\u5E94\u7528\u7A0B\u5E8F\u6B63\u5728\u7981\u7528\u5B57\u8282\u7801\u9A8C\u8BC1\u7684\u60C5\u51B5\u4E0B\u8FD0\u884C\u3002\u7981\u7528\u5B57\u8282\u7801\u9A8C\u8BC1\u4E0D\u5B89\u5168\uFF0C\u4E0D\u5E94\u5728\u751F\u4EA7\u73AF\u5883\u4E2D\u4F7F\u7528\u3002\u5982\u679C\u5BF9\u4E8E\u5E94\u7528\u7A0B\u5E8F\u4E0D\u5FC5\u8981\uFF0C\u5219\u4E0D\u5728\u547D\u4EE4\u884C\u4E0A\u4F7F\u7528 &#39;-Xverify:none&#39; \u6216 &#39;-noverify&#39;\u3002\u8BF7\u53C2\u9605 &lt;a href=&quot;https://www.securecoding.cert.org/confluence/display/java/ENV04-J.+Do+not+disable+bytecode+verification&quot;&gt;Secure Coding Standard for Java&lt;/a&gt;\u3002
502 VerifyNoneRule_RULE_NAME=\u5B57\u8282\u7801\u9A8C\u8BC1
503 VerifyNoneRule_TEXT_OK=\u5E94\u7528\u7A0B\u5E8F\u6B63\u5728\u542F\u7528\u5B57\u8282\u7801\u9A8C\u8BC1\u7684\u60C5\u51B5\u4E0B\u8FD0\u884C\u3002
504 DebugNonSafepointsRule_RULE_NAME=DebugNonSafepoints
505 DebugNonSafepointsRule_DISABLED_TEXT_INFO=\u5DF2\u663E\u5F0F\u7981\u7528 DebugNonSafepoints\u3002
506 DebugNonSafepointsRule_NOT_ENABLED_TEXT_INFO=\u672A\u542F\u7528 DebugNonSafepoints\u3002
507 DebugNonSafepointsRule_NOT_ENABLED_TEXT_INFO_LONG=\u5982\u679C\u672A\u542F\u7528 DebugNonSafepoints\uFF0C\u5219\u65B9\u6CD5\u6982\u8981\u5206\u6790\u6570\u636E\u51C6\u786E\u5EA6\u8F83\u4F4E\uFF0C\u56E0\u4E3A\u5BF9\u672A\u5904\u4E8E\u5B89\u5168\u70B9\u7684\u7EBF\u7A0B\u91C7\u6837\u4F1A\u4E0D\u6B63\u786E\u3002\u4F7F\u7528\u4EE5\u4E0B JVM \u6807\u8BB0\u542F\u7528\u6B64\u9879\uFF1A&#39;-XX:+UnlockDiagnosticVMOptions -XX:+DebugNonSafepoints&#39;\u3002\u542F\u7528\u8FD9\u4E9B\u6807\u8BB0\u4F1A\u9020\u6210\u5C11\u91CF\u7684\u6027\u80FD\u5F00\u9500\u3002\u6709\u5173\u8BE6\u7EC6\u4FE1\u606F\uFF0C\u8BF7\u53C2\u9605 &lt;a href=&quot;http://openjdk.java.net/groups/hotspot/docs/RuntimeOverview.html#Thread%20Management|outline&quot;&gt;HotSpot Runtime Overview/Thread Management&lt;/a&gt;\u3002
508 DebugNonSafepointsRule_TEXT_OK=\u5DF2\u663E\u5F0F\u542F\u7528 DebugNonSafepoints\u3002
509 DebugNonSafepointsRule_IMPLICIT_TEXT_OK=\u521B\u5EFA\u6B64\u8BB0\u5F55\u6240\u4F7F\u7528\u7684 JVM \u7248\u672C\u4E2D\u9690\u5F0F\u542F\u7528\u4E86 DebugNonSafepoints\u3002
510 DiscouragedGcOptionsRule_RULE_NAME=GC \u8BBE\u7F6E
511 DiscouragedGcOptionsRule_TEXT_OK=\u5728 GC \u914D\u7F6E\u4E2D\u672A\u53D1\u73B0\u95EE\u9898\u3002
512 DiscouragedVmOptionsRule_RULE_NAME=\u4E0D\u5EFA\u8BAE\u7684 VM \u9009\u9879
513 DiscouragedVmOptionsRule_TEXT_OK=\u5728 VM \u9009\u9879\u4E2D\u672A\u53D1\u73B0\u95EE\u9898\u3002
514 DiscouragedVmOptionsRule_BOTH_EXPERIMENTAL_AND_IGNORE=\u5728\u5DF2\u542F\u7528\u8BD5\u9A8C\u6027 VM \u9009\u9879\u4E14\u5FFD\u7565\u4E86\u65E0\u6CD5\u8BC6\u522B\u7684 VM \u9009\u9879\u7684 JVM \u4E0A\u6267\u884C\u4E86\u8BB0\u5F55\u3002
515 PasswordsInArgsRule_JAVAARGS_TEXT_INFO=\u8BB0\u5F55\u4E2D\u7684\u5E94\u7528\u7A0B\u5E8F\u53C2\u6570\u53EF\u80FD\u5305\u542B\u53E3\u4EE4\u3002
516 # {0} is a list of argument strings
517 PasswordsInArgsRule_JAVAARGS_TEXT_INFO_LONG=\u5728\u6B64\u8BB0\u5F55\u4E2D\u53D1\u73B0\u4E86\u4EE5\u4E0B\u53EF\u7591\u5E94\u7528\u7A0B\u5E8F\u53C2\u6570\uFF1A{0}&lt;p&gt;\u8FD9\u4E9B\u53C2\u6570\u4E2D\u53EF\u80FD\u5305\u542B\u5BC6\u7801\u3002\u5982\u679C\u4E0D\u5E0C\u671B\u5C06\u5BC6\u7801\u76F4\u63A5\u4F5C\u4E3A Java \u8FDB\u7A0B\u7684\u53C2\u6570\uFF0C\u901A\u5E38\u4F1A\u6709\u5176\u4ED6\u65B9\u6CD5\u5411\u8F6F\u4EF6\u63D0\u4F9B\u5BC6\u7801\u3002\u5982\u679C\u60A8\u5E0C\u671B\u7EE7\u7EED\u5C06\u5BC6\u7801\u7528\u4F5C\u53C2\u6570\uFF0C\u4F46\u5E0C\u671B\u80FD\u591F\u5171\u4EAB\u8BB0\u5F55\u800C\u4E0D\u540C\u65F6\u5171\u4EAB\u5BC6\u7801\uFF0C\u8BF7\u7981\u7528\u201CJVM \u4FE1\u606F\u201D\u4E8B\u4EF6\u3002\u8BF7\u6CE8\u610F\uFF0C\u7981\u7528\u201CJVM \u4FE1\u606F\u201D\u4E8B\u4EF6\u4F1A\u9650\u5236\u98DE\u884C\u8BB0\u5F55\u5668\u81EA\u52A8\u5206\u6790\u7684\u529F\u80FD\u3002
518 PasswordsInArgsRule_RULE_NAME=Java \u53C2\u6570\u4E2D\u7684\u53E3\u4EE4
519 PasswordsInArgsRule_TEXT_OK=\u8BB0\u5F55\u4F3C\u4E4E\u6CA1\u6709\u5728\u5E94\u7528\u7A0B\u5E8F\u53C2\u6570\u4E2D\u5305\u542B\u53E3\u4EE4\u3002
520 PasswordsInEnvironmentRuleFactory_RULE_NAME=\u73AF\u5883\u53D8\u91CF\u4E2D\u7684\u53E3\u4EE4
521 PasswordsInEnvironmentRuleFactory_TEXT_INFO=\u8BB0\u5F55\u4E2D\u7684\u73AF\u5883\u53D8\u91CF\u53EF\u80FD\u5305\u542B\u53E3\u4EE4\u3002
522 # {0} is a list of environment variable names
523 PasswordsInEnvironmentRuleFactory_TEXT_INFO_LONG=\u5728\u6B64\u8BB0\u5F55\u4E2D\u53D1\u73B0\u4E86\u4EE5\u4E0B\u53EF\u7591\u73AF\u5883\u53D8\u91CF\uFF1A{0}&lt;p&gt;\u8FD9\u4E9B\u53D8\u91CF\u4E2D\u53EF\u80FD\u5305\u542B\u5BC6\u7801\u3002\u5982\u679C\u60A8\u5E0C\u671B\u7EE7\u7EED\u5728\u73AF\u5883\u53D8\u91CF\u4E2D\u5305\u62EC\u5BC6\u7801\uFF0C\u4F46\u5E0C\u671B\u80FD\u591F\u5171\u4EAB\u8BB0\u5F55\u800C\u4E0D\u540C\u65F6\u5171\u4EAB\u5BC6\u7801\uFF0C\u8BF7\u7981\u7528\u201C\u521D\u59CB\u73AF\u5883\u53D8\u91CF\u201D\u4E8B\u4EF6\u3002
524 PasswordsInEnvironmentRuleFactory_TEXT_OK=\u8BB0\u5F55\u4F3C\u4E4E\u6CA1\u6709\u5728\u73AF\u5883\u53D8\u91CF\u4E2D\u5305\u542B\u53E3\u4EE4\u3002
525 PasswordsInSystemPropertiesRule_RULE_NAME=\u7CFB\u7EDF\u5C5E\u6027\u4E2D\u7684\u53E3\u4EE4
526 PasswordsInSystemPropertiesRule_TEXT_INFO=\u8BB0\u5F55\u4E2D\u7684\u7CFB\u7EDF\u5C5E\u6027\u53EF\u80FD\u5305\u542B\u53E3\u4EE4\u3002
527 # {0} is a list of system property names
528 PasswordsInSystemPropertiesRule_TEXT_INFO_LONG=\u5728\u6B64\u8BB0\u5F55\u4E2D\u53D1\u73B0\u4E86\u4EE5\u4E0B\u53EF\u7591\u7CFB\u7EDF\u5C5E\u6027\uFF1A{0}&lt;p&gt;\u8FD9\u4E9B\u5C5E\u6027\u4E2D\u53EF\u80FD\u5305\u542B\u5BC6\u7801\u3002\u5982\u679C\u60A8\u5E0C\u671B\u7EE7\u7EED\u5728\u7CFB\u7EDF\u5C5E\u6027\u4E2D\u5305\u62EC\u5BC6\u7801\uFF0C\u4F46\u5E0C\u671B\u80FD\u591F\u5171\u4EAB\u8BB0\u5F55\u800C\u4E0D\u540C\u65F6\u5171\u4EAB\u5BC6\u7801\uFF0C\u8BF7\u7981\u7528\u201C\u521D\u59CB\u7CFB\u7EDF\u5C5E\u6027\u201D\u4E8B\u4EF6\u3002
529 PasswordsInSystemPropertiesRule_TEXT_OK=\u8BB0\u5F55\u4F3C\u4E4E\u6CA1\u6709\u5728\u7CFB\u7EDF\u5C5E\u6027\u4E2D\u5305\u542B\u53E3\u4EE4\u3002
530 ReferenceStatisticsType_FINAL_REFERENCES=\u6700\u7EC8\u5F15\u7528
531 ReferenceStatisticsType_PHANTOM_REFERENCES=\u5E7B\u50CF\u5F15\u7528
532 ReferenceStatisticsType_SOFT_REFERENCES=\u8F6F\u5F15\u7528
533 ReferenceStatisticsType_WEAK_REFERENCES=\u5F31\u5F15\u7528
534 SerialGcOnMultiCpuRuleFactory_TEXT_INFO=\u5728\u591A\u6838\u8BA1\u7B97\u673A\u4E0A\u4F7F\u7528\u4E86\u4E32\u884C\u6536\u96C6\u5668\u3002
535 SerialGcOnMultiCpuRuleFactory_TEXT_INFO_LONG=JVM \u4F7F\u7528\u4E86\u4E32\u884C GC, \u4F46\u5B83\u8FD0\u884C\u5728\u591A\u6838\u8BA1\u7B97\u673A\u4E0A\u3002\u6539\u4E3A\u4F7F\u7528\u5E76\u53D1\u6807\u8BB0\u6E05\u9664, G1 \u6216\u5E76\u884C GC \u53EF\u80FD\u4F1A\u83B7\u5F97\u66F4\u597D\u7684 GC \u6027\u80FD\u3002
536 SerialOldRuleFactory_TEXT_WARN_CMS=\u4F7F\u7528\u4E86 CMS \u5783\u573E\u6536\u96C6\u5668, \u4F46 JVM \u5FC5\u987B\u8FD8\u539F\u4E3A\u6267\u884C\u4E32\u884C\u5E74\u8001\u4EE3\u6536\u96C6\u3002
537 SerialOldRuleFactory_TEXT_WARN_CMS_LONG=\u5E94\u7528\u7A0B\u5E8F\u4F7F\u7528\u4E86\u5E76\u53D1\u6807\u8BB0\u6E05\u9664\u5783\u573E\u6536\u96C6\u5668\uFF0C\u4F46 JVM \u5FC5\u987B\u8FD8\u539F\u4E3A\u6267\u884C\u4E32\u884C\u5E74\u8001\u4EE3\u6536\u96C6\uFF0C\u8FD9\u9700\u8981\u4E00\u4E9B\u65F6\u95F4\u3002\u8FD9\u662F\u56E0\u4E3A\u5E76\u53D1\u6536\u96C6\u5668\u65E0\u6CD5\u6EE1\u8DB3\u6536\u96C6\u671F\u95F4\u53D1\u751F\u7684\u5BF9\u8C61\u5206\u914D\u7684\u9700\u8981\u3002\u901A\u8FC7\u964D\u4F4E &lt;a href=&quot;https://docs.oracle.com/javase/8/docs/technotes/guides/vm/gctuning/cms.html&quot;&gt;-XX:CMSInitiatingOccupancyFraction&lt;/a&gt; \u503C\u53EF\u51CF\u5C11\u8FD9\u79CD\u98CE\u9669\u3002
538 SerialOldRuleFactory_TEXT_WARN_G1=\u4F7F\u7528\u4E86 G1 \u5783\u573E\u6536\u96C6\u5668, \u4F46 JVM \u5FC5\u987B\u8FD8\u539F\u4E3A\u6267\u884C\u4E32\u884C\u5E74\u8001\u4EE3\u6536\u96C6\u3002
539 SerialOldRuleFactory_TEXT_WARN_G1_LONG=JVM \u4F7F\u7528\u4E86 G1 \u5783\u573E\u6536\u96C6\u5668\uFF0C\u4F46\u5FC5\u987B\u8FD8\u539F\u4E3A\u6267\u884C\u4E32\u884C\u5E74\u8001\u4EE3\u6536\u96C6\uFF0C\u8FD9\u9700\u8981\u4E00\u4E9B\u65F6\u95F4\u3002\u8FD9\u662F\u56E0\u4E3A G1 \u6536\u96C6\u5668\u65E0\u6CD5\u6EE1\u8DB3\u6536\u96C6\u671F\u95F4\u53D1\u751F\u7684\u5BF9\u8C61\u5206\u914D\u7684\u9700\u8981\u3002\u901A\u8FC7\u964D\u4F4E &lt;a href=&quot;http://www.oracle.com/technetwork/articles/java/vmoptions-jsp-140102.html&quot;&gt;-XX:InitiatingHeapOccupancyPercent&lt;/a&gt; \u503C\u53EF\u51CF\u5C11\u8FD9\u79CD\u98CE\u9669\u3002\u6B64 &lt;a href=&quot;http://www.oracle.com/technetwork/articles/java/g1gc-1984535.html&quot;&gt;G1 \u4F18\u5316\u6587\u7AE0&lt;/a&gt;\u53EF\u63D0\u4F9B\u5E2E\u52A9\u3002
540 SocketReadRule_CONFIG_INFO_LIMIT=\u5957\u63A5\u5B57\u8BFB\u53D6\u6301\u7EED\u65F6\u95F4\u4FE1\u606F\u9650\u5236
541 SocketReadRule_CONFIG_INFO_LIMIT_LONG=\u89E6\u53D1\u4FE1\u606F\u901A\u77E5\u6240\u9700\u7684\u6700\u77ED\u5957\u63A5\u5B57\u8BFB\u53D6\u6301\u7EED\u65F6\u95F4
542 SocketReadRule_CONFIG_WARNING_LIMIT=\u5957\u63A5\u5B57\u8BFB\u53D6\u6301\u7EED\u65F6\u95F4\u8B66\u544A\u9650\u5236
543 SocketReadRule_CONFIG_WARNING_LIMIT_LONG=\u89E6\u53D1\u8B66\u544A\u6240\u9700\u7684\u6700\u77ED\u5957\u63A5\u5B57\u8BFB\u53D6\u6301\u7EED\u65F6\u95F4
544 SocketReadRuleFactory_RULE_NAME=\u5957\u63A5\u5B57\u8BFB\u53D6\u5CF0\u503C\u6301\u7EED\u65F6\u95F4
545 # {0} is a time period
546 SocketReadRuleFactory_TEXT_OK=\u5728\u6B64\u8BB0\u5F55\u4E2D\u672A\u627E\u5230\u957F\u65F6\u95F4\u7684\u5957\u63A5\u5B57\u8BFB\u53D6\u6682\u505C\uFF08\u6700\u957F\u4E3A {0}\uFF09\u3002
547 SocketReadRuleFactory_TEXT_NO_EVENTS=\u6B64\u8BB0\u5F55\u4E2D\u6CA1\u6709\u4EFB\u4F55\u5957\u63A5\u5B57\u8BFB\u53D6\u4E8B\u4EF6\u3002
548 SocketReadRuleFactory_TEXT_RMI_NOTE=\u8BF7\u6CE8\u610F\uFF0C\u4E00\u4E9B\u5957\u63A5\u5B57\u8BFB\u53D6\u6A21\u5F0F\u5177\u6709\u6211\u4EEC\u89C6\u4E3A\u6B63\u5E38\u4ECE\u800C\u88AB\u6392\u9664\u7684\u957F\u65F6\u95F4\u8BFB\u53D6\u3002\u6B64\u7C7B\u6A21\u5F0F\u5305\u62EC JMX RMI \u901A\u4FE1\u548C MQ \u7CFB\u5217\u3002
549 # {0} is a time period
550 SocketReadRuleFactory_TEXT_WARN=\u6B64\u8BB0\u5F55\u4E2D\u6709\u957F\u65F6\u95F4\u7684\u5957\u63A5\u5B57\u8BFB\u53D6\u6682\u505C\uFF08\u6700\u957F\u4E3A {0}\uFF09\u3002
551 # {0} is a time period, {1} is a host name, {2} is a size in bytes
552 SocketReadRuleFactory_TEXT_WARN_LONG=\u6700\u957F\u7684\u8BB0\u5F55\u5957\u63A5\u5B57\u8BFB\u53D6\u82B1\u8D39\u4E86 {0} \u6765\u4ECE\u4E3B\u673A {1} \u8BFB\u53D6 {2}\u3002
553 SocketWriteRule_CONFIG_INFO_LIMIT=\u5957\u63A5\u5B57\u5199\u5165\u6301\u7EED\u65F6\u95F4\u4FE1\u606F\u9650\u5236
554 SocketWriteRule_CONFIG_INFO_LIMIT_LONG=\u89E6\u53D1\u4FE1\u606F\u901A\u77E5\u6240\u9700\u7684\u6700\u77ED\u5957\u63A5\u5B57\u5199\u5165\u6301\u7EED\u65F6\u95F4
555 SocketWriteRule_CONFIG_WARNING_LIMIT=\u5957\u63A5\u5B57\u5199\u5165\u6301\u7EED\u65F6\u95F4\u8B66\u544A\u9650\u5236
556 SocketWriteRule_CONFIG_WARNING_LIMIT_LONG=\u89E6\u53D1\u8B66\u544A\u6240\u9700\u7684\u6700\u77ED\u5957\u63A5\u5B57\u5199\u5165\u6301\u7EED\u65F6\u95F4
557 SocketWriteRuleFactory_RULE_NAME=\u5957\u63A5\u5B57\u5199\u5165\u5CF0\u503C\u6301\u7EED\u65F6\u95F4
558 # {0} is a time period
559 SocketWriteRuleFactory_TEXT_OK=\u5728\u6B64\u8BB0\u5F55\u4E2D\u672A\u627E\u5230\u957F\u65F6\u95F4\u7684\u5957\u63A5\u5B57\u5199\u5165\u6682\u505C\uFF08\u6700\u957F\u4E3A {0}\uFF09\u3002
560 SocketWriteRuleFactory_TEXT_NO_EVENTS=\u6B64\u8BB0\u5F55\u4E2D\u6CA1\u6709\u4EFB\u4F55\u5957\u63A5\u5B57\u5199\u5165\u4E8B\u4EF6\u3002
561 SocketWriteRuleFactory_TEXT_RMI_NOTE=\u8BF7\u6CE8\u610F\uFF0C\u4E00\u4E9B\u5957\u63A5\u5B57\u5199\u5165\u6A21\u5F0F\u5177\u6709\u6211\u4EEC\u89C6\u4E3A\u6B63\u5E38\u4ECE\u800C\u88AB\u6392\u9664\u7684\u957F\u65F6\u95F4\u5199\u5165\u3002\u6B64\u7C7B\u6A21\u5F0F\u5305\u62EC JMX RMI \u901A\u4FE1\u3002
562 # {0} is a time period
563 SocketWriteRuleFactory_TEXT_WARN=\u6B64\u8BB0\u5F55\u4E2D\u6709\u957F\u65F6\u95F4\u7684\u5957\u63A5\u5B57\u5199\u5165\u6682\u505C\uFF08\u6700\u957F\u4E3A {0}\uFF09\u3002
564 # {0} is a time period, {1} is a host name, {2} is a size in bytes
565 SocketWriteRuleFactory_TEXT_WARN_LONG=\u6700\u957F\u7684\u8BB0\u5F55\u5957\u63A5\u5B57\u5199\u5165\u82B1\u8D39\u4E86 {0} \u6765\u5C06 {2} \u5199\u5165\u4E3B\u673A {1}\u3002
566 StackdepthSettingRule_RULE_NAME=\u5806\u6808\u6DF1\u5EA6\u8BBE\u7F6E
567 StackdepthSettingRule_TEXT_INFO=\u6B64\u8BB0\u5F55\u4E2D\u622A\u65AD\u4E86\u4E00\u4E9B\u5806\u6808\u8DDF\u8E2A\u3002
568 # {0} is a number, {1} is an empty String or StackdepthSettingRule_TEXT_INFO_LONG_DEFAULT, {2} is a percentage, {3} is an HTML list of event type names
569 StackdepthSettingRule_TEXT_INFO_LONG=\u98DE\u884C\u8BB0\u5F55\u5668\u53EA\u8BB0\u5F55\u5176\u6DF1\u5EA6\u4E0D\u8D85\u8FC7\u8BBE\u7F6E\u4E3A {0} \u7684\u6700\u5927\u5806\u6808\u6DF1\u5EA6\u503C\u7684\u8DDF\u8E2A\u3002\u6240\u6709\u8DDF\u8E2A\u7684 {1}{2} \u5927\u4E8E\u6B64\u9009\u9879\uFF0C\u56E0\u6B64\u88AB\u622A\u65AD\u3002\u5982\u679C\u9700\u8981\u66F4\u8BE6\u7EC6\u7684\u8DDF\u8E2A\uFF0C\u8BF7\u589E\u52A0 &#39;&#39;-XX:FlightRecorderOptions=stackdepth=&amp;lt;value&amp;gt;&#39;&#39; \u503C\u3002&lt;p&gt;\u4EE5\u4E0B\u7C7B\u578B\u7684\u4E8B\u4EF6\u5305\u62EC\u622A\u65AD\u7684\u5806\u6808\u8DDF\u8E2A\uFF1A&lt;ul&gt;{3}&lt;/ul&gt;
570 StackdepthSettingRule_TEXT_INFO_LONG_DEFAULT=\u8FD9\u662F\u9ED8\u8BA4\u6DF1\u5EA6\u3002
571 StackdepthSettingRule_TEXT_NA=\u672A\u8BB0\u5F55\u5E26\u6709\u5806\u6808\u8DDF\u8E2A\u7684\u4E8B\u4EF6\u3002
572 StackdepthSettingRule_TEXT_OK=\u6B64\u8BB0\u5F55\u4E2D\u672A\u622A\u65AD\u5806\u6808\u8DDF\u8E2A\u3002
573 # {0} is an event type name, {1} is a percentage, this is a template that is reused inside &lt;li&gt; tags in the StackdepthSettingRule_TEXT_INFO_LONG {1} parameter
574 StackdepthSettingRule_TYPE_LIST_TEMPLATE={0}\uFF08\u5DF2\u622A\u65AD {1} \u7684\u8DDF\u8E2A\uFF09
575 
576 StringDeduplicationRule_RULE_NAME=\u5B57\u7B26\u4E32\u53D6\u6D88\u91CD\u590D
577 StringDeduplicationRule_STRING_ARRAY_ALLOCATION_FRAMES=\u5B57\u7B26\u4E32\u5185\u90E8\u6570\u7EC4\u5206\u914D\u5E27
578 StringDeduplicationRule_STRING_ARRAY_ALLOCATION_FRAMES_DESC=\u5206\u914D\u4E86\u5B57\u7B26\u4E32\u5185\u90E8\u5B57\u7B26/\u5B57\u8282\u6570\u7EC4\u7684\u5E27\u7684\u9017\u53F7\u5206\u9694\u5217\u8868\u3002
579 StringDeduplicationRule_STRING_ARRAY_LIVESET_RATIO_AND_HEAP_USAGE_LIMIT=\u5806\u4F7F\u7528\u91CF + \u5B57\u7B26\u4E32\u5185\u90E8\u6570\u7EC4\u6D3B\u52A8\u96C6\u6BD4\u7387\u4FE1\u606F\u9650\u5236
580 StringDeduplicationRule_STRING_ARRAY_LIVESET_RATIO_AND_HEAP_USAGE_LIMIT_DESC=\u5982\u679C\u5806\u4F7F\u7528\u7387\u52A0\u4E0A\u5B57\u7B26\u4E32\u5185\u90E8\u5B57\u7B26/\u5B57\u8282\u6570\u7EC4\u4E0E\u603B\u6D3B\u52A8\u96C6\u7684\u6BD4\u7387\u8D85\u8FC7\u4E86\u6B64\u9650\u5236\uFF0C\u5219\u5C06\u89E6\u53D1\u4FE1\u606F\u901A\u77E5\u3002
581 StringDeduplicationRule_STRING_ARRAY_ALLOCATION_RATIO_AND_HEAP_USAGE_LIMIT=\u5806\u4F7F\u7528\u91CF + \u5B57\u7B26\u4E32\u5185\u90E8\u6570\u7EC4\u5206\u914D\u4FE1\u606F\u9650\u5236
582 StringDeduplicationRule_STRING_ARRAY_ALLOCATION_RATIO_AND_HEAP_USAGE_LIMIT_DESC=\u5982\u679C\u5806\u4F7F\u7528\u7387\u52A0\u4E0A\u5206\u914D\u7684\u5B57\u7B26\u4E32\u5185\u90E8\u5B57\u7B26/\u5B57\u8282\u6570\u7EC4\u4E0E\u603B\u5206\u914D\u7684\u6BD4\u7387\u8D85\u8FC7\u4E86\u6B64\u9650\u5236\uFF0C\u5219\u5C06\u89E6\u53D1\u4FE1\u606F\u901A\u77E5\u3002
583 StringDeduplicationRule_RESULT_USE_STRING_DEDUPLICATION_ENABLED=\u5DF2\u542F\u7528\u5B57\u7B26\u4E32\u53D6\u6D88\u91CD\u590D\u3002
584 StringDeduplicationRule_RESULT_GC_LONG=\u4EC5\u5F53\u4F7F\u7528 G1(JDK 8u20+) \u6216 Shenandoah \u5783\u573E\u6536\u96C6\u5668\u65F6\u624D\u652F\u6301\u5B57\u7B26\u4E32\u53D6\u6D88\u91CD\u590D\u3002\u5982\u679C\u8981\u4F7F\u7528\u6B64\u529F\u80FD\uFF0C\u53EF\u4EE5\u901A\u8FC7\u4F7F\u7528 &#39;-XX:+UseG1GC&#39; \u542F\u7528 G1\uFF0C\u6216\u4F7F\u7528 &#39;-XX:+UseShenandoahGC&#39; \u542F\u7528 Shenandoah\u3002
585 StringDeduplicationRule_RESULT_DONT_RECOMMEND_STRING_DEDUPLICATION=\u542F\u7528\u5B57\u7B26\u4E32\u53D6\u6D88\u91CD\u590D\u53EF\u80FD\u6CA1\u6709\u4EC0\u4E48\u5927\u7684\u597D\u5904\u3002
586 StringDeduplicationRule_RESULT_RECOMMEND_STRING_DEDUPLICATION=\u60A8\u7684\u5E94\u7528\u7A0B\u5E8F\u53EF\u80FD\u4F1A\u53D7\u76CA\u4E8E\u542F\u7528\u5B57\u7B26\u4E32\u53D6\u6D88\u91CD\u590D\u3002
587 # {0} is an event type, # {1} is an event type
588 StringDeduplicationRule_RESULT_NO_MAX_HEAP_INFO=\u6CA1\u6709\u5173\u4E8E\u6700\u5927\u5806\u5927\u5C0F\u7684\u53EF\u7528\u4FE1\u606F\uFF0C\u8BF7\u542F\u7528\u4E8B\u4EF6\u7C7B\u578B {0} \u6216 {1} \u6765\u63D0\u9AD8\u6B64\u89C4\u5219\u7684\u7CBE\u5EA6\u3002
589 StringDeduplicationRule_RESULT_NO_ALLOC_ITEMS=\u5BF9\u4E8E\u5B57\u7B26\u4E32\u4E2D\u7684\u5185\u90E8\u6570\u7EC4\uFF0C\u672A\u627E\u5230\u5206\u914D\u4E8B\u4EF6\u3002\u672A\u6B63\u786E\u5B9A\u4E49\u5E27\u7B5B\u9009\u5668\u9996\u9009\u9879\uFF0C\u6216\u8005\u6CA1\u6709\u4E3A\u5206\u914D\u4E8B\u4EF6\u542F\u7528 stackTrace \u5C5E\u6027\u3002
590 # {0} is a percentage
591 StringDeduplicationRule_RESULT_HEAP_USAGE=\u5806\u5927\u7EA6 {0}% \u5DF2\u6EE1\u3002
592 # {0} is a percentage, {1} is either &#39;byte[]&#39; or &#39;char[]&#39;
593 StringDeduplicationRule_RESULT_STRING_ARRAY_LIVESET_RATIO=\u5927\u7EA6 {0}% \u7684\u6D3B\u52A8\u96C6\u5305\u542B\u5185\u90E8\u6570\u7EC4\u7C7B\u578B\u7684\u5B57\u7B26\u4E32\uFF08\u5BF9\u4E8E\u6B64 JDK \u7248\u672C\uFF0C\u4E3A &#39;&#39;{1}&#39;&#39;\uFF09\u3002
594 # {0} is a percentage, {1} is either &#39;byte[]&#39; or &#39;char[]&#39;
595 StringDeduplicationRule_RESULT_STRING_ARRAY_ALLOCATION_RATIO=\u6240\u6709\u5206\u914D\u7684\u5927\u7EA6 {0}% \u4E3A\u5B57\u7B26\u4E32\u4E2D\u7684\u5185\u90E8\u6570\u7EC4\uFF08\u5BF9\u4E8E\u6B64 JDK \u7248\u672C\uFF0C\u4E3A {1}\uFF09\u3002
596 StringDeduplicationRule_RESULT_LONG_DESCRIPTION=\u4F7F\u7528 JVM \u6807\u8BB0 &#39;-XX:+UseStringDeduplication&#39; \u542F\u7528\u5B57\u7B26\u4E32\u53D6\u6D88\u91CD\u590D\u3002\u6B64\u6807\u8BB0\u53EF\u5728 JDK 8u20 \u53CA\u66F4\u9AD8\u7248\u672C\u4E2D\u4E0E G1 \u5783\u573E\u6536\u96C6\u5668\u4E00\u8D77\u4F7F\u7528\uFF0C\u6216\u4E0E Shenandoah \u5783\u573E\u56DE\u6536\u5668\u4E00\u8D77\u4F7F\u7528\u3002&lt;p&gt;\u8981\u9A8C\u8BC1\u8FD9\u6837\u662F\u5426\u63D0\u9AD8\u4E86\u5E94\u7528\u7A0B\u5E8F\u6027\u80FD\uFF0C\u8BF7\u5728\u4F7F\u7528\u548C\u4E0D\u4F7F\u7528\u5B57\u7B26\u4E32\u53D6\u6D88\u91CD\u590D\u7684\u60C5\u51B5\u4E0B\u521B\u5EFA\u98DE\u884C\u8BB0\u5F55\u3002\u5BF9\u4E8E\u5728\u542F\u7528\u5B57\u7B26\u4E32\u53D6\u6D88\u91CD\u590D\u60C5\u51B5\u4E0B\u7684\u8FD0\u884C\uFF0C\u8FD8\u4F7F\u7528 &#39;-XX:+PrintStringDeduplicationStatistics&#39;\uFF08\u5BF9\u4E8E JDK 8\uFF09\u6216 &#39;-Xlog:stringdedup*=debug&#39;\uFF08\u5BF9\u4E8E JDK 9\uFF09\u542F\u7528\u7EDF\u8BA1\u4FE1\u606F\u3002\u68C0\u67E5\u542F\u7528\u4E86\u5B57\u7B26\u4E32\u53D6\u6D88\u91CD\u590D\u7684\u8BB0\u5F55\u4E2D\u7684\u5806\u6D3B\u52A8\u96C6\u51CF\u5C11\u91CF\u662F\u5426\u5927\u4E8E\u5B57\u7B26\u4E32\u53D6\u6D88\u91CD\u590D\u5143\u6570\u636E\u8868\u7684\u5927\u5C0F\u3002\u4EE5\u201C\u8868/\u5185\u5B58\u4F7F\u7528\u91CF\uFF1AXX MB\u201D\u5F62\u5F0F\u5728\u7EDF\u8BA1\u4FE1\u606F\u8F93\u51FA\u4E2D\u8F93\u51FA\u5143\u6570\u636E\u8868\u7684\u5927\u5C0F&lt;p&gt;\u53EF\u4EE5\u5728 java \u9009\u9879\u6587\u6863\u6216 &lt;a href=&quot;https://openjdk.java.net/jeps/192&quot;&gt;JEP 192&lt;/a&gt; \u4E2D\u9605\u8BFB\u6709\u5173\u5B57\u7B26\u4E32\u53D6\u6D88\u91CD\u590D\u7684\u8BE6\u7EC6\u4FE1\u606F\u3002
597 SystemGcRule_CONFIG_WARNING_LIMIT=System.gc() \u6BD4\u7387\u9650\u5236
598 SystemGcRule_CONFIG_WARNING_LIMIT_LONG=System.gc() \u4E0E\u5783\u573E\u6536\u96C6\u603B\u6570\u4E4B\u95F4\u6BD4\u7387\u7684\u8B66\u544A\u9650\u5236
599 SystemGcRuleFactory_RULE_NAME=System.gc() \u5BFC\u81F4\u7684 GC
600 # {0} is a percentage
601 SystemGcRuleFactory_TEXT_INFO=System.gc() \u5BFC\u81F4\u4E86 {0} \u7684\u5783\u573E\u6536\u96C6\u3002
602 SystemGcRuleFactory_TEXT_INFO_LONG=\u8C03\u7528 System.gc() \u53EF\u80FD\u5E76\u975E\u6700\u4F73\u9009\u62E9\uFF0C\u56E0\u4E3A\u8FD9\u4F1A\u5BFC\u81F4\u4E0D\u5FC5\u8981\u7684\u5783\u573E\u6536\u96C6\u91CF\u3002\u5783\u573E\u6536\u96C6\u5668\u901A\u5E38\u53EF\u5F88\u597D\u5730\u81EA\u884C\u5904\u7406\u8FD9\u79CD\u60C5\u51B5\uFF0C\u800C\u4E0D\u5FC5\u8FDB\u884C\u663E\u5F0F\u8C03\u7528\u3002&lt;p&gt;\u8981\u4FEE\u590D\u6B64\u95EE\u9898\uFF0C\u8BF7\u5728\u4EE3\u7801\u4E2D\u5220\u9664\u4E0D\u5FC5\u8981\u7684 System.gc() \u8C03\u7528\u3002\u5982\u679C\u8C03\u7528\u662F\u7531\u60A8\u65E0\u6CD5\u66F4\u6539\u5143\u4EE3\u7801\u7684\u5E93\u8FDB\u884C\u7684\uFF0C\u60A8\u53EF\u4EE5\u6539\u4E3A\u4F7F\u7528\u547D\u4EE4\u884C\u6807\u8BB0 &#39;-XX:+DisableExplicitGC&#39;\u3002\u6B64\u6807\u8BB0\u4F7F JVM \u5FFD\u7565\u6240\u6709 System.gc() \u8C03\u7528\u3002
603 SystemGcRuleFactory_TEXT_OK=System.gc() \u672A\u5BFC\u81F4\u4EFB\u4F55\u5783\u573E\u6536\u96C6\u3002
604 TlabAllocationRatioRuleFactory_RULE_NAME=TLAB \u5206\u914D\u6BD4\u7387
605 # {0} is a percentage
606 TlabAllocationRatioRuleFactory_TEXT_INFO=\u7A0B\u5E8F\u5728 TLAB \u5916\u90E8\u5206\u914D\u4E86 {0} \u5185\u5B58\u3002
607 TlabAllocationRatioRuleFactory_TEXT_RECOMMEND_LESS_ALLOCATION=\u5728\u7EBF\u7A0B\u672C\u5730\u5206\u914D\u7F13\u51B2\u533A (Thread Local Allocation Buffer, TLAB) \u5916\u90E8\u5206\u914D\u5BF9\u8C61\u7684\u6210\u672C\u8981\u9AD8\u4E8E\u5728 TLAB \u5185\u90E8\u5206\u914D\u3002\u5982\u679C\u5355\u4E2A\u5206\u914D\u9884\u671F\u8981\u5927\u4E8E\u5408\u7406\u7684 TLAB\uFF0C\u5219\u53EF\u4EE5\u63A5\u53D7\u8FD9\u79CD\u505A\u6CD5\u3002\u901A\u8FC7\u51CF\u5C11\u5355\u4E2A\u5206\u914D\u7684\u5927\u5C0F\u53EF\u907F\u514D\u8FD9\u79CD\u60C5\u51B5\u3002\u5B58\u5728\u4E00\u4E9B\u53EF\u4EE5\u8BD5\u7528\u7684\u4E0E TLAB \u76F8\u5173\u7684 JVM \u6807\u8BB0\uFF0C\u4F46\u901A\u5E38\u6700\u597D\u8BA9 JVM \u81EA\u52A8\u7BA1\u7406 TLAB \u5927\u5C0F\u3002
608 TlabAllocationRatioRuleFactory_TEXT_INFO_ONLY_OUTSIDE=\u7A0B\u5E8F\u4EC5\u5728 TLAB \u5916\u90E8\u5206\u914D\u4E86\u5BF9\u8C61\u3002
609 TlabAllocationRatioRuleFactory_TEXT_INFO_ONLY_OUTSIDE_LONG=\u7A0B\u5E8F\u4EC5\u5728\u7EBF\u7A0B\u672C\u5730\u5206\u914D\u7F13\u51B2\u533A (Thread Local Allocation Buffer, TLAB) \u5916\u90E8\u5206\u914D\u4E86\u5BF9\u8C61\u3002
610 TlabAllocationRatioRuleFactory_TEXT_OK_NO_OUTSIDE=\u5728 TLAB \u5916\u90E8\u672A\u68C0\u6D4B\u5230\u5BF9\u8C61\u5206\u914D\u3002
611 UnlockExperimentalVMOptionsRuleFactory_TEXT_INFO=\u5728\u5DF2\u542F\u7528\u8BD5\u9A8C\u6027 VM \u9009\u9879\u7684 JVM \u4E0A\u6267\u884C\u4E86\u8BB0\u5F55\u3002
612 UnlockExperimentalVMOptionsRuleFactory_TEXT_INFO_LONG=\u7531\u4E8E\u4E0D\u5B8C\u5168\u652F\u6301\u8BD5\u9A8C\u6027 VM \u9009\u9879\uFF0C\u5E76\u53EF\u80FD\u56E0\u800C\u5BFC\u81F4\u4E0D\u7A33\u5B9A\uFF0C\u8FD9\u4E9B\u9009\u9879\u4E0D\u5E94\u5728\u751F\u4EA7\u73AF\u5883\u4E2D\u4F7F\u7528\u3002\u9664\u975E\u5FC5\u987B\u4F7F\u7528\u8BD5\u9A8C\u6027\u9009\u9879\uFF0C\u5426\u5219\u5E94\u907F\u514D\u4F7F\u7528 &#39;-XX:+UnlockExperimentalVMOptions&#39; \u547D\u4EE4\u884C\u9009\u9879\u3002
613 VMOperations_RULE_NAME=VM \u64CD\u4F5C\u5CF0\u503C\u6301\u7EED\u65F6\u95F4
614 VMOperationRule_CONFIG_WARNING_LIMIT=\u963B\u6B62 VM \u64CD\u4F5C\u6301\u7EED\u65F6\u95F4\u8B66\u544A\u9650\u5236
615 VMOperationRule_CONFIG_WARNING_LIMIT_LONG=\u89E6\u53D1\u8B66\u544A\u6240\u9700\u7684\u963B\u6B62 VM \u64CD\u4F5C\u6700\u77ED\u6301\u7EED\u65F6\u95F4
616 # {0} is a time period
617 VMOperationRuleFactory_TEXT_OK=\u5728\u6B64\u8BB0\u5F55\u4E2D\u672A\u627E\u5230\u65F6\u95F4\u8FC7\u957F\u7684 VM \u64CD\u4F5C\uFF08\u6700\u957F\u4E3A {0}\uFF09\u3002
618 # {0} is a time period
619 VMOperationRuleFactory_TEXT_WARN=\u6B64\u8BB0\u5F55\u4E2D\u6709\u957F\u65F6\u95F4\u7684\u963B\u6B62\u6027 VM \u64CD\u4F5C\uFF08\u6700\u957F\u4E3A {0}\uFF09\u3002
620 # {0} is a time period, {1} is a time stamp, {2} is a thread name, {3} is a time stamp
621 VMOperationRuleFactory_TEXT_WARN_LONG=\u6B64\u8BB0\u5F55\u4E2D\u6709\u957F\u65F6\u95F4\u7684\u963B\u6B62\u6027 VM \u64CD\u4F5C\u3002\u65F6\u95F4\u6700\u957F\u7684\u7C7B\u578B\u4E3A {1}\uFF0C\u6301\u7EED\u65F6\u95F4\u4E3A {0}\u3002\u5B83\u4ECE\u7EBF\u7A0B &#39;&#39;{2}&#39;&#39; \u542F\u52A8\uFF0C\u53D1\u751F\u4E8E {3}\u3002&lt;p&gt;VM \u64CD\u4F5C\u662F JVM \u5185\u90E8\u64CD\u4F5C\u3002\u4E00\u4E9B VM \u64CD\u4F5C\u540C\u6B65\u6267\u884C\uFF08\u5373\uFF0C\u4F1A\u963B\u6B62\u8C03\u7528\u7EBF\u7A0B\uFF09\uFF0C\u800C\u4E00\u4E9B\u64CD\u4F5C\u5219\u9700\u8981\u5728\u6240\u8C13\u7684\u5B89\u5168\u70B9\u4E0A\u6267\u884C\u3002\u5B89\u5168\u70B9\u8F6E\u8BE2\u662F\u5408\u4F5C\u6302\u8D77\u673A\u5236\uFF0C\u4F1A\u4E2D\u65AD JVM \u4E2D\u7684\u5B57\u8282\u7801\u6267\u884C\u3002\u5728\u5B89\u5168\u70B9\u4E0A\u53D1\u751F\u7684 VM \u64CD\u4F5C\u4F1A\u6709\u6548\u5730\u201C\u963B\u6B62\u6240\u6709\u64CD\u4F5C\u201D\uFF0C\u8FD9\u610F\u5473\u7740\u5728\u5B89\u5168\u70B9\u4E0A\u6267\u884C VM \u64CD\u4F5C\u65F6\uFF0C\u4EFB\u4F55\u7EBF\u7A0B\u4E2D\u7684 Java \u4EE3\u7801\u90FD\u4E0D\u4F1A\u6267\u884C\u3002\u5728\u5B89\u5168\u70B9\u4E0A\u957F\u65F6\u95F4\u6267\u884C\u7684 VM \u64CD\u4F5C\u4F1A\u5BF9\u5E94\u7528\u7A0B\u5E8F\u7684\u54CD\u5E94\u80FD\u529B\u9020\u6210\u4E0D\u5229\u5F71\u54CD\u3002&lt;p&gt;\u5982\u679C\u53D1\u73B0\u4E86\u6B64\u7C7B VM \u64CD\u4F5C\uFF0C\u64CD\u4F5C\u7684\u7C7B\u578B\u53CA\u5176\u8C03\u7528\u65B9\u7EBF\u7A0B\u4F1A\u63D0\u4F9B\u91CD\u8981\u4FE1\u606F\uFF0C\u53EF\u7528\u4E8E\u4E86\u89E3\u4E3A\u4EC0\u4E48\u51FA\u73B0\u8BE5 VM \u64CD\u4F5C\u3002\u5982\u9700\u67E5\u627E\u8BE6\u7EC6\u4FE1\u606F\uFF0C\u8BF7\u68C0\u67E5\u8C03\u7528\u65B9\u7EBF\u7A0B\u4E2D\u662F\u5426\u5B58\u5728\u4E0E\u6B64\u4E8B\u4EF6\u65F6\u95F4\u4EA4\u53C9\u7684\u4E8B\u4EF6\u3002\u67E5\u770B\u6B64\u4E8B\u4EF6\u7684\u5806\u6808\u8DDF\u8E2A\u53EF\u4EE5\u5E2E\u52A9\u786E\u5B9A\u5BFC\u81F4\u8BE5\u4E8B\u4EF6\u7684\u539F\u56E0\u3002&lt;/p&gt;&lt;p&gt;\u6709\u5173\u8BE6\u7EC6\u4FE1\u606F\uFF0C\u8BF7\u53C2\u9605 &lt;a href=&quot;http://openjdk.java.net/groups/hotspot/docs/RuntimeOverview.html&quot;&gt;Runtime Overview&lt;/a&gt;\u3002&lt;/p&gt;
622 
    </pre>
  </body>
</html>